{
    "name": "Yasin",
    "index": "036",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
       "verse_1": "Yasin.",
    "verse_2": "By the wise Quran.",
    "verse_3": "No doubt, you have been sent.",
    "verse_4": "On the straight path.",
    "verse_5": "Sent down by the Dignified, the Merciful.",
    "verse_6": "So that you may warn a people whose fathers were not warned, so they are unaware.",
    "verse_7": "Undoubtedly, the word has been proved against most of them, so they shall not believe.",
    "verse_8": "We have put on their necks chains reaching to their chins, so they remained raising up their faces.",
    "verse_9": "And We have set a barrier before them and a barrier behind them and covered them from above, therefore they see nothing.",
    "verse_10": "And it is equal for them whether you warn them or warn them not, they are not to believe.",
    "verse_11": "You warn only him who follows admonition and fears the Most Affectionate without seeing, so give him glad tidings of forgiveness and a respectable reward.",
    "verse_12": "Undoubtedly, We shall give life to the dead and We are noting down what they have sent forward and what signs they have left behind and We have already kept counted everything in a clean Book.",
    "verse_13": "And narrate them the signs of the people of a city, when there came to them sent ones.",
    "verse_14": "When We sent to them two. Then they belied them, so We strengthened them with a third, now they all said, 'verily we have been sent to you.'",
    "verse_15": "They said, 'you are not, but a man like us and the Most Affectionate has sent down nothing, you are only lying.",
    "verse_16": "They said, 'our Lord Knows that undoubtedly, we have necessarily been sent to you.",
    "verse_17": "'And on us is not but clear deliverance.'",
    "verse_18": "They said, 'We augur ill of you; undoubtedly, if you desist not, we shall then surely stone you, and a painful chastisement from us will certainly fall on you.'",
    "verse_19": "They said, ‘your ill star is with you. Do you start on it that you are made to understand? Nay, you are a people exceeding the limit.'",
    "verse_20": "And from the remote part of the city there came a man running. He said, 'O my people, follow the sent ones.",
    "verse_21": "'Follow those who do not ask any reward of you and they are on the right course.",
    "verse_22": "'And what is to me that I should not worship Him Who created me, and you are to return only to Him.",
    "verse_23": "'Shall I take, besides Allah, other gods that if the Most Affectionate intends any harm, their intercession shall not be of any use to me and nor would they save me?",
    "verse_24": "'Undoubtedly then I am in a clear error.",
    "verse_25": "'Undoubtedly I believed in your Lord, so listen to me.'",
    "verse_26": "It was said to him, enter the garden. He said, 'would that my people knew.",
    "verse_27": "'As my Lord has forgiven me and has made me of the honored ones.",
    "verse_28": "And We sent not against his people after him any army from the heaven and nor We ever to send down there any army.",
    "verse_29": "It was but only a shriek, hence they remained extinguished.",
    "verse_30": "(And it was said) Ah! Woes on those bondmen, when any Messenger comes to them, they merely mock at them.",
    "verse_31": "Have they not seen that how many generations before them We have destroyed? Now they are not to return to them.",
    "verse_32": "And all of them shall be made to appear before Us.",
    "verse_33": "And a sign for them is the dead earth; We gave life to it and We brought forth grains from it, then they eat therefrom.",
    "verse_34": "And We made therein gardens of dates and vines and We caused to gush forth springs therein.",
    "verse_35": "In order that they may eat the fruits thereof and it is not made of their hands. Will then they not be grateful?",
    "verse_36": "Sanctified is He Who has made all pairs of what the earth grows and of themselves and of those things of which they have no knowledge.",
    "verse_37": "And a sign for them is the night; We draw off the day therefrom, hence they are in darkness.",
    "verse_38": "And the sun runs to its appointed resting place. This is the commandment of the Dominant, the Knowing.",
    "verse_39": "And We have appointed stages for the moon till it becomes again like an old branch of palm tree.",
    "verse_40": "It is not for the sun that it might catch the moon and nor the night may supersede the day. And each one is floating in an orbit.",
    "verse_41": "And a sign for them is that We bore their offspring in a laden Ark.",
    "verse_42": "And We have created for them similar (vessels) on which they ride.",
    "verse_43": "And if We please, We may drown them, then there will be none to reach their cry nor they shall be rescued.",
    "verse_44": "But a mercy from Us and a convenience for a time.",
    "verse_45": "And when it is said to them, 'fear what is before you and what is to come behind you that perchance you may receive mercy, then they turn their faces'.",
    "verse_46": "And whenever there comes to them any sign out of the signs of their Lord, they turn their faces from it.",
    "verse_47": "And when it is said to them 'spend something out of that with which Allah has provided you', then the infidels say to the Muslims, 'shall we feed him whom Allah would have fed, if He had so willed? You are not but in a manifest error.",
    "verse_48": "And they say, 'when this promise will come, if you are truthful?",
    "verse_49": "They wait not but for a shriek that will seize them when they will be busy in worldly disputes.",
    "verse_50": "Then neither they will be able to make a will nor will they return to their homes.",
    "verse_51": "And the trumpet shall be blown, henceforth they will walk running towards their Lord from their graves.",
    "verse_52": "They will say, 'Ah, woe to us, who has awakened us from our sleeping? This is what the Most Affectionate had promised and the Messengers told the truth.'",
    "verse_53": "It will not be but a horrible shrieking, henceforth they all shall be presented before Us.",
    "verse_54": "So today no soul shall be wronged, and you shall not be recompensed but what you have done.",
    "verse_55": "Undoubtedly, the inmates of Heaven are enjoying in entertainments comfortably.",
    "verse_56": "They and their wives are in shades reclining on raised couches.",
    "verse_57": "There is fruits therein for them and there is for them whatever they ask for.",
    "verse_58": "Peace will be on them — a word from the Merciful Lord.",
    "verse_59": "And today, be separate, O you culprits!",
    "verse_60": "O children of Adam, Had I not made covenant with you that you should not worship the devil (saitan); verily he is your manifest enemy.",
    "verse_61": "And that you should worship Me. This is the straight path.",
    "verse_62": "And undoubtedly, he has led astray a great number of people from you. Had you then no wisdom?",
    "verse_63": "This is the Hell which you were promised.",
    "verse_64": "Enter it today, the recompense of your infidelity.",
    "verse_65": "Today, We shall set seal on their mouths and their hands will talk to Us and their feet will bear witness of their doings.",
    "verse_66": "And if We willed, We would have obliterated their eyes, then they would have rushed towards the path but they would see nothing.",
    "verse_67": "And if We willed, We would have mutilated their faces sitting in their homes, they could not be able to go on or could return.",
    "verse_68": "And to whosoever We give long life, We revert him in creation. Do they then not understand?",
    "verse_69": "And We have not taught him to compose verses and nor it is befitting to his dignity. It is not but admonition and luminous Quran.",
    "verse_70": "In order that it may warn him who is alive and the word may be proved against the infidels.",
    "verse_71": "And have they not seen that We have created for them Our handmade cattle, so they are their owners?",
    "verse_72": "And We have subjected the same for them that some of them they ride and some others they eat.",
    "verse_73": "And there are in them various other benefits and drinks for them. Will they not be thankful?",
    "verse_74": "And they have taken besides Allah other gods that perhaps they may be helped.",
    "verse_75": "They cannot help them, but they and their army all shall be brought before arrested.",
    "verse_76": "Therefore let not their speech grieve you. Undoubtedly We know what they conceal and what they disclose.",
    "verse_77": "And has the man not seen that We have made him from a sperm, henceforth he is an open disputant?",
    "verse_78": "And he says for Us a similitude and has forgotten his creation. He said, 'who will give life to the bones when they are totally rotten.'",
    "verse_79": "Say you, He will give life to them, Who made them the first time. And He knows every creation.",
    "verse_80": "Who produced fire for you out of the green tree, henceforth you kindle therefrom.",
    "verse_81": "And what! He who created the heavens and the earth cannot make the like of them. Why not, not, and He is the Great Creator, All-Knowing.",
    "verse_82": "For Him is this only that whenever He intends anything, then He says to it 'Be,' and it becomes at once.",
    "verse_83": "Therefore Sanctified is He in Whose hand is the control of everything, and towards Him you will be returned."
   },
    "count": 83
}
