{
    "name": "Thaha",
    "index": "020",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "TAHA.",
    "verse_2": "O beloved! We sent not this Quran upon you that you may be put to trouble.",
    "verse_3": "Yes, as an admonition to him who fears.",
    "verse_4": "A sent down by Him Who has made the earth and the high heavens.",
    "verse_5": "He, the Most Affectionate, established on the Throne (befitting to His Dignity).",
    "verse_6": "His is whatever is in heavens and whatever is in earth and whatever is in between and whatever is beneath the wet soil.",
    "verse_7": "And if you speak the word loudly, then He knows the secret and that which is more hidden than this.",
    "verse_8": "Allah — none to be worshipped but He. His are all good names.",
    "verse_9": "And has there come to you the story of Musa?",
    "verse_10": "When he saw a fire, then said to his wife, 'Stay, I have seen a fire, haply I may bring you a brand of fire or find a way at the fire.'",
    "verse_11": "Then when he came to the fire, a call was made, O Musa!",
    "verse_12": "Verily, I am your Lord, then take off your shoes, undoubtedly, you are in the sacred valley Tuwa.",
    "verse_13": "And I have chosen you, now listen carefully to what is revealed to you.",
    "verse_14": "Verily I am Allah there is none to be worshipped save Me. So worship Me and establish prayer for My remembrance.",
    "verse_15": "Undoubtedly, the Hour is to come. It was near that I should conceal it from all, that every soul may be recompensed for its endeavor.",
    "verse_16": "Then let no one who believes not in it and follows his own desire bar you from believing it lest you perish.",
    "verse_17": "And what is it in your right hand, O Musa?",
    "verse_18": "He submitted, ‘It is my staff, I lean on it, and with it beat down leaves for my goats and there are my other works in it.'",
    "verse_19": "Said He, 'Cast it down O Musa.'",
    "verse_20": "Then Musa cast it down and at that very time it became a serpent running.",
    "verse_21": "Said He, 'Pick it up and fear not, now We shall restore it to its former condition.",
    "verse_22": "'And make close your hand to your side, it shall come forth crystal white without any disease as one more sign.",
    "verse_23": "'That We may show you of Our greater signs.",
    "verse_24": "'Go to Firawn (Pharaoh), he has rebelled.\"",
    "verse_25": "He submitted, 'O my Lord open my breast for me.",
    "verse_26": "'And make my task easy for me.",
    "verse_27": "'And loose the knot of my tongue.",
    "verse_28": "'That they may understand my speech.",
    "verse_29": "'And make a minister for me from my family.",
    "verse_30": "(He) My brother Haroon.",
    "verse_31": "'Strengthen my loin by him.",
    "verse_32": "'And associate him in my task.",
    "verse_33": "'So that we may glorify You much.",
    "verse_34": "'And may remember You much.",
    "verse_35": "'Undoubtedly You are seeing us.'",
    "verse_36": "Said He, \"O Musa, you are granted your request.",
    "verse_37": "\"And indeed We favored you another time.",
    "verse_38": "\"When We inspired to your mother what was to be inspired.",
    "verse_39": "\"That putting this child into a box cast him into the river, then the river will cast him on to the bank. There he who is an enemy to Me and an enemy to him will pick him up and I cast on you the love from Me and so that you may be brought up before My sight.",
    "verse_40": "\"When your sister walked along, then she said, 'Shall I tell you such people who will nurse this child.' Then We turned you back to your mother that her eyes may be cooled and she may not be grieved. And you slew a soul, then We delivered you from sorrow and tested you well. Then you did stay in the people of Madian for many years, then you came at a fixed promise O Musa!",
    "verse_41": "\"And I made you particularly for Me.",
    "verse_42": "\"You and your brother both go, taking My signs and do not slacken in My remembrance.",
    "verse_43": "\"You both go to Firawn, undoubtedly he has rebelled.",
    "verse_44": "\"Then speak to him gentle words: haply he may be mindful or he may have some fear.\"",
    "verse_45": "They both submitted, 'O our Lord! 'Undoubtedly, we fear that he may commit excess against us or come before us with mischief.'",
    "verse_46": "Allah said, \"Fear not, I am with you Hearing and Seeing.",
    "verse_47": "\"Then go to him and say, 'We have been sent by your Lord, then send forth with us the children of Yaqub and torture them not. No doubt, we have brought you the sign from your Lord. And peace be to him who follows the guidance.",
    "verse_48": "'No doubt, we have been revealed that the torment is on him who belies and turns his face. \"",
    "verse_49": "Firawn said, 'Who is the Lord of you both, O Musa?'",
    "verse_50": "He said, 'Our Lord is He Who gave its proper form to everything, then guided.'",
    "verse_51": "Firawn said, 'What is the state of former generations?'",
    "verse_52": "He said, 'Their knowledge is with my Lord in a Book, my Lord neither errs nor forgets.",
    "verse_53": "'He Who made the earth for you as a bed and laid for you walking paths in it and sent down rain from the sky.' And thereby We brought forth varied pairs of vegetation.",
    "verse_54": "Eat you and pasture your cattle. No doubt in it there are signs for the men of wisdom.",
    "verse_55": "We created you from the earth, and into the same We shall bring you back and from the same We shall bring you forth the second time.",
    "verse_56": "And undoubtedly We showed him Our all signs, then he belied and refused.",
    "verse_57": "Firawn said, 'Have you come to us for driving us out from our land by your magic' O Musa?",
    "verse_58": "'Then necessarily, we too bring a like magic before you, so make an appointment between us and yourself, neither we change nor you, at an even place.'",
    "verse_59": "Musa said, 'Your promise is for the day of festival and that the people be assembled late after sunrise.'",
    "verse_60": "The Firawn turned back and collected all his plans, thereafter he came back.",
    "verse_61": "Musa said to them, ‘Woe be to you, forge not lie against Allah that He may destroy you by torment; and undoubtedly, he who forged lie remained unsuccessful.'",
    "verse_62": "Then they disputed their affairs among themselves and consulted secretly.",
    "verse_63": "They said, 'undoubtedly, these both are necessarily, magicians, they desire to drive you out from your land by the strength of their magic and take away your good religion.",
    "verse_64": "'Then make firm your stratagem, then come in ranks; and today he who overcame reached to his goal.'",
    "verse_65": "They said, 'O Musa! Either you cast or we cast first?'",
    "verse_66": "Musa said, 'may you cast, hence their ropes and staffs looked to him as though they were running by the strength of their magic.",
    "verse_67": "Then Musa got a fear within himself.",
    "verse_68": "We said, 'Fear not undoubtedly you have the dominance.",
    "verse_69": "'And cast down what is in your right hand, it will swallow their makings. That which they have made is the trick of the magician, and the magician does not prosper, anywhere he comes.'",
    "verse_70": "Then all the magicians were made to prostrate. They said, 'We believed in Him, Who is Lord of Musa and Haroon.'",
    "verse_71": "Firawn said, 'Did you believe in Him before I permitted you? Undoubtedly, he is your chief who taught you magic. Then I swear necessarily I will cut off your hands, and feet of alternate side and will crucify you upon the trunks of the palm-trees, and certainly you will know which of us is more severe and more lasting in punishment.'",
    "verse_72": "They said, 'We shall never prefer you against these clear evidences that came to us; by our Creator, do whatever you have to do. You will do in the life of this world only.",
    "verse_73": "Undoubtedly, we believed in our Lord that He may forgive our sins and also that to which you forced us on magic. And Allah is the Best and Most Lasting.",
    "verse_74": "No doubt, he who comes before his Lord as culprit, then necessarily for him is Hell, in which neither he shall die nor live.",
    "verse_75": "And he who comes to his Lord as a believer having done good deeds, for such are the high ranks.",
    "verse_76": "Gardens for habitation, beneath which streams flow, they will abide therein forever and this is the recompense of him who has purified himself.",
    "verse_77": "And no doubt, We revealed to Musa that walk away with My bondmen by night and make a dry way for them in the river. You will have no fear that Firawn may overtake nor any danger.",
    "verse_78": "Then Firawn followed them with his hosts, then the river covered them as to be covered.",
    "verse_79": "And Firawn misguided his people and showed not the way.",
    "verse_80": "O children of Israel! No doubt, We delivered you from your enemy and gave you the promise of the right side of Mount Tur and sent down on you Manna and Salwa.",
    "verse_81": "Eat what We provided you of pure things and exceed not therein that My anger may descend on you and he on whom My anger descends falls down.",
    "verse_82": "And undoubtedly, I am the Most Forgiving to him who repented and believed and did good deeds, then remained on guidance.",
    "verse_83": "And what has made you hasten from your people, O Musa?",
    "verse_84": "Submitted he, those are they behind me, and O my Lord! I hastened to You so that You may be pleased.'",
    "verse_85": "He said, 'We have put your people in trial after you and the Samiri has misled them.'",
    "verse_86": "Then Musa returned full of anger and sorrowful to his people, he said, 'O my people! Did your Lord not promise a fair promise to you? Did a long time pass on you or did you desire that the anger of your Lord should descend on you, so that you did against my promise.'",
    "verse_87": "They said, 'We did not break your promise of our own will but we were made to carry some load of these people's ornaments, so we cast them then likewise did the Samiri Cast.'",
    "verse_88": "Then he brought out for them a calf, a lifeless body lowing, then they said, 'This is your god and the god of Musa, and Musa forgot.'",
    "verse_89": "Do they then not see that it does not return reply to them of any word and nor possess any power to hurt or profit them?",
    "verse_90": "And undoubtedly, Haroon had already told them before, O my people! You have fallen in temptation on account of it, and undoubtedly your Lord is the Most Affectionate, therefore follow me and obey my command.'",
    "verse_91": "They said, 'We shall remain sitting firmly round it until Musa comes back to us.'",
    "verse_92": "Musa said, 'What prevented you when you did see them going astray.",
    "verse_93": "'That you would have followed me. Did you then not obey my command?'",
    "verse_94": "He said, \"O son of my mother, neither hold my beard not the hair of my head, I feared that you would say, 'you have caused dissention amongst the children of Israel and have not waited for my word.\"",
    "verse_95": "Musa said, 'Now what is your position, O Samira?'",
    "verse_96": "He said, 'I saw that the people did not see, so I took a handful of dust form the footstep of the angel, then cast it, and this looked fair to my soul.'",
    "verse_97": "Musa said, 'Then go away that your punishment in the life of this world is this, that you should say 'touch me not', and undoubtedly, there is an appointment for you which shall not be averted from you, and look at your god before which you remained sitting devoted for the whole day. Certainly We shall burn it, then by breaking it into pieces will cause to flow in the river.'",
    "verse_98": "'Your God is only Allah besides Whom none to be worshipped. His knowledge encompasses every-thing.'",
    "verse_99": "Thus We relate to you the preceding news and We have given you from Us a remembrance.",
    "verse_100": "One who turns his face from it, then undoubtedly he shall bear a burden on the Day of Judgement.",
    "verse_101": "They shall abide therein. And what a vile load it will be for them on the Day of Judgement.",
    "verse_102": "The day when the trumpet shall be blown and We shall raise the culprits, on that day, blue eyed.",
    "verse_103": "They will be whispering among themselves that, 'You did not stay in the world but ten nights.'",
    "verse_104": "We know well what they will say when the best of them in judgement will say, 'You had stayed only a day.'",
    "verse_105": "And they ask you regarding mountains, say you, My Lord will squander them breaking into pieces.",
    "verse_106": "Then leave it a level plain.",
    "verse_107": "Wherein you see not any slope or elevation.",
    "verse_108": "On that Day they will run behind the caller there will be no crookedness in him, and all voices will be low before the Most Affectionate, then you will not hear but a very low sound.",
    "verse_109": "On that Day the intercession of anyone will not avail but of him whom the Most Affectionate has permitted and whose word He liked.",
    "verse_110": "He knows whatever is before them and whatever is behind them, and their knowledge cannot encompass Him.",
    "verse_111": "And all faces shall be down cast before the Living, the Sustainer. And undoubtedly he who bore the burden of injustice remained unsuccessful.",
    "verse_112": "And he who does good works and be a Muslim, then neither he will be afraid of excessiveness nor of loss.",
    "verse_113": "And thus We have sent it down the Quran in Arabic and explained therein various ways of the torments that haply they may fear or it may generate in their hearts some thinking.",
    "verse_114": "Allah is, then, the Most High, the True King, and hasten not with Quran until its revelation is completed to you, and submit, 'O my Lord increase me in knowledge!'",
    "verse_115": "And undoubtedly, We had given an emphatic commandment to Adam before this, then he forgot and We did not find his intention.",
    "verse_116": "And when We said to angles, 'prostrate before Adam' then all prostrated but Iblis (the devil) he refused.",
    "verse_117": "Then We said, 'O Adam! undoubtedly, this is an enemy to you and your wife, so it may not happen that he may drive you both out of the Garden, then you are put to hard labor.",
    "verse_118": "'Undoubtedly, for you in the Garden is this that neither you be hungry nor go naked.",
    "verse_119": "'And that neither you thirst therein nor be exposed to sun.'",
    "verse_120": "Then the Satan gave evil suggestion to him, he said, 'O Adam! Shall I tell you the tree of eternity and a Kingdom that decays not?",
    "verse_121": "Then they both ate thereof, now their things of shame became apparent to them, and they began to stick the leaves of the Garden over themselves, and Adam slipped the commandment of his Lord, then what he had desired did not get the way to it.",
    "verse_122": "Thereafter his Lord chose him and turned to him with His mercy and showed him the way to his favored nearness.",
    "verse_123": "Allah said, 'Get down you both from the Heaven together, among you one is the enemy of the other, then if there comes a guidance to you all from Me; then whoso followed My guidance, shall neither go astray nor he be unfortunate.",
    "verse_124": "'And whoever turned his face from My remembrance, then un-doubtedly, for him there is straightened life, and We shall raise him blind on the Day of Resurrection.'",
    "verse_125": "He will say, 'O My Lord, why you have raised me blind while I possessed sight?'",
    "verse_126": "Allah will say, 'Thus Our signs had come to you, and you did forget them and in the like manner no one will take care of you.",
    "verse_127": "'And thus We do recompense him who crosses the limit and believes not in the signs of his Lord. And undoubtedly, the torment of the Hereafter is severest and most lasting.'",
    "verse_128": "Has then it not given guidance to them that how many a generation, We have destroyed before them, that in whose dwellings they walk? Undoubtedly therein are signs for men of wisdom.",
    "verse_129": "And had not a word of your Lord gone forth and a term determined then necessarily, the torment would have stuck to them.",
    "verse_130": "Then be patient over what they say, and praising your Lord proclaim His Holiness before the rising of the sun and before sunset, and proclaim His Holiness in the hours of the night and at the ends of the day, haply you may be pleased.",
    "verse_131": "And O listener! Stretch not your eyes towards that We have given to the pairs of infidels to enjoy the freshness of living world, that We may thereby try them. And the provision of your Lord is the best and most lasting.",
    "verse_132": "And bid your family for prayer, and be you steadfast over it. We ask not of you a sustenance. We shall provide you. And the good end is for those guarding against evil.",
    "verse_133": "And the infidels said, 'Why does he not bring us a sign from his Lord?' And has there not come to them the statement of what is in the former scriptures?",
    "verse_134": "And had We destroyed them of any torment before the coming of Messenger, then they would have necessarily said, 'O my Lord, why You sent not a Messenger to us that we might have followed Your signs before we were disgraced and humiliated.",
    "verse_135": "Say you, 'All are waiting, then you too wait, then now you will know that who are the men of straight path and who got guidance.'"
      },
    "count": 135
}
