{
    "name": "as-Syura",
    "index": "042",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
      "verse_1": "Ha — Mim.",
  "verse_2": "Ain — Seen — Qaf.",
  "verse_3": "Likewise reveals to you and to those before you, Allah the Honorable, the Wise.",
  "verse_4": "For Him is whatever is in the heavens and whatever is in the earth. And He is the Exalted, the Grand.",
  "verse_5": "It is well-nigh that the heavens may rend from above themselves and the angels sanctify their Lord with His praise and beg forgiveness for the people of earth. Hearken! Only Allah, He is the Forgiver, the Merciful.",
  "verse_6": "And those who have taken others as patrons besides Allah, they are under the sight of Allah and you are not responsible for them.",
  "verse_7": "And likewise We revealed to you a Quran in Arabic so that you may warn thereby the mother of all towns the Meccans and those who live around it and you may warn them of a Day of Assembly wherein there is no doubt. A party is in the paradise and a party is in the Hell.",
  "verse_8": "And had Allah willed He would have made them a people of one faith, but Allah admits into His mercy whomsoever He pleases. And as for the unjust, they have neither any friend nor any helper.",
  "verse_9": "Have they taken others as patrons besides Allah? But it is Allah, He is the Patron and He will give life to the dead and He can do everything.",
  "verse_10": "In whatever you differ, the decision thereof is with Allah. This is Allah, my Lord, in Him I put my trust and I turn towards Him.",
  "verse_11": "The Maker of the heavens and the earth. He has made for you pairs of your own selves and male and female cattle, whereby He spreads your race. Nothing is like Him, and He is the All-hearing, All-seeing.",
  "verse_12": "For Him are the keys of the Heavens and the earth. He expands the provision for whomsoever He pleases and straitens too. Undoubtedly, He knows everything.",
  "verse_13": "He has directed you to the religion which He enjoined upon Nuh and that which We revealed to you and that which We enjoined upon Ibrahim, Musa and Isa saying, \"set the religion right and cause not dissension therein. Very hard upon the polytheists is that to which you call them. And Allah chooses for His nearness whomsoever He pleases and guides to Himself him who turns towards Him.",
  "verse_14": "And they caused not dissension but after the knowledge had come to them on account of mutual jealousy. And had not a saying of your Lord gone forth for an appointed term, the matter would have been surely decided among them long ago. And undoubtedly, those who have inherited the Book after them are in a deceitful doubt regarding it.",
  "verse_15": "For this then, call you and remain steadfast as you have been commanded and follow not their desires and say, \"I believed in whatever Book Allah has sent down and I have been commanded that I may do justice between you. Allah is our Lord and the Lord of you all. For us are our deeds and for you are your deeds. There is no argument between us and you. Allah will gather us together, and towards Him is the return.",
  "verse_16": "And those who dispute concerning Allah after that the Muslims have already accepted His Call, their argument is purely unstable in the sight of Allah and upon them is the wrath and for them is the severe torment.",
  "verse_17": "Allah is Who has sent down the Book with the truth and the balance of justice. And what shall make you know that perhaps the Hour may be near.",
  "verse_18": "Those who believe not therein seek to hasten it, and those who believe therein are fearing of it and know that undoubtedly, it is the truth, Beware! Verily, those who are in doubt concerning the Hour are indeed in a far-off error.",
  "verse_19": "Allah is Gentle towards His bond-men. He provides for whomsoever He pleases, and He is the Powerful. Honorable.",
  "verse_20": "Whosoever desires tillage of the Hereafter. We give an increase in his tillage, and whosoever desires the tillage of the world, We shall give him some-what thereof and in the Hereafter he shall have no share.",
  "verse_21": "Or for them there are some associates who have made for them a religion that for which Allah has given no leave. And had there not been the promise of a decision, it would have been decided between them here. And undoubtedly, for the unjust people is a painful torment.",
  "verse_22": "You shall see the wrong doers fearful on account of their earnings and it is sure to befall them. And those who believed and did good deeds are in the meadows of the Paradise. They shall have with their Lord whatever they will desire. This is the great grace.",
  "verse_23": "This is that of which Allah gives the glad tidings to His bondmen who believed and did good deeds. Say you, \"I ask not of you any wage for it but affection in respect of kinship.\" And whoever does a good deed, We shall increase to him good in respect thereof. Undoubtedly, Allah is Forgiving, Appreciating.",
  "verse_24": "Or they say, \"He has forged a lie against Allah.\" But if Allah wills, He may set a seal of His Mercy and safety upon your heart. And Allah wipes out the falsehood and establishes the truth with His Words. Undoubtedly, He knows what is inside the breasts.",
  "verse_25": "And it is He Who accepts the repentance from His bondmen and overlooks the faults and He knows what you do.",
  "verse_26": "And He responds to those who have believed and have done good deeds and gives them more reward out of His grace. And for the infidels there is a severe torment.",
  "verse_27": "And had Allah expanded the provision of all His bondmen, they would have necessarily then spread mischief in the earth, but He sends down according to a measure as He pleases, undoubtedly, He is Aware of His bondmen, Sees them.",
  "verse_28": "And it is He Who sends down rain after they have despaired, and spreads out His mercy. And He is the Protector, Praiseworthy.",
  "verse_29": "And of His signs is the creation of the heavens and the earth and of whatever moving creatures He has spread forth in them. And He has the power to gather them together when He pleases.",
  "verse_30": "And whatever affliction reached you, is due to what your hands have earned; and He pardons much.",
  "verse_31": "And you cannot go out of His control in the earth, and you have against Allah, neither a friend nor a helper.",
  "verse_32": "And of His signs are vessels running in the sea like hills.",
  "verse_33": "If He pleases, He can cause the wind to become still, so that they stand still on its back. Undoubtedly, therein are signs for everyone most patient and grateful.",
  "verse_34": "Or He may destroy them on account of the sins of the people and may pardon much of their sins.",
  "verse_35": "And those who dispute in Our Sings should know that for them there is no place of escape.",
  "verse_36": "And whatever you have been given is only a temporary provision of this living world, and that which is with Allah is better and more lasting for those who have believed and trust their Lord.",
  "verse_37": "And those who avoid heinous sins and indecencies, and when they are angry, they forgive.",
  "verse_38": "And those who obeyed the command of their Lord and established prayer and their affairs are decided by mutual consultation and they spend something out of Our provision in Our way.",
  "verse_39": "And those who, when insolence reaches them, take revenge.",
  "verse_40": "And the recompense of evil is evil the like of it, but whoso forgives and puts the things right, then his reward is with Allah. Undoubtedly, He loves not the unjust.",
  "verse_41": "And undoubtedly, whoso took revenge after being victim of oppression, there is no way of blame against them.",
  "verse_42": "The blame is only against them who oppress mankind and rebel in the earth without right. For them is the painful torment.",
  "verse_43": "But whoever indeed preserved and forgave, most certainly, then these are the affairs of determination.",
  "verse_44": "And whomsoever Allah leads astray he has no friend against Allah. And you will see the oppressors when they will see the torment saying, 'Is there any way to return?'",
  "verse_45": "And you will see them that they are presented before Fire dejected on account of disgrace, they see with veiled eyes. And the believers will say, 'Undoubtedly, the losers are those who have lost their souls and their families on the Day of Resurrection.' Beware! No doubt, the unjust are in lasting torment.",
  "verse_46": "And they have no friends to help them against Allah and whomsoever Allah leads astray, there is no way for him.",
  "verse_47": "Obey the commands of your Lord before the coming of the Day that is not to be turned back from Allah. You will have no refuge that day nor can you dare to deny.",
  "verse_48": "But if they turn their faces, then We have not sent you as a guardian over them. There is nothing on you but to convey the (the Message). And when We give man the taste of any mercy from Us, he becomes happy over it. But if any evil befalls them because of what their hands have sent forth, then the man is most ungrateful.",
  "verse_49": "For Allah is the Kingdom of the heavens and the earth, He creates whatever He likes. He bestows daughters on whomsoever He likes and He bestows sons on whomsoever He likes.",
  "verse_50": "Or He mixes both the sons and the daughters, and He makes whomsoever He likes barren. Undoubtedly, He is Knowing, Authoritative.",
  "verse_51": "And it is not fit for any man that Allah should speak to him but through revelation, or that the man may be at the other side of the veil of grandeur. Or He may send any angel that he may reveal by His command what He pleases. Undoubtedly, He is High. Wise.",
  "verse_52": "And likewise We have revealed to you an invigorative thing by Our command. You did not know the Book before it nor the details of the laws of religion, yes, We made it a light whereby We guide such of Our bondmen as We please. And undoubtedly, you most certainly guide to the straight path.",
  "verse_53": "The path of Allah, to Whom belongs whatever is in the heavens and whatever is in the earth. Do you listen? All affairs return to Allah only."},
    "count": 53
}
