{
    "name": "Ibrahim",
    "index": "014",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif-Lam, Ra. This is a Book that We have sent down to you so that you may bring the people from darkness to light by the command of their Lord towards the path of the Honorable, the Praiseworthy.",
    "verse_2": "Allah, to Whom belongs whatsoever is in the heavens and whatsoever is in the earth. And there is misery for the infidels a severe torment.",
    "verse_3": "Those who love the worldly life more than the life of Hereafter and bar from the path of Allah and desire crookedness therein, they are in a far off error.",
    "verse_4": "And, We have sent each Messenger in the language of his own people that tie may tell them clearly. Then Allah leads astray whomsoever He will and guides whomsoever He will, and He is the Honorable, the Wise.",
    "verse_5": "And, We did send Musa with Our signs, that 'bring your people from the darkness into the light and remind them of the days of Allah. No doubt, in it there are signs for each steadfast, thankful.",
    "verse_6": "And when Musa said to his people, 'remember Allah's favor upon you, when He delivered you from Firawn's people who used to afflict you worse, and slaughter your sons and let your daughters live, and in it there was shown great mercy of your Lord.'",
    "verse_7": "And remember, when your Lord proclaimed, 'If you will be grateful, then I shall give you more, and if you are thankless, then My torment is sever.'",
    "verse_8": "Musa said, 'if you and all others in the earth become disbelievers, then verily Allah is Self Sufficient, Praiseworthily.'",
    "verse_9": "Have you not received the tidings of those who were before you, the people of Nuh and Aad, and the Thamud and those after them? They are known to Allah alone. There came to them their Messengers with bright proofs, but they turned their hands to their mouths and said, 'we deny that with which you have been sent, and the path towards which you call us, concerning that we are in a doubt creating suspense.'",
    "verse_10": "Their Messengers said, 'Is there any doubt in Allah, the Maker of the heavens and earth? He calls you that He may forgive some of your sins and may fulfil your life till the stated time of your death without punishment.' They said, 'You are human being like us. You desire to bar us from that our fathers used to worship; so bring us a clear authority.'",
    "verse_11": "Their Messengers said to them, 'We are indeed human beings like yourselves, but Allah bestows His favour on whomsoever He will of His bond-men. And it is not for us to bring you any authority but by the command of Allah. And upon Allah alone the Muslims should rely.",
    "verse_12": "'And what happened to us that we should not rely upon Allah, He has showed us our ways. And we shall surely bear patiently that with which you are annoying us. And let the trustful put their trust in Allah alone.'",
    "verse_13": "And the infidels said to their Messengers, 'We shall surely turn you out of our lands, or you become our co-religionist.' Then their Lord revealed to them, 'We shall surely destroy the unjust.'",
    "verse_14": "And We shall surely make you settle in the land after them. This is for him who fears standing before Me, and be afraid of the torment I have commanded.",
    "verse_15": "And they asked for a decision, and every tyrant obstinate was disappointed.",
    "verse_16": "The Hell ran after him and he shall be made to drink the water of oozing pus.",
    "verse_17": "He will take its draught little by little with difficulty and there shall be no hope to swallow it, and death shall come to him from all sides, but he shall not die. And there is a terrible torment after him.",
    "verse_18": "The condition of the rejecters of their lord is such that their deeds are like ashes upon which a strong blast of wind came in a day of storm. They got nothing out of entire earning. This is the far-off error.",
    "verse_19": "Did you not see that Allah has made the heavens and earth with the truth? If He please He can take you away and bring forth a new creation.",
    "verse_20": "And this is not at all hard for Allah.",
    "verse_21": "They all shall appear before Allah, then those who were weak will say to those proud, 'we were under you, can it be possible for you to put off some of the torment of Allah from us? 'They will say, 'if Allah had guided us, we would have guided you. It is alike to us whether we show impatience or remain patient, nowhere is asylum for us.'",
    "verse_22": "And Satan when the matter would have been decided will say, 'verily Allah had given you a true promise, and whatever I promised you I made it false to you, and I had no authority over you, but that I called you, then you responded to me, now then put no blame upon me, put the blame upon yourselves. Neither I could help you nor could you help me. I am strongly disgusted with that you associated me with Allah before. No doubt, there is painful torment for the unjust.",
    "verse_23": "And those who believed and did good deeds shall be made to enter gardens, beneath which Flow Rivers abiding therein with the command of their Lord. Their greetings at the time of their meeting is 'peace'.",
    "verse_24": "Did you not see that how Allah has explained the example of the holy word like a clean tree whose root is firmly standing and branches are in the heaven.",
    "verse_25": "It gives its fruit at all times by the command of its Lord and Allah propounds examples for the people that they may understand.",
    "verse_26": "And the example of evil word is like an evil tree uprooted from the earth, now it has no stability.",
    "verse_27": "Allah keeps firm the believers on right word in the life of the world and the Hereafter, and Allah leads astray the wrongdoers, and Allah does what He pleases.",
    "verse_28": "Did you not see those who changed the favor of Allah with un thankfulness and have brought their people into the abode of ruin.",
    "verse_29": "That which is Hell, they shall enter in it, what an evil place to stay!",
    "verse_30": "And they have set up equals for Allah that they might lead astray from His path. Say you, 'enjoy a little, verily your end is the Fire.'",
    "verse_31": "Say to My those bondmen who believed that they should keep up prayer and out of what We have given them spend (in our way) secretly and openly before the coming of that day in which there shall be neither trading nor friendship.",
    "verse_32": "Allah is He Who made the heavens and earth and caused water to come down from the heaven, then He produced some fruits therewith for your food, and He made the ships subservient to you that they may sail through the sea by His command and made the rivers subservient to you.",
    "verse_33": "And He made the sun and moon subservient for you which are constantly moving, and made the night and day subservient for you.",
    "verse_34": "And He gave you many things you asked for. And if you count the favors of Allah, you cannot count. No doubt, man is very unjust, unthankful.",
    "verse_35": "And recall when Ibrahim submitted, 'O my Lord! Make this city secure, and save me and my sons from worshipping the idols.",
    "verse_36": "'O my Lord, verily the idols have led astray many people, then who sided with me is mine and who disobeyed me, then you are certainly Forgiving, Merciful.",
    "verse_37": "'O my Lord, I have caused some of my children to settle in a valley wherein there is no cultivation by your Sacred House, O our Lord, in order that they might keep up prayer, then You make some people's hearts incline toward them and give them some fruits for food, haply they may be thankful.",
    "verse_38": "'O our Lord, you know what we conceal and what we disclose. And nothing is concealed from Allah in the earth or in the heaven.",
    "verse_39": "'All praise to Allah, Who has given me Ismail and Ishaque in old age. Verily my Lord is the Hearer of prayer.",
    "verse_40": "'O my Lord, keep me as establisher of prayer and some of my children too, O our Lord, and accept my prayer.",
    "verse_41": "'O our Lord, forgive me, and my parents and all Muslims on the Day when reckoning shall take place.'",
    "verse_42": "And never consider Allah unaware of the deeds of the unjust. He is not letting them loose but to a day in which their eyes shall remain staring.",
    "verse_43": "They will come out running rashly raising their heads high, that their eyelash does not turn back towards them, and there will be no strength in their hearts.",
    "verse_44": "And warn mankind of the day when the torment shall come to them, then the unjust shall say, 'O our Lord, grant us respite for a short term that we may respond to your call and follow the Messengers.' Did you not swear before that you are not to go anywhere moving? From the world?",
    "verse_45": "And you settled down in the dwellings of those who did evil to themselves and it was clear to you how We did with them and We explained to you giving examples.",
    "verse_46": "And verily they devise their plan and their plan is under the control of Allah and their planning was not such as to remove these mountains.",
    "verse_47": "Therefore never consider that Allah will go against His promise to His Messengers. No doubt, Allah is Dominant, the Lord of retribution.",
    "verse_48": "The day when the earth shall be changed other than this earth and the heavens too, and all shall come out standing before Allah, the One, Who is Dominant over all.",
    "verse_49": "And you will see the guilty on that Day bound together in chains.",
    "verse_50": "Their shirts shall be of pitch and the fire shall cover their faces.",
    "verse_51": "In order that Allah may reward every soul according to it’s earning. No doubt, Allah is not late in reckoning.",
    "verse_52": "This is to deliver the commands to mankind and that they may be warned therewith and that they may know that He is only One God and that the men of wisdom may accept admonition."
  },
    "count": 52
}
