{
    "name": "ath-Thalaq",
    "index": "065",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O Prophet! When you people divorce your women, then divorce them at the time of their prescribed periods and count the prescribed period, and fear Allah, your Lord. Turn then not out of their houses during prescribed period, nor should they themselves go out, unless they are involved in any flagrant indecency: These are the limits of Allah, and Whoso crossed the limits of Allah, undoubtedly, he did injustice to his own soul. You know not that perhaps Allah may send any new commandment after it.",
        "verse_2": "Then, when they are about to reach their term, retain them with kindness or part from them with kindness and take two just persons as witnesses from among you and set up witness for Allah. By this, he who believes in Allah and Last Day is admonished. And he who fears Allah, Allah will make a way for his deliverance.",
        "verse_3": "And will provide for him whence he expects not. And he who puts his trust in Allah - He is Sufficient for him. Verily, Allah is to fulfil His work. Undoubtedly, Allah has kept a measure for everything.",
        "verse_4": "And as to your women who have no hope of menstruation; if you are in doubt, then their prescribed period is three months, and for those who have not yet menstruated. And the period of the pregnant women is when they give birth to children. And whoso fears Allah, Allah will make his work easy.",
        "verse_5": "This is the commandment of Allah that He has sent down towards you. And whoso fears Allah, Allah will put off his evils and will give him immense reward.",
        "verse_6": "Make the women dwell where you yourselves dwell according to your means, and do not harm them so as to straighten them. And if they are pregnant, then give them their maintenance till they give birth to children, And if they suckle children for you, give them their wages and consult together reasonably. But if you mutually disagree then soon he (father) will get another woman for suckling.",
        "verse_7": "Let the man of means provide according to his means. And as for him upon whom his provision has been straitened, let him give the maintenance of what Allah has given him. Allah burdens no soul but to the extent of what He has given him. It is near that Allah will bring about ease after hardship.",
        "verse_8": "And how many a city rebelled against the Commandments of its Lord and His Messengers, then We took a severe account from it and gave it a horrible punishment.",
        "verse_9": "Therefore it tasted the mischief of its actions, and the end of its affair was loss.",
        "verse_10": "Allah has already prepared for them a severe torment; therefore fear Allah, O men of understanding! Those who have believed. Undoubtedly, Allah has sent down for you an honor.",
        "verse_11": "The Messenger who recites unto you the bright signs of Allah, so that he may bring forth those who believe and do good deeds from the darkness into light. And whoso believes in Allah and does good deeds - He will make him enter gardens beneath which streams flow, to abide therein forever. Undoubtedly, Allah has made good provision for him.",
        "verse_12": "Allah is, it is He, Who made seven heavens, and of the earth their like; the commandment comes down in their midst, so that you may know that Allah can do everything, and the knowledge of Allah encompasses everything."
  },
    "count": 12
}
