{
    "name": "al-Anbiya",
    "index": "021",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "The accountability of the people is near and they have turned their faces in heedlessness.",
    "verse_2": "Whenever any admonition comes to them from their Lord, they hear it not but sporting.",
    "verse_3": "Their hearts have fallen in sport. And the unjust counselled among themselves secretly, 'who is this, he is only a man like you. Do you go to magic while you see?'",
    "verse_4": "The Prophet said, 'My Lord knows every word in the heavens and earth, and He is the Hearer, the Knower.'",
    "verse_5": "On the contrary, they said, 'these are the perturbed dreams- rather it is his own fabrication, nay, he is a poet. Then let him bring any sign to us as the former were sent with.'",
    "verse_6": "No town which We destroyed believed before them; will they then believe?",
    "verse_7": "And We sent not before you but men whom We revealed, then O people! ask the men of knowledge if you have no knowledge.",
    "verse_8": "And We made them not mere bodies that they may not eat food and nor live in the world forever.",
    "verse_9": "Then We made good Our promise to them, so We delivered them and those whom We pleased and destroyed the extravagant.",
    "verse_10": "Undoubtedly, We sent down towards you a Book in which there is glory for you. Have you then no wisdom?",
    "verse_11": "And how many towns that were oppressing, We utterly destroyed and raised up another people after them.",
    "verse_12": "Then when they got Our torment, therefore they began to flee from it.",
    "verse_13": "Flee not, and return to those comforts which were given to you and to your homes, haply you are to be questioned.",
    "verse_14": "They said, Ah! Woe to us! No doubt, we were unjust.'",
    "verse_15": "Then they remained crying so, till We made them cut off, extinguished.",
    "verse_16": "And We made not the heavens and the earth and whatever is between the two in vain.",
    "verse_17": "If We had wished to take any amusement, then We would have taken from Ourselves; if at all We were to do.",
    "verse_18": "Rather We hurl the truth at falsehood, then it takes out its brain, therefore it vanishes. And Woe is to you for those utterances which you fabricate.",
    "verse_19": "And to Him belongs whosoever is in the heavens and the earth. And those near Him do not wax proud to worship Him, and nor are they tired.",
    "verse_20": "They glorify Him night and day and intermit not.",
    "verse_21": "Have they made some such gods from the earth who create something?",
    "verse_22": "If there had been gods besides Allah in the heavens and earth, then necessarily, they would have gone ruined. Therefore Glory is to Allah, the Lord of the Throne, from the utterances which they fabricate.",
    "verse_23": "He is not questioned as to what He does, while they all shall be questioned.",
    "verse_24": "Have they taken other gods besides Allah? Say you, 'Bring forth your proof. This Quran is the mention of those with me and the narration of those before me.' Rather most of them know not the truth, therefore they turn aside.",
    "verse_25": "And We sent not any Messenger before you but We revealed to him that there is no God but I; therefore worship Me alone.",
    "verse_26": "And they said, 'The Most Affectionate has taken for Himself a son.' Holy is He. Nay they are bond-men honored.",
    "verse_27": "They precede Him not in word, and they act only by His command.",
    "verse_28": "He knows whatever is before them and whatever is behind them, and they intercede not but for him whom He is Pleased with, and they are fearing of His awe.",
    "verse_29": "And whosoever of them says, 'I am a god besides Allah', then We shall recompense him with Hell. Thus We recompense the oppressors.",
    "verse_30": "Did the infidels not consider that the heavens and earth were closed up, then We opened them out? And We made every living thing from water. Will they then not believe?",
    "verse_31": "And We put anchors in the earth lest it should move away with them, and We made therein wide pathways that haply they may be guided.",
    "verse_32": "And We made the heaven a roof well protected; and they are averters from its signs.",
    "verse_33": "And it is He Who created the night and the day and the sun and the moon. Each one is floating in a circumference.",
    "verse_34": "And We made not before you for any man to live forever in the world. Will they then if you pass away live forever?",
    "verse_35": "Every soul is to taste death. And We prove you by evil and good for trial. And to Us you are to return.",
    "verse_36": "And when the infidels see you, they take not you, but with mockery. Is this he who speaks evil of your gods? While they are themselves the rejecters of the very remembrance of the Most Affectionate.",
    "verse_37": "Man is made hasty; now and I will show you My signs, be not hasty to Me.",
    "verse_38": "And they say, 'When this promise will be (fulfilled) if you are truthful?'",
    "verse_39": "Any how the infidels knew the time when they will not be able to keep off fire from their mouths not from their backs, neither shall they be helped.",
    "verse_40": "Rather it will come to them all of a sudden, then it will confound them, and they will not be able to avert it and nor they will be given respite.",
    "verse_41": "And undoubtedly, the Messengers before you were mocked, then the mockery of the scoffers took themselves in its fold.",
    "verse_42": "Say you, 'Who keeps watch upon you from (the wrath of) the Most Affectionate by night and by day?' Yet they have turned their faces from the remembrance of their Lord.",
    "verse_43": "Have they some gods who protect them besides Us? They cannot protect their own souls, and nor against Us they may have company with.",
    "verse_44": "Nay, We allowed them and their fathers to carry on, until the life grew long upon them. Do they then not observe that We are coming gradually reducing the land from its outlying borders? Will they then overcome?",
    "verse_45": "Say you, ‘I only warn you by the Revelation; and the deaf do not hear the call when they are warned.'",
    "verse_46": "And if a breath of the torment of your Lord touch them, then necessarily, they will say, 'Oh! Alas for us, undoubtedly, we were unjust.'",
    "verse_47": "And We shall set up the balances of justice for the Day of Judgement, then no soul shall be wronged anything. And if there be anything, even equal to a grain of mustard seed, then We shall bring it; and We are Sufficient to take account.",
    "verse_48": "And undoubtedly, We gave Musa and Haroon Judgement and the light and admonition for those who fear God.",
    "verse_49": "Those who fear their Lord, unseen, and who are dreadful of the Hour.",
    "verse_50": "And it is this the blessed admonition that We have sent down. Are you then deniers of it?",
    "verse_51": "And undoubtedly, We bestowed over Ibrahim his righteous path from before, and We knew him.",
    "verse_52": "When he said to his father and his people, 'What are these images before which you are sitting firmly' (for worship).",
    "verse_53": "They said, 'We found our fathers worshipping them.'",
    "verse_54": "He said, 'Undoubtedly, you and your fathers are all in manifest error.'",
    "verse_55": "They said, 'Have you brought truth to us, or you are making a play unintentionally?'",
    "verse_56": "He said, 'Nay, your Lord is He Who is the Lord of the heavens and the earth, Who created them, and I am of the witnesses to that.",
    "verse_57": "'And I swear by Allah, I shall devise bad against your idols after you have turned your backs.'",
    "verse_58": "Then he broke them into pieces but the big one of them, that haply they may ask to it something.",
    "verse_59": "They said, 'Who has done this to our gods? Undoubtedly, he is unjust.'",
    "verse_60": "Some of them said, 'We have heard a youth called Ibrahim saying bad to them.'",
    "verse_61": "They said, 'Then bring him before the people, haply they may bear witness.'",
    "verse_62": "They said, 'Have you done this to our gods, O Ibrahim?'",
    "verse_63": "He said, ‘Rather this big one of them would have done this, so ask them, if they can speak.'",
    "verse_64": "They turned to themselves and said, 'Undoubtedly you yourselves are the unjust.'",
    "verse_65": "Then they were lied downward on their heads, that you know well that these do not speak.",
    "verse_66": "He said, 'Do you then worship besides Allah that which neither profits you and nor hurts you.",
    "verse_67": "'Fie on you and on those deities which you worship besides Allah, do you then have no wisdom?'",
    "verse_68": "They said, 'Burn him and help your gods, if you have to do.'",
    "verse_69": "We said, 'O Fire! Be you cool and safety for Ibrahim.'",
    "verse_70": "And they desired evil for him, but We made them the worst losers.",
    "verse_71": "And We delivered him and Lut, towards the land in which We had placed the blessings for the worlds.",
    "verse_72": "And We bestowed him Ishaque and as grandson Yaqoob, and We made all of them able for Our special favor.",
    "verse_73": "And We made them leaders who call by Our command and We revealed to them the doing of good deeds and establishing prayer and the paying of Zakat (Poor-due) and they constantly served Us.",
    "verse_74": "And to Lut We gave government and knowledge and delivered him from that town which had been working foul deeds; undoubtedly those evil people were disobedient.",
    "verse_75": "And We caused him to enter Our Mercy. Undoubtedly he is of those able for Our special favor.",
    "verse_76": "And to Nuh when he called Us before this, then We listened to his prayer and delivered him and his family from severe torture.",
    "verse_77": "And We helped him against a people who belied Our signs. Undoubtedly, they were evil people, so We drowned them all.",
    "verse_78": "And remember Daud and Suleman when they gave decision regarding a feud of tillage when the sheep of certain people strayed therein by night, and We were Present at the time of their judgement.",
    "verse_79": "We made Suleman understand the matter and bestowed to both of them government and knowledge and We made the mountains subservient to celebrate Our praises with Daud and so the birds. And these were Our doings.",
    "verse_80": "And We taught him the making of garments for you so that it may protect you against your violence; will you then be grateful?",
    "verse_81": "And to Suleman We made subservient the violent wind that it blew at his bidding to the land in which We had placed Our blessings; and We are in the know of everything.",
    "verse_82": "And of the devils those who dived for him and did other work besides that and We had a check over them.",
    "verse_83": "And remember Ayyoob when he called his Lord that 'Distress has touched me and You are the Most Merciful of the merciful.'",
    "verse_84": "Then We responded to him and We removed the distress which he had and We gave him his family and along with them the like thereof as a mercy from Us and as an admonition to the devotees.",
    "verse_85": "And (remember) Ismail and Idrees and Zulkifl. They were all men of patience.",
    "verse_86": "And We got them enter into Our Mercy. Undoubtedly, they are of the righteous ones.",
    "verse_87": "And (remember) Zunnoon when he departed in anger, then he imagined that We would not cause him any distress and then he cried out in the darkness, There is none to be worshipped but You, Glory is to You, undoubtedly, I did improper act.'",
    "verse_88": "Then We responded to his call and delivered him from the grief and We shall likewise deliver the Muslims.",
    "verse_89": "And to Zakaria when he called his Lord, 'O my Lord! Leave not me alone and You are the best Inheritor.'",
    "verse_90": "Then We responded to his call and bestowed him Yahya and cured his wife for him. Undoubtedly, they used to hurry in good deeds and used to call Us with hope and fear. And they humble themselves before Us.",
    "verse_91": "And as to she who guarded her chastity, then We breathed into her of Our spirit and made her and her son a sign for the entire world.",
    "verse_92": "Undoubtedly, this religion (Din) of yours is a single religion (Din), and I am your Lord, so worship Me.",
    "verse_93": "And others split up their affairs among themselves. All are to return to Us.",
    "verse_94": "Then whosoever works righteous deeds and be a believer, then his efforts are not disregarded and We are recording it.",
    "verse_95": "And it is forbidden to a town which We have destroyed that they return.",
    "verse_96": "Until when Yajuj and Majuj would be let loose and they will be coming down from every height.",
    "verse_97": "And the true promise drew near, then the eyes of the infidels will remain staring (saying that) 'Woe to us, undoubtedly, we were heedless of this, rather we were unjust.'",
    "verse_98": "Undoubtedly, you and whatever you worship besides Allah, all are the fuel of the Hell; you have to enter therein.",
    "verse_99": "If these had been gods, they would not have gone to Hell; and all shall abide therein.",
    "verse_100": "They will groan therein and they will hear nothing in it.",
    "verse_101": "Undoubtedly, those for whom Our promise of good has already gone forth, they have been kept away from the Hell.",
    "verse_102": "They will not hear the faintest sound of it and they will abide in that which their soul’s desire.",
    "verse_103": "The Great Terror shall not grieve them and the angels will come to greet them (saying) that this is your Day which you were promised.",
    "verse_104": "The Day when We shall roll up the heaven as the angel Sijil rolls up the record of deeds. As We made it first, We shall restore it. This is a promise on Us; We shall necessarily do it.",
    "verse_105": "And undoubtedly, We wrote in Zaboor (Scripture) after the admonition that My righteous bondmen will inherit this land.",
    "verse_106": "Undoubtedly, this Quran is sufficient for the worshipers.",
    "verse_107": "And We sent not you, but a mercy for all worlds.",
    "verse_108": "Say you, ‘I am revealed only this that you have no God but One Allah; do you then become Muslim?'",
    "verse_109": "But if they turn away their faces, then say, 'I have proclaimed war against you on equal basis, and I know not whether that which you are promised is near or far.",
    "verse_110": "'Undoubtedly, Allah knows about aloud talks and knows whatever you conceal.",
    "verse_111": "'And I know not, haply it may be a trial for you and the provision for a fixed time.'",
    "verse_112": "The Prophet submitted, 'O my Lord! Decide with truth. And the assistance of our Lord the Most Affectionate is needed against what you utter.'"
   },
    "count": 112
}
