{
    "name": "ar-Rum",
    "index": "030",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif Lam Mim.",
        "verse_2": "The Romans have been subdued.",
        "verse_3": "In the nearby land and after their subjugation they will soon overcome.",
        "verse_4": "In a few years. The command is of Allah only before and after. And on that day the believers shall rejoice.",
        "verse_5": "With the help of Allah. He helps who He pleases. And He is the Mighty, the Merciful.",
        "verse_6": "This is the promise of Allah; Allah breaks not His promise, but most of the people know not.",
        "verse_7": "They know only the outer appearance of the worldly life, and they are fully unaware of the Hereafter.",
        "verse_8": "Have they not pondered within themselves? Allah has not created the heavens and the earth and whatever is between them but with truth and for an appointed term. And undoubtedly, most of the people are deniers of the meeting with their Lord.",
        "verse_9": "And have they not travelled in the land so that they might see how was the end of those before them? They were more powerful than these, and they tilled the soil and populated it more than their population. And their Messengers brought them bright signs. Then it was not befitting to the dignity of Allah that He would oppress them, yes! They used to oppress themselves.",
        "verse_10": "Then the end of those who committed evil to their limit was this that they began to belie the signs of Allah and to mock at them.",
        "verse_11": "Allah creates for the first time then He shall make for the second time, then you shall be returned to Him.",
        "verse_12": "And the day when the Hour shall be established, the culprits shall despair.",
        "verse_13": "And their associates shall not be their intercessors and they will deny their associates.",
        "verse_14": "And the day when the Hour shall be established, the day they will be separated.",
        "verse_15": "Then those who believed and did good deeds, they shall be entertained in the flower bed of the garden.",
        "verse_16": "And those who became infidels and belied Our signs and the meeting of the Hereafter, they shall be brought into the torment.",
        "verse_17": "Therefore glorify Allah when you enter the evening and when you enter the morning.",
        "verse_18": "And His is praise in the heavens and in the earth, and at little before sun's setting and when you enter the noon.",
        "verse_19": "He brings forth the living from the dead and brings forth the dead from the living, and gives life to the earth after its death. And in like manner you shall be brought forth.",
        "verse_20": "And of His signs is this that He created you from dust, then henceforth you are human beings scattered in the world.",
        "verse_21": "And of His signs is that He created for you from among yourselves mates that you may find repose in them and He put love and mercy between you. No doubt, in it are signs for a people who ponder.",
        "verse_22": "And of His signs is the creation of heavens and earth, and the diversity of your tongues and colors. No doubt, in it are signs for those who possess knowledge.",
        "verse_23": "And of His signs is your sleeping by night and day and your seeking of His bounty. No doubt, in it are signs for those who hear.",
        "verse_24": "And of His signs is that He shows you lightening frightening you and making you hopeful and sends down water from the heaven and gives life therewith the earth after its death. No doubt, in it are signs for a people of understanding.",
        "verse_25": "And of His signs is that the heaven and the earth stand firm by His command. Then when He will call you from the earth, henceforth you will come out.",
        "verse_26": "And to Him belongs whosoever is in the heavens and the earth. All are under His command.",
        "verse_27": "And He it is, Who makes first, then He will make it for the second time, and it should be most easy for Him in your understanding. And for Him is the most exalted state in the heavens and in the earth and He is the Honorable, the Wise.",
        "verse_28": "He narrates for you an example from your own conditions. Are some of your servants the possession of your hands partners in what We have provided for you so that you all become equal therein, you fear them as you fear each other? Thus do We explain the detail signs for a people who understand.",
        "verse_29": "Nay! The unjust followed their own desires without knowledge. Then who will guide him whom Allah has led astray. And they have no helpers.",
        "verse_30": "Therefore set right your face for the obedience of Allah being one devoted to Him only. The established pattern of Allah upon which He has created mankind. No change in the created things of Allah. This is the only right religion. But most of the people know not.",
        "verse_31": "Turning to Him in repentance and fear Him and establish prayer and be not of the associaters.",
        "verse_32": "Of those who have split up their religion and have become many groups. Every group is happy over what they have.",
        "verse_33": "And when any hurt touches mankind, they call their Lord, turning towards Him, then when He lets them taste mercy from Him, henceforth, a group of them use to associate partners with their Lord.",
        "verse_34": "That they may be ungrateful for what We have given them. So enjoy then, now soon you are to know.",
        "verse_35": "Or have We sent down any authority upon them that it is speaking of them as Our associators?",
        "verse_36": "And when We cause mankind to taste of mercy, they rejoice in it. And if any evil befalls them, the recompense of what their hands have sent forth, hence they despair.",
        "verse_37": "Have they not seen that Allah expands the provision for whomsoever He pleases, and straitens for whomsoever He pleases? Undoubtedly, in it there are signs for the believers.",
        "verse_38": "Therefore give the kinsman his due and the needy and the wayfarer. This is better for those who seek the pleasure of Allah and it is they who became prosperous.",
        "verse_39": "And whatever you give to take back more that it may increase the wealth of the givers, then it will not increase with Allah, and whatever you give as charity desiring Allah's pleasure, then those have twofold increase.",
        "verse_40": "Allah is, He Who created you then provided for you, then he will cause you to die, then He will give you life. Is there any such of your associates who may do any of these things? Glorified and exalted is He above from what they associate.",
        "verse_41": "The mischief has appeared in the land and sea, because of the evils earned by the hands of men, so that He may make them taste some of their doings, That haply they may turn back.",
        "verse_42": "Say you, travel in the land and see what was the end of those before you. Most of them were associators.",
        "verse_43": "Therefore set your face right for the prayer before there comes a day which is not to be averted from Allah, on that day they shall be divided.",
        "verse_44": "Whoso commits infidelity, the burden of his disbelief is on him and those who do good, they are preparing for themselves.",
        "verse_45": "In order that He may reward those who have believed and have done good deeds out of His grace. Undoubtedly He loves not the infidels.",
        "verse_46": "And of His signs is that He sends the winds as bearers of glad tidings and in order that He may cause you to taste of His mercy and that the ship may sail with His command and that you seek His grace and that you may be grateful.",
        "verse_47": "And undoubtedly, We sent so many Messengers before you towards their people and they brought them open signs, then We took vengeance from the culprits. And it is on Our grace binding to help the Muslims.",
        "verse_48": "Allah is He Who sends the winds that lift the clouds, then He spreads it in the sky as He pleases, and breaks its into fragments, then you see the rain is pouring from its midst. Then when He causes it to reach on whom He pleases of His bondmen, lo! They rejoice.",
        "verse_49": "Though before it was sent down upon them, they had shattered their hopes.",
        "verse_50": "Look then the effects of the mercy of Allah how He gives life to the earth after its death, no doubt, He will give life to the dead, and He can do everything.",
        "verse_51": "And if We send any wind by which they see their harvest yellow, then they would certainly thereafter continue to be ungrateful.",
        "verse_52": "Therefore you make not the dead to hear nor you make the deaf to hear the call when they turn away showing their backs.",
        "verse_53": "And nor you guide the blind from their error. You make only those to hear who believe in Our signs and they have already surrendered.",
        "verse_54": "Allah is He Who made you weak in the beginning, then He gave you strength after weakness, then after strength caused weakness and old age. He makes what He likes. And He is the Knowing, the Authoritative.",
        "verse_55": "And the day when the Hour shall be established, the culprits will swear, that they tarried not but an hour. Thus they were turned down.",
        "verse_56": "And those who were given knowledge and faith said, 'undoubtedly, you have tarried according to the writing of Allah, till the Day of Rising up. This then is Day of Rising up but you did not know.",
        "verse_57": "Therefore on that day, their excuses shall not benefit the oppressors, nor will anyone demand them to please Allah.",
        "verse_58": "And undoubtedly, We have set in this Quran every kind of examples for the people. And if you bring them any sign, the infidels would certainly say then, 'you are not but on falsehood'.",
        "verse_59": "Thus does Allah seal the hearts of those who do not know?",
        "verse_60": "Therefore have patience, undoubtedly, the promise of Allah is true, and let not those who have no conviction make you light."
        },
    "count": 60
}
