{
    "name": "al-Kahfi",
    "index": "018",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "All praise to Allah Who sent down the Book upon His Bondman and has not put therein any crookedness.",
        "verse_2": "The Book of justice that may warn of severe punishment from Allah, and that may give the believers who do good deeds the glad tidings that for them there is good reward.",
        "verse_3": "In it they shall abide forever.",
        "verse_4": "And that it may warn those who say, 'Allah has taken a son for Himself.'",
        "verse_5": "They have no knowledge about it nor their forefathers. What a monstrous word it is, that comes out from their mouths. They are merely telling a lie.",
        "verse_6": "Then haply you will risk your life with grief after them if they believe not in this discourse.",
        "verse_7": "Undoubtedly We adorned the earth whatever is on it, so that We may test them as to which of them is best in work.",
        "verse_8": "And undoubtedly whatever is on it, We shall one day leave it as a barren field.",
        "verse_9": "Did you know that the men of the cave and of the forest's side were of Our wonderful sign?",
        "verse_10": "When those youths took refuge in the cave and said, 'O our Lord, 'Grant us mercy from yourself and provide for us guidance in our affair.'",
        "verse_11": "Then We smote their ears many years in the cave.",
        "verse_12": "Then We raised them up that We might see which of the two groups most rightly tells the period of their stay there.",
        "verse_13": "We relate to you their story with truth. They were some young men who believed in their Lord and We increased them in guidance.",
        "verse_14": "And We solaced their hearts when they stood up and said, 'Our Lord is He Who is the Lord of heavens and earth, we shall not worship any god besides Him, if we did so, then necessarily we uttered crossing the limit.",
        "verse_15": "'These our people have taken for themselves gods besides Him (Allah). Why then they do not bring for them a bright authority? Then who is more unjust than he who fabricates a lie against Allah.",
        "verse_16": "'And when you have separated yourselves from them and from all that which they worship besides Allah, then take refuge in the cave, your Lord will unfold for you His mercy and will prepare an easy arrangement of your affairs.'",
        "verse_17": "And O beloved! You will see the sun when it rises, moves away from their cave to the right and when it sets, turns away from them on the left, whereas they are in the open space of the cave. This is of the signs of Allah. He whom Allah guides is on the right way, and he whom He sends astray, for him you will never find a supporter to guide.",
        "verse_18": "And you might deem them awake and they sleep and We turn them about to the right and to the left and their dog has stretched his forelegs at the threshold of the Cave. O listener! If you had a look peeping at them, then you would have run away turning your back and would have surely filled with terror of them.",
        "verse_19": "And likewise We did rouse them that they might question one another. One spokesman of them spoke, 'How long have you stayed here?' Some of them spoke, 'We stayed a day or part of a day.' Others spoke, 'Your Lord knows well how long you stayed; now then send one of you with this silver to the city, then let him look for which food is the cleaner there and that he may bring you provision from it, and let him be courteous and let him never inform anyone about you.",
        "verse_20": "'Undoubtedly, if they would know you, then they would stone you or make you revert to their faith and if it was so, then you would never get any good.'",
        "verse_21": "Likewise We did inform of them that the people might know that Allah's promise is true and that the Hour — there is no doubt about it, when they began disputing among themselves about their affair, then they said, 'Build over their cave any building.' Their Lord knows well about them. Those who prevailed in their affair said, 'We swear that we shall erect over them a mosque.'",
        "verse_22": "Now they will say 'they are three and the fourth one is their dog' and some will say 'they are five and sixth one is their dog' without seeing, guessing at random, and some will say 'they are seven and the eighth one is their dog.' Say you, 'My Lord knows well their number, none knows them but a few, so debate not about them, but the discussion to the extent outwardly expressed, and ask not to any man of the Book about them.",
        "verse_23": "And never say of anything, 'I will do this tomorrow.'",
        "verse_24": "But that Allah please, and remember your Lord when you forget and say like this, 'It is near that my Lord might make me see the right path nearer than this.'",
        "verse_25": "And they stayed in their cave three hundred years, nine more.",
        "verse_26": "Say you, 'Allah knows well how long they stayed. For Him alone is all the unseen of heavens and earth. What excellent He sees and what excellent He hears.' They have no Protector besides Him, and He associates no one in His order.",
        "verse_27": "And recite what has been revealed to you of the Book of your Lord, there is none to alter His words, and never you will find refuge besides Him.",
        "verse_28": "And keep yourself familiar to those who call upon their Lord in the morning and evening seeking His pleasure and your eyes should not see others leaving them; would you like the adornment of the life of this world? And obey not him whose heart We have made neglectful of Our remembrance and who followed his own desire and whose affair exceeded the limit.",
        "verse_29": "And say, 'The truth is from your Lord, then whoso wills, let him believe and whoso wills, let him disbelieve; undoubtedly, We have already prepared for the unjust a fire whose walls would surround them. And if they complain for water, then they will be helped with water, which is like molten lead that will burn the faces. What a bad drink it is and the hell what an evil place to stay.",
        "verse_30": "Undoubtedly those who believed and did good deeds, We shall not waste the reward of those whose works are good.",
        "verse_31": "For them there are gardens for habitation beneath which streams flow. They will be adorned therein with bracelets of gold and will wear green garments of silk and heavy brocade, leaning therein on raised couches, and the paradise, what a good resting place.",
        "verse_32": "And state to them the position of two men, that to one of them We provided with two gardens of grapes and covered them with date-palms and We placed agricultural farming in between.",
        "verse_33": "Both gardens brought forth their fruits and gave nothing short in it, and We caused to flow stream amidst both.",
        "verse_34": "And he had fruits, then he said to his companion, and he used to argue with him, 'I have greater wealth than you and am stronger in respect of men.'",
        "verse_35": "And he entered in his garden while wronging his soul. He said, 'I do not think that it will ever perish.",
        "verse_36": "And I do not think that the Hour will ever come, and even if I am returned to my Lord, then I shall surely get a better place of return than this garden.'",
        "verse_37": "His companion replied to him while arguing with him, 'Do you disbelieve in Him Who created you from dust then from a purified drop of water, then made you a right man?",
        "verse_38": "'But I say only this that He, Allah, is my Lord and I associate none with my Lord.",
        "verse_39": "'And why it was not so that when you entered in your garden, then you would have told, as Allah will, we have no power but the help of Allah, if you see me as less than you in wealth and offspring.",
        "verse_40": "'Then it is near that my Lord will give me something better than your garden and send down thunderbolt from heaven on your garden, then it may become a bare plain ground.",
        "verse_41": "'Or its water sink in the ground, then you could never be able to find it.'",
        "verse_42": "And his fruits were encompassed, then he remained wringing his hands for what he had spent in that garden and it had fallen on its trellises and he is saying, 'Oh! If I would not have associated anyone with my Lord.'",
        "verse_43": "And he had no party to help him against Allah, nor was he able to take revenge.",
        "verse_44": "Here it becomes clear that the authority is of Allah, the True. His reward the best and best is the end of believing in Him.",
        "verse_45": "And relate to them the example of the life of the world, it is as a water We sent down from the heaven, then the greenery of the earth because of it came out thickly and then it became dry grass which the winds scatter. And Allah is Powerful over everything.",
        "verse_46": "The wealth and sons are an adornment of the life of this world and the lasting are the good things, their reward is better with your Lord and is best in hope.",
        "verse_47": "And the Day We shall cause the mountains to move and you will see the earth clean open and We shall raise them, then We shall not leave anyone of them.",
        "verse_48": "And all shall be presented before your Lord standing in rows. Undoubtedly you have come to Us same as We had made you at first, but you thought that We would never fix any time of the promise.",
        "verse_49": "And the book shall be put, then you will see the culprits fearing for what is written therein and will say, 'Oh! Woe to us, what happened to this writing? It left neither any small sin nor a big sin that has not been encompassed.' And they found all that they did before them. And your Lord is not unjust to anyone.",
        "verse_50": "And remember when We ordered angels to prostrate before Adam, then all prostrated save Iblees (Devil). He was of the Jinn, then he went out of the command of his Lord. Do you take him and his offspring for friends apart from Me? And they are your enemies; what an evil exchange the unjust got.",
        "verse_51": "I had neither made them sit before Me while creating heavens and earth, nor while creating themselves, and nor it is befitting to My Dignity that I should make My supporters to those who lead astray to others.",
        "verse_52": "And the Day when He will say, 'Call My associates whom you fancied.' Then they will call them, they will not answer them, and We shall set a field of destruction between them.",
        "verse_53": "And the guilty will see the Fire and will believe that they are to fall in it and will find no way of return from it.",
        "verse_54": "And undoubtedly, We have explained in varied manners all kinds of examples in this Quran for the people, and the man is over everything most contentious.",
        "verse_55": "And what hindered men from believing when guidance came to them and from asking forgiveness from their Lord, but that the tradition of the ancients should come to them or that the varied torments should come upon them.",
        "verse_56": "And We send not the Messengers but as bearers of glad tidings and as warner’s and those who are infidels contend with falsehood that they may subvert the truth therewith, and they took My signs and what they were warned of as a joke.",
        "verse_57": "And who is more unjust than he who when he is reminded of the signs of his Lord turns away his face from them and forgets what his hands have sent forward. We have put covers on their hearts that they may not understand Quran and in their ears a heaviness. And if you call them towards guidance then too, they will never find the way.",
        "verse_58": "And your Lord is the Forgiver, Full of mercy. If He would have seized them for what, they did, then He would have hastened torment for them. But for them there is an appointed time against which they will not find any refuge.",
        "verse_59": "And these towns: We have destroyed when they committed injustices, and We had appointed a fixed time for their destruction.",
        "verse_60": "And recall; when Musa said to his servant, 'I shall not desist until I reach there where two seas have joined, or I go on for ages.'",
        "verse_61": "Then when they both reached the meeting place of two seas they forgot their fish, and it found its way in the sea making an underground passage.",
        "verse_62": "Then when they had passed over from there, Musa told his servant, 'Bring our breakfast, we have no doubt faced great hardship in this journey.'",
        "verse_63": "He said, 'please see, when we took rest near that rock, then undoubtedly I forgot the fish, and the Satan (devil) made me forget that I may mention it and it took its way in the sea, it is strange.'",
        "verse_64": "Musa said, that is what we wanted,' then turned back retracing their footsteps.",
        "verse_65": "Then they found a bondman from Our bondmen, whom We gave mercy from Ourselves and bestowed him Our inspired knowledge.",
        "verse_66": "Musa said to him, 'should I remain with you on the condition that you will teach me of the right things which you have been taught.'",
        "verse_67": "He said, 'you can never stay with me.",
        "verse_68": "'And how you will keep patience over that which your knowledge encompasses not?'",
        "verse_69": "Musa said, 'soon if Allah will, you will find me patient, and I shall not disobey you in any affair.'",
        "verse_70": "He said, 'If you remain with me, then ask not anything, unless I myself mention it?",
        "verse_71": "Now both of them set out, until when they embarked in a boat, he cleaved it. Musa told, 'have you cleaved it in order to drown its passengers, undoubtedly you have done a wrong thing.'",
        "verse_72": "He said, 'did I not tell you, that you would not be able to stay with me.'",
        "verse_73": "Musa said, 'catch me not for what I forgot and put not difficulty in my affair on me.'",
        "verse_74": "Again both of them set out, until when they met a boy he killed him, Musa said, 'have you killed an innocent soul without his having killed another? Undoubtedly you have done a hideous thing.'",
        "verse_75": "He said. 'Had I not told you that you could never keep company with me?'",
        "verse_76": "Musa said, 'If I ask anything to you after this, then keep not company with me; undoubtedly, your excuse is already fulfilled from my side.'",
        "verse_77": "Again both went on till they came to the people of a village, they asked the villagers for food, but they refused to entertain them, then the two found a wall about to fall, he set it upright. Musa said, 'If you had wished, you could have taken a wage for it.'",
        "verse_78": "He said, 'This is the separation between me and you; now I shall tell you the explanation of those things over which you could not have patience.",
        "verse_79": "'As for the boat, it belonged to certain poor people who were working in the sea, then I intended to make it faulty and behind them there was a king who used to seize every perfect boat forcibly.",
        "verse_80": "'And as for the boy, his parents were Muslims, then we feared that he might involve them in contumacy and infidelity.",
        "verse_81": "'Then we intended their Lord might give them one better than he in purity and nearer in affection.",
        "verse_82": "'As for that wall, it belonged to the two orphan lads of the city and underneath it was their treasure and their father was a noble man; then your Lord desired that those two should reach their maturity and bring forth their treasure as a mercy from your Lord, and this I did, not of my own biding. This is the significance of those things on which you could not have patience.'",
        "verse_83": "And they ask you about Zulqarnain; say, you, 'I recite to you an account of him.'",
        "verse_84": "Undoubtedly, We gave him a control in the earth and bestowed him a means of everything.",
        "verse_85": "Then he followed a way.",
        "verse_86": "Till when he reached the place of sun's setting, he found it setting in a spring of black mud, and he found a people there. We said, 'O Zulqarnain, either you punish them or do good to them.'",
        "verse_87": "He submitted, 'As one who did injustice, we shall punish him soon, then he will be returned towards his Lord, He will strike him with an evil striking.",
        "verse_88": "'And one who believed and did good deeds, then the recompense for him is the good; and soon We shall speak to him easy affair.'",
        "verse_89": "Again he followed a way.",
        "verse_90": "Until, when he reached the place of sun's rising he found it rising on a people for whom We had not put any shelter against the sun.",
        "verse_91": "So is the talk. And whatever he had, Our knowledge encompasses all.",
        "verse_92": "Again he followed a way.",
        "verse_93": "Until when he reached between two mountains, he found inside them some such people who seemed not to understand any word.",
        "verse_94": "They said, 'O Zulqarnain, undoubtedly, Yajuj (Gog) and Majuj (Magog) create mischief in the earth, should we then fix some tribute for you on the condition that you may set up a wall between us and them?'",
        "verse_95": "He said, 'That upon which my Lord has given me control is better, then help me with strength, I may make a strong barrier between you and them.",
        "verse_96": "'Bring me the pieces of iron.' Till when he levelled the wall up to the sides of the two mountains, he said, 'blow', till when he made it a fire, said he, 'Bring me, that I may pour molten copper on it.'",
        "verse_97": "Then Yajuj and Majuj could neither climb over it, and nor could make a hole in it.",
        "verse_98": "He said, 'This is a mercy from my Lord, then when the promise of my Lord will come, He will break it into pieces, and the promise of my Lord is ever true.'",
        "verse_99": "And on that day We shall leave them that one group of will surge ever the other and the trumpet shall be blown, then We shall gather them altogether.",
        "verse_100": "And We shall bring the Hell on that Day before the infidels.",
        "verse_101": "Those upon whose eyes there was covering from My remembrance and could not hear the truth.",
        "verse_102": "Do then the infidels think that they will make my bondsmen as their supporters besides Me? Undoubtedly We have already prepared hell for the hospitality of the infidels.",
        "verse_103": "Say you, 'Shall We tell you, whose actions are worst?",
        "verse_104": "Those whose all struggles were lost in the life of the world and they imagine that they are doing good work.",
        "verse_105": "These are the people who disbelieved in the signs of their Lord and in His meeting. Therefore all their deeds are vain, and We shall not establish any weight for them on the Day of Judgement.",
        "verse_106": "This is their recompense, the Hell for they disbelieved and took My Signs and My Messengers in mockery.",
        "verse_107": "Undoubtedly, those who believed and did good deeds, the gardens of paradise are for their hospitality.",
        "verse_108": "They shall dwell in it for ever, not willing to change the place therefrom.",
        "verse_109": "Say you, 'If the sea be the ink for the words of my Lord, then necessarily, the sea would be exhausted and the words of my Lord would not come to an end, though We may bring the like of it for help.'",
        "verse_110": "Say you, 'Apparently in facial outlook of a man, I am like you, I receive revelation that your God is One God, then whosoever hopes to meet his Lord, he should do noble deeds and associate not anyone in the worship of his Lord.'"
        },
    "count": 110
}
