{
    "name": "Saba'",
    "index": "034",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "All praise to Allah, Whose is all belongings whatever is in the heavens and whatever is in the earth and His is the praise in the Hereafter. And He is the Wise, the Aware.",
        "verse_2": "He knows what goes into the earth and what comes forth from it, and what descends from the heaven and what ascends into it. And He is the Merciful, the Forgiving.",
        "verse_3": "And the infidels said, 'the Hour will not come unto us. Say you, 'why not, by my Lord, it will, no doubt, come to you.' He knows the unseen. Not even an atom's weight, anything in the heavens and in the earth is absent from Him, and nor even anything less than that or greater, but it is in a perspicuous Record.",
        "verse_4": "So that He may recompense those who believed and did good works. These are for whom there is forgiveness, and an honorable provision.",
        "verse_5": "And those who tried to defeat in Our signs for them is the suffering of the painful torment.",
        "verse_6": "And those who have been given knowledge know that what has been sent down to you from your Lord is the only truth and guides to the path of All-Dignified, All-Laudable.",
        "verse_7": "And the infidels said, 'shall we point you a person who will inform you that when being torn into pieces you become small particles, you are then to be made new?'",
        "verse_8": "Has he forged a lie against Allah or is he afflicted with madness? Nay, but those who do not believe in the Hereafter are in the torment and far gone error.",
        "verse_9": "Have they then not seen what is before them and what is behind them of the heaven and the earth? if We will, We may cause them to sink in the earth or cause a piece of the sky to fall upon them. Undoubtedly, in it is a sign for every bondman repentant.",
        "verse_10": "And undoubtedly, We gave Daud a great grace from Us. O mountains! Turn towards Allah with him, and O birds! And We made the iron soft for him.",
        "verse_11": "That make wide coats of mail and keep regard of the measurement in making, and you all do righteousness, undoubtedly, I am seeing your works.",
        "verse_12": "And to Sulaiman We subjected the wind, its morning stage was of a month journey and its evening stage was of a month journey and We made to flow a stream of molten copper for him. And of the Jinn those who worked before him by the command of his Lord. And those of them who swerved from Our Command, We shall make them taste the torment of the blazing fire.",
        "verse_13": "They made for him what he desired, lofty palaces and statues and trough of the size of big tanks and anchored cauldrons. O members of the family of Daud! Give thanks. And there are few in My bondmen that are thankful.",
        "verse_14": "Then when We decreed death for him, We informed not the jinn about his death but termite of the earth that used to eat his staff. So when Sulaiman came down on earth, the reality of the jinn was known; if they had known the unseen, then they would not have been in this degrading torment.",
        "verse_15": "Undoubtedly, for Saba there was a sign in their own dwelling place, two gardens in the right and on the left. Eat you of the provision of your Lord and render thanks to Him. A clean city and a Forgiving Lord.",
        "verse_16": "But they turned their faces. We then sent towards them a fierce flood and We exchanged their two gardens with two other gardens bearing insipid fruit and tamarisk and a few lote trees.",
        "verse_17": "We recompensed them in this way a punishment for their ungratefulness and whom so We punish only him who is ungrateful.",
        "verse_18": "And We set, between them and the cities that We had blessed, many cities by the way (to be seen) and put them in measured stages. Travel in them nights and days in security.",
        "verse_19": "But they said, O our Lord! 'Put distance in our journeys and they wronged themselves, therefore We made them tales and We broke them into pieces with full confusion. Undoubtedly, in it are signs for every enduring grateful person.",
        "verse_20": "And undoubtedly, Iblis proved his conjecture true to them, so they followed him but a party that was Muslim.",
        "verse_21": "And there was no control of the devil (saitan) over them but it was so that We may show him who believes in the Hereafter and who is of them in doubt. And your Lord is Watchful over all things.",
        "verse_22": "Say you, 'Call upon those whom you have already fancied apart from Allah, they are not owners even of an atom's weight in the heavens or in the earth and nor they have any share in either of them and nor any of them a helper to Allah.",
        "verse_23": "And intercession with Him is of no use but for him about whom He permits, until when after giving permission the bewilderment of their hearts is removed; they say to one another, what is it that your Lord has said? They say, 'whatever He said, said truth,' and He is the Exalted, The Great.",
        "verse_24": "Say you, 'who provides for you from the heavens and the earth'? Say you, 'Allah and undoubtedly, either we or you necessarily are upon the guidance or in open error.'",
        "verse_25": "Say you, 'if in your opinion we have committed any crime, you shall not be asked about, nor we shall be questioned about your deeds.'",
        "verse_26": "Say you, 'Our Lord shall bring us together, then He shall decide between us with truth.' And He is the Great Judge, the All-Knowing.",
        "verse_27": "Say you, 'show me those associates whom you have joined with Him, never, Aye He is Allah, the Dignified, the Wise.",
        "verse_28": "And O beloved! We sent not you but with Messenger ship encircling entire mankind, as a bearer of glad tidings and a warner, but most of the people do not know.",
        "verse_29": "And they say, 'when, shall this promise come, if you are truthful.'",
        "verse_30": "Say you, 'for you is the promise of a day from which neither you can go behind for a single moment nor you can go ahead of it.'",
        "verse_31": "And the infidels said, 'We shall never believe in this Quran and nor in those books which were before it.' And if you could see when the unjust will be made to stand before their Lord; they shall cast back the word one against the other, those who were pressed will say to those who were swelled with pride, 'if you had not been, we would surely have believed.'",
        "verse_32": "Those who were swelled with pride will say to those who were pressed, 'Had we prevented you from the guidance after it came to you, (say,) nay, you were culprits yourselves.'",
        "verse_33": "And those who were pressed will say to those who were swelled with pride, 'Nay! it was your plotting of night and day, when you used to command us that we should deny Allah and should set up equals for Him. And they began to repent secretly when they saw the torment. And We put shackles on the necks of those who were deniers. What they shall be recompensed, but only for that they used to do.",
        "verse_34": "And whenever We sent any warner in any city, the well-off people, thereof said, 'we deny that with which you have been sent.'",
        "verse_35": "And they said, 'we are greater in riches and children, and we are not to be tormented.'",
        "verse_36": "Say you, 'undoubtedly, my Lord expands the provision for whom He pleases, and straitens it for whom He pleases, but most of mankind know not.'",
        "verse_37": "And your wealth and your children are not capable of bringing you near to Us but those who believed and did righteousness have double reward the recompense of their doings and they are secure in lofty mansions.",
        "verse_38": "And those who try to defeat in Our signs, they shall be brought in the torment.",
        "verse_39": "Say you, 'undoubtedly, my Lord expands provision for whom He pleases of His bondmen and straitens for whom He pleases.' And whatever you spend in the way of Allah, He will recompense you with more. And He is the Best of the providers.'",
        "verse_40": "And the day He will raise up all of them, He will then say to the angels, 'did these men use to worship you?'",
        "verse_41": "They shall submit, ‘Sanctified are You, You are our Friend, not they, Nay, they used to worship the Jinn, most of them had believed in them.",
        "verse_42": "Therefore today none of you shall have power to do good or bad one another. And We shall say to the oppressors, 'taste the torment of this Fire which you used to belie.",
        "verse_43": "And when Our clean signs are recited to them, they say then, 'this is not but a man who desires' to bar you from that your fathers worshipped', and say, 'this is not but calumny fabricated.' And the infidels said about the truth when it came to them, 'this is not but open magic.'",
        "verse_44": "And We gave not them some books which they studied, nor any warner came to them before you.",
        "verse_45": "And those before them belied, and these reached not even a tenth of what We had given them, but they belied My Messengers. Then how was My disapproval.",
        "verse_46": "Say you, 'I give you one admonition that keep you standing for Allah in twos and singly, then reflect,' there is nothing of madness in your this companion. He is not but a warner to you before a severe torment.",
        "verse_47": "Say you, 'if I might have asked you some reward against it, then it is yours.' My reward is only upon Allah, and He is Witness over everything.",
        "verse_48": "Say you, 'undoubtedly, my Lord casts the truth, the Knower of all hidden things.'",
        "verse_49": "Say you, 'the truth has come and falsehood neither originates and nor be restored.'",
        "verse_50": "Say you, 'if I strayed, then I strayed only to my own loss, and if I have been guided, then on account of what my Lord has revealed to me. Undoubtedly, He Hears, is Near.",
        "verse_51": "And anyhow you could see, when they shall be put in confusion, but then they would not go safe and they will be seized from a place nearby.",
        "verse_52": "And they will say, 'we now believed therein;' and how can they get back to it from a far-off place.",
        "verse_53": "That they had already disbelieved in it; and they hurl without seeing from a far-off place.",
        "verse_54": "And a barrier has been placed between them and that which they long for, as was done with their former groups. Undoubtedly, they were in a deceiving doubt."
     },
    "count": 54
}
