{
    "name": "al-Muthaffifin",
    "index": "083",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Woe is to those who give short measure.",
        "verse_2": "Those who, when they take by measure from others, take it full.",
        "verse_3": "But when they give by measure to others or weigh to them, they diminish.",
        "verse_4": "Do not these people imagine that they are to be raised?",
        "verse_5": "On a mighty day.",
        "verse_6": "The day when all persons will stand before the Lord of the Worlds.",
        "verse_7": "Undoubtedly, the record of the infidels is in the lowest place sijjin.",
        "verse_8": "And what do you know, what Sijjin is?",
        "verse_9": "That record is a writing sealed.",
        "verse_10": "Woe is on that day to the beliers.",
        "verse_11": "Those who belie the Day of Judgement.",
        "verse_12": "And none will belie it but every contumacious.",
        "verse_13": "When Our signs are read to him, (he) says, 'fables of the ancients'.",
        "verse_14": "Nothing but rather their earnings have rusted their hearts.",
        "verse_15": "Yes, certainly they are deprived of the sight of their Lord that day.",
        "verse_16": "Then, undoubtedly they are to enter the Hell.",
        "verse_17": "Then it shall be said, 'this is what you used to belie'.",
        "verse_18": "Yes, certainly, the record of the virtuous is in the highest place 'llliyyin'.",
        "verse_19": "And what do you know, what llliyyin is?",
        "verse_20": "That record is a writing sealed.",
        "verse_21": "The chosen ones see to it.",
        "verse_22": "Undoubtedly, the virtuous are in bliss.",
        "verse_23": "They look at thrones.",
        "verse_24": "You recognize the freshness of bliss in their faces.",
        "verse_25": "They shall be made to drink pure Wine which is already sealed.",
        "verse_26": "The seal is on Musk, and for this let the aspirers aspire.",
        "verse_27": "And its mixture is with the water of Tasnim.",
        "verse_28": "A spring of which the chosen ones drink.",
        "verse_29": "Undoubtedly, the culprits used to laugh at those who believed.",
        "verse_30": "And when they pass by them, they wink at them among themselves.",
        "verse_31": "And when they return to their household, return rejoicing.",
        "verse_32": "And when they see Muslims, they say, 'Undoubtedly, they are the strayed ones.'",
        "verse_33": "And they were not sent as keepers over them.",
        "verse_34": "This day, therefore the believers laugh at the infildels.",
        "verse_35": "They look seated on thrones.",
        "verse_36": "How the infidels have been recompensed of their doings?"
    },
    "count": 36
}
