{
    "name": "an-Nazi'at",
    "index": "079",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By those who drag forth souls vehemently,",
        "verse_2": "And those who release knots gently.",
        "verse_3": "By those who swim easily.",
        "verse_4": "Then they reach soon by advancing.",
        "verse_5": "Then they manage the affairs.",
        "verse_6": "The infidels shall necessarily be chastised on the Day when the shivering one will shiver.",
        "verse_7": "And there will follow it the following one.",
        "verse_8": "How many hearts will be throbbing that Day?",
        "verse_9": "They will not be able to life up their eyes.",
        "verse_10": "The infidels say, \"Shall we really be restored to our former state\"?",
        "verse_11": "What! Even when we shall be rotten bones?",
        "verse_12": "They said, such returning back is indeed a total loss.",
        "verse_13": "That is not but a mere scolding.",
        "verse_14": "Henceforth they shall be lying in an open ground.",
        "verse_15": "Have you received the news of Musa?",
        "verse_16": "When his Lord called to him in the holy valley Towa:",
        "verse_17": "Go to Firawn; he has rebelled.",
        "verse_18": "And say to him'Have you any liking to purify yourself?",
        "verse_19": "And that l should guide you to your Lord so that you may fear Him.",
        "verse_20": "Then Musa showed him a great sign.",
        "verse_21": "But he belied him and disobeyed.",
        "verse_22": "Then he gave his back to him, striving against him.",
        "verse_23": "Then he gathered his people and proclaimed.",
        "verse_24": "And said,'I am your Lord, the most high'.",
        "verse_25": "Therefore Allah seized him for the torment of the present world and the Hereafter both.",
        "verse_26": "Undoubtedly, there is in it a lesson for him who fears.",
        "verse_27": "Whether according to your wisdom, the creation of yours is difficult or the heaven that He has built?",
        "verse_28": "He has raised high its vault and made it perfect.",
        "verse_29": "And He has made its night dark, and its sunshine bright.",
        "verse_30": "And after that he spread out the earth.",
        "verse_31": "He brought forth therefrom its water and its pasture.",
        "verse_32": "And set firmly the mountains.",
        "verse_33": "For your benefit and for your cattle.",
        "verse_34": "But when the biggest calamity will come.",
        "verse_35": "That day when man will call to mind all that he strove for.",
        "verse_36": "And the Hell will be made manifest to him who sees.",
        "verse_37": "Then as for him who rebelled,",
        "verse_38": "And preferred the life of this world,",
        "verse_39": "Then undoubtedly, the hell is his destination.",
        "verse_40": "But as to him who feared to stand before his Lord, and restrained his soul from evil desires.",
        "verse_41": "Then undoubtedly, the Paradise is his destination.",
        "verse_42": "They ask you concerning the Hour: when it is destined to come?",
        "verse_43": "But what you are to do with its mentioning?",
        "verse_44": "Towards your Lord is its ultimate end.",
        "verse_45": "You are only a warner to him who fears it.",
        "verse_46": "It shall be as if, on the day when they will see it, they had not tarried in the world but an evening or the rising of the sun."
     },
    "count": 46
}
