{
    "name": "ath-Thur ",
    "index": "052",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By the Mount.",
        "verse_2": "And by the Book inscribed.",
        "verse_3": "Which is written in an open sheet.",
        "verse_4": "And by the frequented House.",
        "verse_5": "And by the lofty roof.",
        "verse_6": "And by the burning sea.",
        "verse_7": "Surely, the torment of your Lord is certainly to occur.",
        "verse_8": "There is none to avert it.",
        "verse_9": "The day when the heaven will shake with awful shaking.",
        "verse_10": "And the mountains will move with an awful movement.",
        "verse_11": "'Woe' is then on that day to the beliers.",
        "verse_12": "Those who are playing in idle avocation.",
        "verse_13": "The day when they shall be driven towards the hell with forceful pushing.",
        "verse_14": "This is the Fire which you used to belie.",
        "verse_15": "Is this magic? Or you do not perceive.",
        "verse_16": "Go into it, now whether you be patient or be not patient, all is equal to you. You are merely recompensed for what you used to do.",
        "verse_17": "Undoubtedly, the pious are in gardens and in delight.",
        "verse_18": "They are happy what their Lord has bestowed on them, and their Lord have saved them from the fire.",
        "verse_19": "Eat and drink with pleasure for what you were doing.",
        "verse_20": "Reclining in couches which are spread in rows, and We got them married with fair maidens having wide beautiful eyes.",
        "verse_21": "And those who believed and whose offspring followed them with faith. We joined them with their offspring and diminished not anything from their deeds. All men are pledged in their deeds.",
        "verse_22": "And We helped them with fruits and meat, anything they desire.",
        "verse_23": "They pass from one to another a cup wherein is neither absurdity nor sin.",
        "verse_24": "And the youths in their service will go round them as if they are pearls preserved concealed.",
        "verse_25": "And of them one faced another asking questions.",
        "verse_26": "They said, 'Verily, before this we were in our families afraid.",
        "verse_27": "'Therefore Allah favored us and saved us from the torment of scorching hot wind.",
        "verse_28": "'Verily, we had worshiped Him in our first life. Undoubtedly, He is the Beneficent, the Merciful.'",
        "verse_29": "Then (O beloved Prophet!) admonish. By the grace of Allah neither you are a soothsayer nor a madman.",
        "verse_30": "Or they say, 'He is a poet, we are waiting for the calamity of the time coming on him.'",
        "verse_31": "Say, you, 'Keep on waiting, I am too waiting with you.'",
        "verse_32": "Do their wisdom tell them this or they are people contumacious?",
        "verse_33": "Or they say, 'He has made this Quran.' Nay rather they believe not.",
        "verse_34": "Then let them bring a single discourse like this, if they are truthful.",
        "verse_35": "Have they not been created by any lineage or they are themselves creators?",
        "verse_36": "Or they have created the heavens and the earth? Nay, rather they are not convinced.",
        "verse_37": "Or they possess the treasure of your Lord or they are in charge of affairs?",
        "verse_38": "Or they have any ladder by means of which they hear, then let their listener bring a clear authority.",
        "verse_39": "Has He daughters and you sons?",
        "verse_40": "Or you ask some wage from them, so that they are pressed under a load of debt.",
        "verse_41": "Or they have unseen with them by which they give command.",
        "verse_42": "Or they are intending any plot? But it is the infidels who are to be caught in the plot.",
        "verse_43": "Or they have any other God besides Allah? Sanctified is Allah from their polytheism.",
        "verse_44": "And if they should see a fragment of the sky falling down they would say then, it is clouds piled up.",
        "verse_45": "Then leave them, till they encounter their day wherein they shall swoon.",
        "verse_46": "The day their plot shall avail them not at all, and not they shall be helped.",
        "verse_47": "And undoubtedly, for the unjust people there is a torment before this, but most of them know not.",
        "verse_48": "And O beloved Prophet! Remain patient for the order of your Lord, that verily you are before Our eyes, and sanctify your Lord praising Him when stand.",
        "verse_49": "And sanctify Him in the night and after the setting of the stars."
  },
    "count": 49
}
