{
    "name": "al-Qamar",
    "index": "054",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "The Hour came near and the moon was split.",
        "verse_2": "And if they see any sign, they turn their faces and say this is magic perpetual.",
        "verse_3": "And they belied and followed their desires, and every affair has already been resolved.",
        "verse_4": "And undoubtedly, there have come to them those tidings wherein there was enough to check.",
        "verse_5": "Perfect wisdom, but warners profit them not.",
        "verse_6": "So turn you away from them. The day when the caller will call towards a harsh unrecognized thing.",
        "verse_7": "Casting down their eyes, they will come out of the graves as they are locusts scattered.",
        "verse_8": "Hastening towards the Caller. The infidels will say, 'this day is hard'.",
        "verse_9": "The people of Nuh belied before them, they declared Our bondman to be liar and said, 'he is a madman and scolded him'.",
        "verse_10": "He therefore prayed to his Lord, saying 'I am vanquished, do then take revenge for me.'",
        "verse_11": "Then We opened the doors of heaven with forceful flowing water.",
        "verse_12": "And We made the earth flow with springs so the two waters met to such a quantity which was already decreed.",
        "verse_13": "And We bore Nuh on a thing of planks and nails.",
        "verse_14": "Floating before Our eyes, a recompense for him who was rejected.",
        "verse_15": "And We left it as a sign. Is there than anyone who would pay attention?",
        "verse_16": "Therefore how was My torment and My warnings?",
        "verse_17": "And verily, We have made Quran easy for remembering, is there than anyone to remember?",
        "verse_18": "Aad belied, then how was My torment and My warnings?",
        "verse_19": "Surely, We sent against them a strong windstorm in a day whose ill-fortune remained lasting over them.",
        "verse_20": "It used to beat down the men as though they are the roots of uprooted palm trees.",
        "verse_21": "Then how was My torment and My warning?",
        "verse_22": "And undoubtedly, We made the Quran easy for remembering is there than anyone to remember.",
        "verse_23": "Thamud belied the Messengers.",
        "verse_24": "And they said, 'shall we follow a man from among ourselves? Then we in deed are misled and mad.",
        "verse_25": "Has the Reminder been sent down upon him from all among us? Nay, rather he is a great liar, self-boaster.'",
        "verse_26": "Very soon, tomorrow they will know who was a big liar, self- boaster.",
        "verse_27": "We are to send the she- camel for their trial, therefore O Saleh! Watch them and have patience.",
        "verse_28": "And inform them that the water has been divided between them in shares. He who has his turn should be presented at the share.",
        "verse_29": "Then they called their companion and he after taking the sword hamstrung her.",
        "verse_30": "Then how was My torment and My warnings?",
        "verse_31": "Verily We sent against them a single uproar, hence they became like the left over grass of enclosure builders, dry, trampled.",
        "verse_32": "And verily, We made the Quran easy for remembering, is there than anyone to remember?",
        "verse_33": "The people of Lut belied the Messengers.",
        "verse_34": "Verily, We sent over them a storm of stones except the family of Lut. We rescued them by early dawn.",
        "verse_35": "As a favor from Us. Thus do We recompense him who is grateful.",
        "verse_36": "And he had warned them of Our grasp, but they doubted in the Commandments of warning.",
        "verse_37": "They intended to solicit him from his guests, so We obliterated their eyes; 'taste My torment and My warning.'",
        "verse_38": "And undoubtedly, there came upon them early in the morning a lasting torment.",
        "verse_39": "Taste then My torment and My warning.",
        "verse_40": "And undoubtedly, We made Quran easy for remembering. Is there than anyone to remember?",
        "verse_41": "And verily the Messengers came to the people of Firawn (Pharaoh).",
        "verse_42": "They belied all Our signs. Then We seized them with a grasp befitting to the dignity of the Honorable and the All Authoritative.",
        "verse_43": "Are your infidels better than those? Or have you an exemption in the Scriptures?",
        "verse_44": "Or is it that they say, 'We shall take revenge altogether.'",
        "verse_45": "Now this multitude is being driven out and they will turn their backs.",
        "verse_46": "Nay, rather the Hour is their promise and the Hour is the hardest and bitterest.",
        "verse_47": "Surely, the culprits are misled and mad.",
        "verse_48": "The day when they shall be dragged into the fire on their faces and it will be said to them, 'taste the flame of the Hell.",
        "verse_49": "Undoubtedly, We created everything according to an estimate.",
        "verse_50": "And Our work is only a matter as the twinkling of an eye.",
        "verse_51": "And undoubtedly, We have destroyed your likes, is there anyone to look into?",
        "verse_52": "And whatever they have done is in the Books.",
        "verse_53": "And everything, small or big, has been written down.",
        "verse_54": "Undoubtedly, the pious are in gardens and stream.",
        "verse_55": "In the sitting of truth before the Sovereign, Most Authoritative."
      },
    "count": 55
}
