{
    "name": "az-Zukhruf",
    "index": "043",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Ha — Mim.",
  "verse_2": "By the Book luminous.",
  "verse_3": "We have sent it down an Arabic Quran that you may understand.",
  "verse_4": "And undoubtedly, it is in the Mother Book with Us, indeed exalted, full of wisdom.",
  "verse_5": "Shall We then turn away the Remembrance from you for that you are a people extravagant?",
  "verse_6": "And how many a communicator of unseen (a Prophet) did We send among the earlier people.",
  "verse_7": "And whoever as a communicator of the unseen (A Prophet) came to them, they used to mock at him.",
  "verse_8": "Therefore We destroyed those who were stronger in power than these, and the example of the earlier peoples has gone before.",
  "verse_9": "And if you ask them \"who has made the heavens and the earth\" they will necessarily say, \"the Esteemed One, the All-Knowing made them.\"",
  "verse_10": "He, Who made the earth a bed for you and made pathways therein for you that you may be guided.",
  "verse_11": "And He, Who sent down water from the sky according to an estimate, and We thereby gave life to a dead city and thus you will be brought forth.",
  "verse_12": "And Who made all the pairs and made for you carriages from boats and cattle.",
  "verse_13": "That you may sit rightly on their backs, and then you remember the favors of your Lord when you are rightly seated thereon and say, 'Sanctity is to Him Who has subjected this carriage to us and this was not controllable by our power.",
  "verse_14": "And undoubtedly, We are to return to our Lord.",
  "verse_15": "And they have appointed for Him a portion of His bondmen. Undoubtedly, man is clearly ungrateful.",
  "verse_16": "Has He taken for Him daughters of His Creations and has chosen you with sons?",
  "verse_17": "And when any of them is given the glad tidings of that whose worth he has already described for the Most Affectionate, his face remains darkened the entire day and he endures grief.",
  "verse_18": "And what! One who is reared in ornaments, and speaks not clearly in altercation?",
  "verse_19": "And they have appointed the angles who are bondmen of the Most Affectionate, females. Were they present at the time of their creation? Now their evidence shall be recorded and they shall be questioned.",
  "verse_20": "And they said, ‘Had the Most Affectionate so willed, we would not have worshipped them? They know nothing about is reality, they are only guessing.",
  "verse_21": "Or have We given any Book to them before this to which they hold?",
  "verse_22": "But rather they said, 'We found our forefathers on one religion and we are going on their footsteps'.",
  "verse_23": "And likewise when We sent any warner in any city before you, the affluent thereof said, 'indeed we found our forefathers on one religion and we are following their footsteps.'",
  "verse_24": "The Prophet said, ‘and what! Even though I may bring to you a better guidance than you found your fathers upon? ‘They said, 'we deny that you are sent with?'",
  "verse_25": "Therefore We took vengeance upon them. Behold then, how was the end of the beliers?",
  "verse_26": "And when Ibrahim said to his father and his people, 'I am quit of what you worship?",
  "verse_27": "'Except Him Who created me, and He will necessarily, guide me soon.'",
  "verse_28": "And he let the word remain in his posterity that haply they may desist.",
  "verse_29": "But rather I gave them and their fathers worldly enjoyments, until there came to them the truth and a Messenger explaining clearly.",
  "verse_30": "And when the truth came to them, they said, 'this is a magic, and we are denier of it.'",
  "verse_31": "And they said, 'why has not this Quran sent down upon any great man of the two cities?",
  "verse_32": "Do they distribute the mercy of your Lord? We have distributed their livelihood among them in the life of the world and have raised some of them over others in degrees that in between them one may laugh at the other. And the mercy of your Lord is better than that they amass.",
  "verse_33": "And had it not been that all mankind would become of the same faith, We would have surely made for those who disbelieve in the All Affectionate, roofs of silver for their houses and stairs whereon they ascend.",
  "verse_34": "And for their houses silver doors and silver couches upon which they recline.",
  "verse_35": "And various types of adornments. And all this is, it is only a provision of the life of this world. And the Hereafter with your Lord is for the God-fearing.",
  "verse_36": "And whoso blinds himself from the remembrance of the All- Affectionate We assign to him a devil that he may remain his companion.",
  "verse_37": "And undoubtedly, the devil hinder them from the way and they imagine that they are rightly guided.",
  "verse_38": "Until when the infidels will come to-Us, he will say to his devil, Ah! Would there had been between me and you a distance of east and west! What an evil companion is he!",
  "verse_39": "And you shall never be benefitted by it today, since you have done wrong that you all are associated in the torment.",
  "verse_40": "Will you then make the deaf to hear, or will you guide the blind and those who are in clear error?",
  "verse_41": "And even though We take you away, We shall surely take vengeance on them.",
  "verse_42": "Or We show you that We promised them for We have great power.",
  "verse_43": "Therefore hold you fast to that which has been revealed to you. Undoubtedly, you are on the straight path.",
  "verse_44": "And undoubtedly, it (The Quran) is an eminence for you and for your people, and soon you will be questioned.",
  "verse_45": "And ask those of Our Messengers whom We sent before you, 'Did We appoint some other Gods besides the All- Affectionate to be worshipped'?",
  "verse_46": "And undoubtedly, We sent Musa with Our signs to Firawn and his chiefs, and he said, 'undoubtedly, I am the Messenger of Him Who is the Lord of the entire world.'",
  "verse_47": "Then when he brought Our signs to them, hence they began to laugh at them.",
  "verse_48": "And We showed them no signs but it was greater than its previous one and We seized them in misery in order that they may desist.",
  "verse_49": "And they said, 'O magician! Pray your Lord for us because of His covenant which is with you, undoubtedly, we shall come to guidance.'",
  "verse_50": "Then when We removed from them the misery henceforth they broke the covenant.",
  "verse_51": "And Firawn proclaimed among his people, 'O my people! Is not the Kingdom of Egypt for me and these streams that flow beneath me? Do you not then see?",
  "verse_52": "Or am I better than this man who is contemptible and seems not to be clear in speech?",
  "verse_53": "'Why not, then, bracelets of gold have been bestowed on him or angels come along with him that they may remain with him?'",
  "verse_54": "Then he be fooled his people and they obeyed him. Undoubtedly, they were the people disobedient.",
  "verse_55": "Then when they did that upon which Our anger came on them, We took vengeance on them and We drowned them all.",
  "verse_56": "And We made them a story of the past and an example for the coming generations.",
  "verse_57": "And when the example of the son of Maryam is narrated, henceforth your people begin to laugh thereat.",
  "verse_58": "And say, ‘are our Gods better or he? They said not this to you but for quarreling in vain. Nay, but they are a people quarrelsome.",
  "verse_59": "He was not but a bondman whom We favored and made him a strange example for the children of Israel.",
  "verse_60": "And if We wished We would have peopled angels in the earth in place of you.",
  "verse_61": "And undoubtedly, Isa is the news of the Hour, therefore never doubt about the Hour and follow Me. This is the straight path.",
  "verse_62": "And let never the devil hinder you. Undoubtedly, he is your manifest enemy.",
  "verse_63": "And when Isa brought bright signs, he said, 'I have come to you with wisdom and in order to make clear to you some of that wherein you differ, therefore fear Allah and obey my command.'",
  "verse_64": "Undoubtedly, Allah is my Lord and is your Lord, therefore, worship Him. This is the straight path.",
  "verse_65": "But the parties differed among themselves. Therefore woe is to those who are unjust because of the torment of a painful day.",
  "verse_66": "What they are waiting for, but for the Hour that it should come upon them of a sudden while they know not?",
  "verse_67": "Fast friends shall be foes to one another on that day but the God-fearing.",
  "verse_68": "It will be said to them, O My Bondmen! There is no fear for you this day nor shall you grieve.",
  "verse_69": "Those who believed in Our signs and were Muslims.",
  "verse_70": "Enter you the Paradise, you and your wives joyfully and honorably.",
  "verse_71": "There shall be passed around them the cups of gold and goblets and therein shall be whatsoever soul desires and eyes delight in, and therein you shall remain forever.",
  "verse_72": "And this is Paradise to which you have been made heirs because of your actions.",
  "verse_73": "Therein you have abundant fruits that you may eat.",
  "verse_74": "Undoubtedly, the culprits are to abide for ever in the torment of the Hell.",
  "verse_75": "That shall never be abated from them and they shall remain there dispaired.",
  "verse_76": "And We wronged them nothing, yes, they were themselves unjust.",
  "verse_77": "They will call, 'O master! 'let your Lord finish with us'. He shall say, 'you are to stay.'",
  "verse_78": "Undoubtedly, We brought you the truth but the truth is offensive to most of you.",
  "verse_79": "Have they determined any affair in their opinion, then We are to determine Our affair?",
  "verse_80": "Do they think that We hear not their secrets and their private counsels? Yes, why not and Our angels are writing presents with them.",
  "verse_81": "Say you, 'If the worst comes to the worst there had been a son to the Most Affectionate, I would have worshipped first.'",
  "verse_82": "Sanctity is to Allah, the Lord of the heavens and the earth, the Lord of the Throne from all those things which they fabricate.",
  "verse_83": "So leave them that they may talk nonsense and play until they encounter that day of theirs which they are promised.",
  "verse_84": "And He is the God of the people of heaven, and God of the people of earth. And He is the Wise, the Knowing.",
  "verse_85": "And Blessed is He for whom is the Kingdom of the heavens and the earth and whatever is in between and He has the knowledge of the Hour and you are to return to Him.",
  "verse_86": "And those whom they worship besides Allah have no power of intercession, yes, those who bear witness to the truth and know have the power of intercession.",
  "verse_87": "If you ask them who created them, they will necessarily say, Allah, then whither they are turning away.",
  "verse_88": "And by the saying of the Messenger, O My Lord, they do not believe.",
  "verse_89": "Therefore overlook them and say, peace: soon they shall know." },
    "count": 89
}
