{
    "name": "al-Mai'dah",
    "index": "005",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O believers! Fulfil your promises. Lawful are made to you the animals having no speaking power, save those which shall be narrated to you further, but do not consider the hunting being lawful when you are in pilgrim garb. Undoubtedly, Allah commands what He wills.",
        "verse_2": "O believers! Do not make lawful the symbols of Allah, and nor the sacred months, and nor the sacrifices sent to the Sacred House (Haram), and nor those bearing signs in their necks, and nor the property and honor of those who repair to the sacred House, seeking the grace and pleasure of their Lord. And when you put off the pilgrim's garb, then you may hunt. And let not the enmity of any people as they had prevented you from the Sacred Mosque incite you to commit excessiveness. And help each other in righteousness and piety, and help not one another in sin and transgression and remain fearing Allah. Undoubtedly, the torment of Allah is severe.",
        "verse_3": "You are forbidden (to eat) the dead and blood and the flesh of swine and that on which any name has been invoked other than Allah at the time of slaughtering and that which dies by strangling and that which is beaten to death by anything unsharped and that died of falling and that is gored and that which has been eaten by any wild animal, but those which you have properly slaughtered and that which has been slaughtered at any altar and the division by casting lots with arrows. This is an act of sin. This day the infidels are despaired of your religion, then fear them not, but fear Me. This day I have perfected your religion for you and completed My favor upon you and have chosen Islam as religion for you. But whoso is forced by extreme hunger, thirst without inclining towards sin, then undoubtedly, Allah is Forgiving, Merciful.",
        "verse_4": "They ask you O beloved Prophet! what has been made lawful to them, say you, 'good and pure things have been made lawful to you and what hunting animals you have trained for hunting, teaching them of what Allah has taught you, then eat of what they leave for you after hunting and pronounce the name of Allah over it, and remain fearing Allah. Undoubtedly, Allah is Swift in taking account.",
        "verse_5": "This day all good and pure things are made lawful for you and the food of the people of the Book is lawful for you, and your food is lawful for them and chaste Muslim women and chaste women from amongst those who were given the Book before you, when you give them their dowries while bringing them in bondage (through marriage) nor for lust and nor making lover (secretly). And whoso becomes infidel after being a Muslim, his entire work is destroyed and he is a loser in the Hereafter.",
        "verse_6": "O believers! When you wish to stand for prayer, then wash your faces and your hands up to the elbows and pass your wet hands over your heads and wash your feet up to the ankles. And if you are in need of a bath, then purify yourselves well. And if you are ill or you are on a journey, or any of you comes from the privy or you have intercourse with women and in these conditions you do not get water, then betake yourselves to clean earth and wipe therewith your faces and your hands. Allah desires not that He should place you in any difficulty; yes, He desires to purify you well and to complete His favor upon you so that you may be grateful.",
        "verse_7": "And remember Allah's favor upon you and the covenant which He made with you, when you said, \"we heard and obeyed,\" and fear Allah. Undoubtedly, Allah knows the thoughts in your hearts.",
        "verse_8": "O believers! Stand up firmly by the Commandment of Allah, bearing witness with justice and let not the enmity of any people incite you that you should not do justice. Do justice that is nearer to piety and fear Allah, Undoubtedly, Allah is Aware of your doings.",
        "verse_9": "Allah has promised to the believers and those who do good deeds that for them is forgiveness and a great reward.",
        "verse_10": "And those who committed infidelity and belied Our signs, they are the people of Hell.",
        "verse_11": "O believers! Remember the favor of Allah upon you when a people intended to stretch out their hands against you, then He withheld their hands from you and fear Allah. And on Allah only should the Muslims rely.",
        "verse_12": "And undoubtedly, Allah took covenant from children of Israel, and We raised among them twelve chieftains. And Allah said, 'undoubtedly, I am with you, necessarily, if you establish prayer, and pay the poor-due (Zakat) and believe in My Messengers and pay them respect and lend Allah a goodly loan, undoubtedly, I shall remove your sins and surely shall cause you to enter into the Gardens beneath which flow rivers, then after that whoso of you commit infidelity, necessarily, he strayed away from the right path.",
        "verse_13": "Then because of breaking their covenant, how We cursed them and made their hearts hard. They change the words of Allah from their places and have forgotten a good portion of those admonitions which were given to them, and you shall always continue to be told of one or the other of their treachery, save a few of them, so pardon them, and overlook them. Undoubtedly Allah loves the benefactors.",
        "verse_14": "And those who claimed that \"we are Christians,\" We took covenant from them, they too have forgotten a good portion of those admonitions which were given to them, so We have caused enmity and hatred among themselves till the Day of Judgement. And soon Allah will tell them, what they used to do.",
        "verse_15": "O people of the Book! Undoubtedly, Our Messenger has come to you who makes clear to you much of that which you had hidden in the Book and pardons much. Undoubtedly, there has come to you from Allah a light and a Book, luminous.",
        "verse_16": "Allah guides therewith him who followed His pleasure into the ways of peace and carries them to light from the darkness by His Command and shows them right path.",
        "verse_17": "Undoubtedly, they have become infidels who said, 'Messiah son of Maryam is the very Allah himself.' Say you, \"who then can do anything against Allah if He desires to destroy Messih son of Maryam and his mother and everyone on earth'. And to Allah belongs the kingdom of heavens and earth and all that is between them. He creates what He pleases. And Allah can do everything.",
        "verse_18": "And the Jews and Christians said 'We are sons of Allah and His dear ones'. Say you, 'why then does? He torment you for your sins'? But you are human beings of His creations. He forgives whom He pleases and punishes whom He pleases. And to Allah belongs the kingdom of heavens and earth and all that is between them, and towards Him is the return.'",
        "verse_19": "O people of the Book! undoubtedly, there has come to you Our this Messenger who makes clear to you Our Commands, after a break of the coming of Messengers for a long time, lest you say, 'there came not to us any bearer of glad tidings or warner, then now there has come to you a bearer of glad tidings and warner. And Allah is Potent over everything.",
        "verse_20": "And when Moses said to his people, 'O my people! Remember the favor of Allah upon you that He made amongst you Messengers and made you kings, and gave you that which He gave not this day to anyone in all the worlds.",
        "verse_21": "'O my people! Enter this holy land which Allah has written for you and turn not back, for you will turn in loss.'",
        "verse_22": "They said, 'O Moses! Therein there are most powerful people, and we shall never enter it until they go forth from it, yes, if they go forth from there, then we shall go there.'",
        "verse_23": "Two men of those who feared Allah whom Allah had favored said, 'enter the gate forcibly against them, if you enter the gate, then there is only your victory, and put your trust in Allah only, if you believe.'",
        "verse_24": "They said, 'O Moses! We shall never go there until they are there, then go forth you and your Lord and you both fight, we are sitting here'.",
        "verse_25": "Moses submitted, 'O my Lord! I have no control over any but myself and my brother, then you, keep us separate from these disobedient.'",
        "verse_26": "Allah said, 'then that land is forbidden to them for forty years, let them wander in the land, therefore grieve not over these disobedient.'",
        "verse_27": "And narrate you to them the true news of the two sons of Adam, when they each offered an offering, then it was accepted from one and was not accepted from the other. He said, 'I swear that I shall kill you’. The other said, 'Allah accepts only from God-fearing'.",
        "verse_28": "'Undoubtedly, if you shall stretch your hand against me to kill me, then I shall not stretch my hand against you to kill you, I fear Allah, the Lord of all the Worlds.",
      "verse_29": "'I wish that my sin as well as your sin both should go to your side, so that you may be the man of Hell and this is the punishment of the unjust.",
  "verse_30": "Then his soul induced him to kill his brother, so he killed him and remained in losers.",
  "verse_31": "Then Allah sent a raven, scratching in the earth, so that he might show him, how he should hide the corpse of his brother. He said, 'Oh woe is me! I could not be able even like this raven so that I may hide the corpse of my brother.' Then he remained repenting.",
  "verse_32": "On account of this, We wrote for the children of Israel that whosoever killed a soul not to retaliate for a soul, or for creating disorder in the land, then it is as if he had killed all mankind. And whoso gave life to one soul, then it is as if he had given life to all mankind. And undoubtedly, Our Messengers came to them with clear proofs, then undoubtedly, many of them after that commit excesses in the land.",
  "verse_33": "The only recompense of those who fight against Allah and His Messenger and wander about in the land making mischief is this, that they all should be slain or be crucified or their hands of one side and the feet of the other side be cut off or be sent far away from the land. This is their disgrace in the world and in the Hereafter, for them there is great torment.",
  "verse_34": "But those who repented before you have control over them, then know that Allah is Forgiving, Merciful.",
  "verse_35": "O believers! Fear Allah and seek the means of approach to Him and strive in His way, haply you may get prosperity.",
  "verse_36": "Undoubtedly, those who became infidels, possessed all that is in the earth and as much over again to ransom themselves thereby from the torment of the Day of Judgement, it shall not be accepted from them and for them is the painful torment.",
  "verse_37": "They will wish to come out of the Hell, but they will not be able to come out of it, and for them is the lasting punishment.",
  "verse_38": "And whoso the man or the woman is a thief, then, cut off their hands, the recompense for what they have done, a punishment from Allah. And Allah is Dominant, Wise.",
  "verse_39": "Then whoso repents after his injustice and amends then Allah will turn to him with His Mercy. Undoubtedly, Allah is Forgiving, Merciful.",
  "verse_40": "Do you not know that to Allah belongs the Kingdom of heavens and earth? He punishes whom He pleases and forgives whom He pleases, And Allah can do everything.",
  "verse_41": "O Messenger! let not those who run towards infidelity grieve you, some of those who say with their mouths, we have accepted faith, and their hearts are not Muslims, and some of the Jews who listen falsehood very well and listen very well to other people who have not come to you. They change the words of Allah from their places, and say, 'if you get this command, then accept it, and if you get not this, then be on your guard.' And to whom Allah pleases to misguide, then you shall never be able to avail him anything against Allah. These are they whose hearts Allah intended not to purify. To them there is disgrace in the world, and to them there is great torment in the Hereafter.",
  "verse_42": "They are habitual listeners of lies, great devourers of the things forbidden. So if they come to you, then judge between them or turn your face from them; and if you will turn your face from them, they shall not harm you at all. And if you judge between them, then judge with justice. Undoubtedly, Allah likes the just.",
  "verse_43": "And how they will wish judgement from you while they have Taurah with them wherein is Allah's judgement then thereafter they turn away their faces from it. And they are not to believe.",
  "verse_44": "Undoubtedly, We have sent down Taurah, wherein is the guidance and light. According to it the Jews were ordered by Our obedient Prophets and men of learning and jurists for it was desired from them to preserve the Book of Allah and they were witnesses to it, then fear not people, but fear Me and do not accept mean price for My Signs. And whoso judges not according to what Allah has sent down, they are the persons who are infidels.",
  "verse_45": "And We made obligatory on them in Taurah, a life for a life, and an eye for an eye, and a nose for a nose and an ear for an ear and a tooth for a tooth, and in injuries there is equitable retaliation. Then whoso recompenses with happy heart, then that shall be an expiation for his sin. And whoso judges not according to what Allah has sent down, then they are the persons unjust.",
  "verse_46": "And We brought Isa son of Maryam following those Prophets on their footsteps, confirming Taurah that had come before him, and We gave him Injeel wherein is guidance and light and confirms Taurah that had come before it, and guidance and admonition to the duty- bound.",
  "verse_47": "And let the people of Injeel judge by what Allah has revealed in it, and whoso judges not by what Allah has sent down, then it is they who are the transgressors.",
  "verse_48": "And O beloved Prophet! We have sent down to you the true Book confirming the Books preceding it and as a protector and witness over them. So judge you between them according to what Allah has sent down, and O listener! do not follow their desires leaving the truth that has come to you, We ordained a law and way each for all of you, and if Allah had willed, He would have made you all a single people, but He desires to test you in what He has given you. So desire to excel in good deeds. You are all to return towards Allah only, then He shall tell you regarding what you used to dispute.",
  "verse_49": "And that O Muslim! Judge according to what Allah has sent down and follow not their desires and be on guard against them lest they cause to slip you from any command that has come to you. Then if they turn their faces, then know that Allah wishes to give them punishment for some of their sins. And no doubt, many men are disobedient.",
  "verse_50": "Do they seek the judgement of the days of ignorance? And who is better in judgement than Allah for a people of firm faith?",
  "verse_51": "O believers! Do not take the Jews and Christians as friends, they are friends of each other among themselves, and whoso of you makes them his friends, then he is one of them. Undoubtedly, Allah guides not the people unjust.",
  "verse_52": "Now, you will see those in whose hearts is a disease run towards the Jews and Christians, saying, 'We fear lest a misfortune befall us.' Then it is near that Allah may bring a victory, or any Commandment from Himself, then they will remain regretting on what they had concealed in their hearts.",
  "verse_53": "And the believers say, 'are they the same who swore by Allah in their Oaths with full strength that they were with you'? Their works were all destroyed, then they were left in loss.",
  "verse_54": "O believers! Whoso of you will turn back from his religion, then soon Allah shall bring such people that they will be dear to Allah and Allah will be dear to them, humble towards the Muslims, and stern towards the infidels. They will fight in the way of Allah and will not fear the reproach of any reproached. This is the bounty of Allah, He gives it whom He pleases. And Allah is Ail-Embracing, All Knowing.",
  "verse_55": "Only Allah is your friend and His Messenger and the believers that they establish the prayer and pay the poor-due and are bowed down before Allah.",
  "verse_56": "And whoso takes Allah and His Messenger and Muslims as his friends, then undoubtedly, the party of Allah only is dominant.",
  "verse_57": "O believers! Do not take any of them as your friend who has made your religion a mockery and a plaything those who were given the Book before you and the infidels, and remain fearing Allah if you believe.",
  "verse_58": "And when you call for prayer, they make it a mockery and a plaything. That is because they are wholly unwise people.",
  "verse_59": "Say you O people of the Book! What seemed you bad of us, only this that we believed in Allah and what has been sent down to us and what was sent down before, and that most of you are disobedient.",
  "verse_60": "Say you, 'shall I tell you about those who are in a worse condition with Allah than this? Those whom Allah has cursed and on them has caused anger and of whom He has made apes and swine’s and worshippers of devil (Satan).Their destination is worse and they are a strayed farther from the right path.",
  "verse_61": "And when they come to you, they say, 'We are Muslims,' while they were infidels when they came and infidels too when they departed. And Allah knows well what they are concealing.",
  "verse_62": "And you will see many of them run towards sin and transgression and eating what is forbidden. Undoubtedly, they are practicing very evil things.",
  "verse_63": "Why their clergymen and priests do not forbid them from uttering sinful words and eating of things forbidden? Undoubtedly, they are performing very evil things.",
  "verse_64": "And the Jews have said, 'The hand of Allah is tied up. Their own hands be tied up and there be curse of Allah on them for their utterings, but His hands are wide open, He gives how He pleases. And O beloved Prophet! What has been sent down to you from your Lord will increase many of them in wickedness and infidelity. And We have cast among them enmity and hatred till the Day of Judgement. Whenever they kindle the fire of war, Allah extinguishes it, and run about in the land for mischief. And Allah loves not the mischief-mongers.",
  "verse_65": "And had the people of the Book believed and been duty- bound, then indeed We would have removed their sins and We would surely have caused them to enter gardens of Bliss.",
  "verse_66": "And had they maintained Taurah and Injeel and what has been sent down to them from their Lord, then they would have received subsistence from above and from beneath their feet. A party among them is moderate and most of them are doing most evil things.",
  "verse_67": "O Messenger! Communicate that which has been sent down to you from your Lord. And if it is not so, then you have not conveyed His any message. And Allah will guard you from the people. Undoubtedly, Allah gives not way to the infidels.",
  "verse_68": "Say you, 'O people of the Book! You are nothing until you establish Taurah and Injeel and what has been sent down to you from your Lord. And undoubtedly, O beloved Prophet! What has been sent down to you from your Lord will increase many of them in wickedness and infidelity, then grieve not for the infidels.",
  "verse_69": "Undoubtedly, those who call themselves Muslims and in the same way the Jews and worshippers of stars and Christians, whoso of them believes with true heart in Allah and the Last Day and works good, then on them neither there is any fear nor any grief.",
  "verse_70": "Undoubtedly, We took a covenant from the children of Israel, and We sent Messengers to them. Whenever any Messenger came with those things which their soul did not desire, they belied a party (of them) and another they slay.",
  "verse_71": "And they imagine that there shall be no punishment (for them), then they became blind and deaf, then again Allah accepted their repentance, yet again most of them became blind and deaf. And Allah is seeing their works.",
  "verse_72": "Undoubtedly, those are infidels who say, \"Masih son of Maryam is the very Allah'. And whereas Masih had said 'O children of Israil! Worship Allah, my Lord and your Lord; undoubtedly, whoso associates anyone with Allah, then Allah has forbidden paradise to him and his abode is Hell. And there is no helper of unjust.'",
  "verse_73": "Undoubtedly, those are infidels who say, 'Allah is third of the three Gods; and there is no God but the One God. And if they desist not from what they say, then a painful torment shall surely befall to those who will die infidels.",
  "verse_74": "Then why they do not turn towards Allah and ask His forgiveness? And Allah is Forgiving, Merciful.",
  "verse_75": "The Messih son of Mary was not but a Messenger, many Messengers passed away before him. And his mother is a truthful woman. Both used to take food. See how clear signs We explain for them, then see how they are turned away.",
  "verse_76": "Say you, 'Do you worship, besides Allah that which is neither master of your loss nor of profit. And Allah is the Hearing, the Knowing.",
  "verse_77": "Say you, 'O people of the Book! exceed not the limits in your religion unjustly, and follow not the desires of a people who have already gone astray and caused many to go astray and have strayed away from the right path.'",
  "verse_78": "Cursed were those who committed infidelity from amongst the children of Israel by the tongue of Daud and Isa son of Maryam. This reward because of their disobedience and transgression.",
  "verse_79": "Whatever bad they did, they did not prohibit one another among themselves. Necessarily, they used to do most evil things.",
  "verse_80": "You will see many of them befriend infidels. What an evil thing they have sent forth for themselves that Allah's Wrath fell upon them and they shall dwell in torment forever.",
  "verse_81": "And if they had believed in Allah and this Prophet and what has been sent down to him, then they would not have taken the infidels as friends, but many of them are disobedient.",
  "verse_82": "You shall surely find the Jews and polytheists the bitterest enemies of Muslims, and surely you shall find the nearest in friendship to Muslims those who used to say, \"We are Christians,\" That is because among them are men of learning and monks and they are not proud.",
  "verse_83": "And when they hear what has been sent down towards the Messenger, then see, their eyes are overflowing with tears because they have recognized the truth; they say, 'O Our Lord we have accepted faith, then write us down among the witnesses of truth.",
  "verse_84": "And what happened to us that we should not have faith in Allah and the truth that has come to us and we long that our Lord would cause us to enter with the righteous people.",
  "verse_85": "Therefore Allah on account of what they said gave them gardens beneath which rivers flow, they will abide therein. This is the recompense of the righteous.",
  "verse_86": "And those who committed infidelity and belied Our signs are the people of Hell.",
  "verse_87": "O believers! Make not unlawful the pure things which Allah has made lawful for you and cross not the limit. Undoubtedly, Allah likes not those who cross the limit.",
  "verse_88": "And eat what Allah has provided you lawful and pure. And fear Allah in Whom you believe.",
  "verse_89": "Allah holds not you responsible for oaths taken by misunderstanding, but He holds You responsible for oaths which you made binding, then the expiation of such oaths is the feeding of ten needy people with average food with which you feed your family members, or clothing them or the freeing of a slave, then who-so finds not anything of these, then for him is the fasting of three days. This is the expiation of your oaths when you have sworn. And guard your oaths. Similarly Allah explains His signs to you so that you may be grateful.",
  "verse_90": "O believers! Wine and gambling and idols and divining arrows are only unclean things, a work of devil (Satan) then save yourselves from them, so that you may prosper.",
  "verse_91": "The devil (Satan) desires only to put hatred and enmity among you in regard to wine and gambling and to bar you from the remembrance of Allah and from prayer, will you then desist?",
  "verse_92": "And obey Allah and obey the Messenger and be careful, then if you turn back, know then that the responsibility over Our Messenger is only to deliver the message clearly.",
  "verse_93": "On those who believed and did righteous work there is no sin for what they have eaten when they fear and keep faith and do righteous work, again fear and keep faith, then again fear and remain righteous. And Allah loves the righteous.",
  "verse_94": "O believers! Allah shall surely test you with some such game which your hands and lances may reach in order that Allah may make known those who fear Him without seeing, then after this whoso crosses the limit, for him is a painful punishment.",
  "verse_95": "O believers! Kill not game while you are in a pilgrim garb. And whoso amongst you kills it intentionally, then his compensation is that he should give a like animal from amongst the cattle as judged by two just persons among you, this offering reaching to the Ka'bah, or as an expiation, feeding of some needy persons or its equivalent fasting, so that he may taste the enormity of his deed. Allah has pardoned what happened in the past. And whoso will do now Allah will take retribution from him. And Allah is Dominant, Lord of Retribution.",
  "verse_96": "Lawful is to you the game of the sea and its eating for the benefit of you and the travelers and forbidden to you is the game of the land, so long you are in pilgrim garb. And fear Allah towards Whom you are to rise",
  "verse_97": "Allah made Kaaba the sacred House as an establishment for the people, and so the sacred month and the offerings of the sacred House and the animals with the marks hanging in the neck. That is so that you may believe that Allah knows what is in the heavens and what is in the earth and that Allah knows everything.",
  "verse_98": "Know that the torment of Allah is severe and Allah is Forgiving, Merciful.",
  "verse_99": "Nothing is on the Messenger but communicating the Message. And Allah knows what you disclose and what you hide.",
  "verse_100": "Say you, 'the dirty and clean are not equal, even though the abundance of the dirty may please you, then remain fearing Allah, O men of understanding! So that you may get prosperity.",
  "verse_101": "O believers! Ask not such things which if disclose to you may displease you; and if you will ask while the Quran is descending, then they would be disclosed to you. Allah has already pardoned them. And Allah is Forgiving, Forbearing.",
  "verse_102": "A people before you asked them, then became rejecters therein.",
  "verse_103": "Allah has not appointed any 'Bahira' and nor 'Sai-ba' and nor 'Wasila' and nor 'Hami' (names of sacred animals she camels and she-goats of the time of Pagans) but yes, the infidels fabricate the lie against Allah. And most of them are perfectly unwise.",
  "verse_104": "And when it is said to them, 'come to what Allah has sent down and to the Messenger', they say,' enough for us is that wherein we found, our fathers; what! Even though their fathers knew nothing nor were guided.",
  "verse_105": "O believers! Take care of yourselves. He who has gone astray will not harm you when you are on the right way. Towards only Allah is the return of you all, then He will tell you what you used to do.",
  "verse_106": "O believers! the evidence among yourselves when death approaches any of you at the time of making a will is of two just persons from among you or two of the others, when you be on journey in the land, and the calamity of death befall you, Detain them both after prayer, they should swear by Allah if you are in any doubt, that we shall not purchase any wealth in exchange of the oath, even though he may be a near relation, and will not hide the testimony of Allah if we do so, we are surely among the sinners.",
  "verse_107": "Then if it is known that they became guilty of any sin, then two other should stand in their place from amongst those nearer to the deceased whose right has been injured by this sin (by this false evidence), then they should swear by Allah that our evidence is more upright than the evidence of those two, and we crossed not the limit, if it be so, then we should be of the unjust.",
  "verse_108": "It is nearer that they may give the evidence as it should be or fear that some oaths may be rebutted after their oaths. And fear Allah and listen to His commands. And Allah gives not the way to the disobedient.",
  "verse_109": "The day when Allah will gather the Messengers, then will say, 'what answer was made to you,' they will submit, 'We have no knowledge, it is You only the Knower of all things unseen.",
  "verse_110": "When Allah will say, 'O Isa son of Maryam, remember My favor upon you and your mother, when I aided you with the Holy Spirit, then you spoke to people in the cradle and in the grown up age, and when I taught you the Book and wisdon and Taurah and Injeel, and when you used to make of clay a figure like a bird by My command, then you breathe into it, then it would begin to fly by my command, and you would cure the born blind and the leper by My command, and when you would bring forth alive the dead by My command, and when I restrained the children of Israel from you, when you came to them taking clear signs, then the infidels of them spoke, 'this is nothing but an open magic.",
  "verse_111": "And when I inspired the disciples to believe in Me and in My Messenger, they said, 'We have believed, and bear you witness that we are Muslims.'",
  "verse_112": "When the disciples said, 'O Isa son of Maryam, will your Lord do that He should sent us down a tray of food from the heaven? He said, 'fear Allah if you have faith.'",
  "verse_113": "They said, 'we wish that we may eat of it and our hearts may be satisfied and we may see with our own eyes that you spoke truth to us, and we may be witnesses thereof.'",
  "verse_114": "Isa son of Maryam submitted, 'O Allah our Lord, 'send down to us a tray of food from the heaven so that it may be an occasion of rejoicing for us, for the first and the last of us and a sign from You, and provide for us and You are the Best of Providers.",
  "verse_115": "Allah said, 'I send it down to you, now therefore whoso of you will commit infidelity, then undoubtedly. I shall torment him with a torment wherewith I shall not punish to anyone in the entire universe.",
  "verse_116": "And when Allah will say, 'O Isa son of Maryam, did you tell people, 'make me and my mother two gods besides Allah? He will submit, 'hallowed be You, it is not justified for me that I should tell the thing to which I have no reach. 'If I had said that You would surely have known it, You know what is in my heart and I do not know what is in Your knowledge. Undoubtedly, it is You only, Knower of all hidden things.",
  "verse_117": "I said not to them but that which You had commanded me that worship Allah my Lord and your Lord, and I knew of them as long as I remained in them, then when You took me up, then You were the Watcher over them, and everything is present before You.",
  "verse_118": "If You punish them, they are Your bondmen, and if You forgive them, then undoubtedly, You are only the Dominant, the Wise.",
  "verse_119": "Allah said, 'this is the day in which their truthfulness will benefit the truthful, for them are Gardens beneath which rivers flow, they shall abide therein forever. Allah is pleased with them and they are pleased with Allah. This is the great success.",
  "verse_120": "For Allah is the kingdom of the heavens and earth and whatever is in them. And He is Potent over everything."
 },
    "count": 120
}
