{
    "name": "al-Hajj",
    "index": "022",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O people! Fear your Lord, undoubtedly, the tremor of the Hour is a thing very hard.",
        "verse_2": "The Day when you would see it, every suckling woman shall forget her infant whom she suckled, and every pregnant shall cast away her burden, and you will see men as they are drunk and they will not be drunk, but the torment of Allah is severe.",
        "verse_3": "And there are some who dispute about Allah without knowledge, and follow every rebellious devil.",
        "verse_4": "For whom it has been written that who will befriend him, then he will necessarily misguide him and will guide him towards the torment of Hell.",
        "verse_5": "O people! if you have any doubt about the Resurrection, then consider that We created you from dust, then from a drop of water (Sperm), then from the clot of blood, then from a piece of flesh fashioned and unfashioned, so that We may manifest to you Our Signs. And We cause whom We will to remain in the womb of mothers till an appointed time, then We bring you out as infant, then in order that you may reach your maturity, and of you is one who dies early and is one who is put to a worthless age so that after knowing knows nothing. And you see the earth withered up then when We sent down water upon it, it was freshened and swelled up and grew every beauteous pair.",
        "verse_6": "This is so because only Allah is the Truth and that it is He Who will give life to the dead and that He can do all things.",
        "verse_7": "And because the Hour is to come, there is no doubt in it and because Allah will raise those who are in the graves.",
        "verse_8": "And of mankind is he who disputes about Allah without having any knowledge and without any guidance and without any enlightening Book.",
        "verse_9": "Turning his neck from truth so that he may mislead others from the path of Allah. For him there is humiliation in the world; and on the Day of Judgement, We shall make him taste the torment of burning.",
        "verse_10": "This is because of what your hands sent forth and Allah oppresses not His bondmen.",
        "verse_11": "And some men worship Allah on an edge, then if any good reaches him, then he is content therewith and if trial befalls, turn round on his face; there is loss of the world and the Hereafter both. This is a manifest loss.",
        "verse_12": "They worship besides Allah such that which can neither do bad nor good to them. This is indeed straying afar.",
        "verse_13": "They worship such that whose harm is more expected than his benefit. No doubt, what an evil patron and no doubt what an evil comrade!",
        "verse_14": "Undoubtedly, Allah will cause those who believed and did good deeds to enter Gardens beneath which rivers flow. No doubt, Allah does what He will.",
        "verse_15": "Whosoever imagines that Allah will not help His Prophet in the world and the Hereafter, let him stretch a rope upward and let him hang himself, then let him see whether his device took away that for which his heart is burning.",
        "verse_16": "And thus We have sent down this Quran as manifest signs and that Allah guides whom He will.",
        "verse_17": "Undoubtedly, Muslims and Jews and the Sabians and Christians and the Magians and the polytheists, verily Allah will judge between them on the Day of Judgement. Undoubtedly, everything is before Allah.",
        "verse_18": "Have you not seen that to Allah prostrates whosoever is in the heavens and in the earth, and the sun, and the moon, and the stars, and the mountains, and the trees, and the beasts, and many of mankind? And many are those upon whom the torment is already justified. And whomsoever Allah disgraces, none is there to give him honor. Undoubtedly, Allah does what He pleases.",
        "verse_19": "These are two parties who disputed concerning their Lord. As for those who disbelieved, the garments of fire were cut out for them, and boiling water will be poured down on their heads.",
        "verse_20": "Whereby that which is in their bellies will be melted and their skins too.",
        "verse_21": "And for them are the maces of iron.",
        "verse_22": "When they will wish to get out of it due to anguish, again they will be turned back into it and it will be commanded to them, 'taste the torment of the fire.'",
        "verse_23": "No doubt, Allah will cause those who believed and did good deeds to enter Gardens beneath which streams flow, they will be made to wear bracelets of gold and pearls. And their apparel there is of silk.",
        "verse_24": "And they were guided to pure speech and were guided to the path of the All-Praiseworthy.",
        "verse_25": "Undoubtedly, those who disbelieved and hinder from the way of Allah and from the sacred Mosque which We have appointed equal for all, both for dwellers therein and visitors. And whoso seeks any excessiveness in it unjustly, We shall cause them to taste painful torment.",
        "verse_26": "And when We informed Abraham of the right place of the House and ordained, 'Associate not anything with Me and keep My House clean for persons making round of it and those secluding themselves in mosque for devotion and prayer and those who bow and prostrate.",
        "verse_27": "'And proclaim among people the pilgrimage. They will come to you on foot and on every lean camel coming from every distant track.",
        "verse_28": "That they may get their own benefits of it and may mention the name of Allah during the known days over the mute quadrupeds that He has provided for them. So eat yourselves thereof and feed the distressed needy.",
        "verse_29": "'Then let them cleanse their dirt and fulfil their vows and make round of the free House.'",
        "verse_30": "The thing is this, and whoso respects the sacred things of Allah, then it is good for him with his Lord. And the mute quadrupeds are made lawful to you save those whose prohibition is being rehearsed to you, then be away from the filth of the idols and avoid the word that is false.",
        "verse_31": "Being one for Allah, associate none with Him. And whoso associates anything with Allah it is as he fell down from the sky and the birds have snatched him away or the wind blows him away to a distant place.",
        "verse_32": "The thing is this and whoso respects the signs of Allah, then it is from the piety of hearts.",
        "verse_33": "For you there are benefits in quadrupeds for an appointed term, then they are to reach the Free House.",
        "verse_34": "And for every nation We appointed a sacrifice that they might mention the name of Allah over the mute quadrupeds that He has provided to them. But your God is One God, then submit to Him only and O beloved! Give glad tidings to the humble.",
        "verse_35": "That when Allah is mentioned, their hearts are filled with fear and bear whatever befalls them and they observe prayer and spend out of what We have provided for them.",
        "verse_36": "And We made the sacrificial bulky animals camel and cow among the symbols of Allah for you. In them there is good for you. So mention the name of Allah over them while standing in line with three legs and tied up with one leg, then when their sides fall down, eat thereof yourselves and feed the contented and the beggars, thus We have subjected them to you, so that you may be thankful.",
        "verse_37": "Neither their flesh reaches Allah nor their blood, but your piety reaches Him. Thus We subjected them to you that you may glorify Allah for that He has guided you. And O beloved! Give glad tidings to the righteous.",
        "verse_38": "Undoubtedly, Allah removes the calamities of Muslims. Verily, Allah loves not anyone who is treacherous and ungrateful.",
        "verse_39": "Permission is given to them with whom the infidels fight because they were oppressed. And no doubt, Allah is necessarily powerful to help them.",
        "verse_40": "Those who were driven out from their homes without right only on this pretext that they said, 'Our Lord is Allah.' And if Allah had not removed men one by means of other, then necessarily, the cloisters and churches and synagogues and mosques wherein the name of Allah is mentioned much would have been pulled down. And undoubtedly, Allah will necessarily help him who will help His religion, verily Allah is necessarily, Powerful, Dominant.",
        "verse_41": "Those, if We give them, control in the land, they would establish prayer and pay the Zakat (poor-due) and command good and forbid evil. And for Allah is the end of all affairs.",
        "verse_42": "And if they belie you, then no doubt, before them the people of Nuh and Aad and Thamud have already belied.",
        "verse_43": "And the people of Ibrahim and the people of Lut.",
        "verse_44": "And the dwellers of Madian; and Musa too was belied, then I let loose the infidels, then I seized them, so how was My torment.",
        "verse_45": "And how many towns We destroyed that they were unjust, so now they are fallen down on their roofs, and how many wells are lying neglected and how many palaces are deserted.",
        "verse_46": "Have they not travelled in the land that they should have hearts with which to understand, or ears with which to hear? Certainly it is not the eyes that are blind, but blind are the hearts, which are in the breasts.",
        "verse_47": "And they ask you to hasten the torment, and Allah shall never fail in His promise; and undoubtedly, there is with your Lord such a day like a thousand years in your reckoning.",
        "verse_48": "And how many towns that We let them loose that they were unjust, then I seized them and to Me is the return.",
        "verse_49": "Say you, 'O Mankind! I am but a clear warner to you.'",
        "verse_50": "Then those who believed and did good works for them, is forgiveness and an honorable provision.",
        "verse_51": "And those who strive in Our signs with the intention of victory and defeat, they are inmates of Hell.",
        "verse_52": "And We sent as many a Messenger or a Prophet, on all this incident has occurred sometime, that when they recited then the devil added something from his own side in their recital towards the people. But Allah removes what the devil casts forth, then Allah firmly establishes His signs. And Allah is Knowing, Wise.",
        "verse_53": "That He may make what the devil casts forth a trial for those in whose hearts is a disease and whose hearts are hardened. And undoubtedly, the oppressors are quarrelsome to the end.",
        "verse_54": "And so that those who have been given knowledge may know that it is the truth from your Lord, so they believe in it, then their hearts may submit to it, and undoubtedly, Allah guides the believers to the straight path.",
        "verse_55": "And the infidels will always remain in doubt about it, until the Hour comes on them suddenly, or there comes to them the torment of a day the fruit of which may not be good for them.",
        "verse_56": "The Kingdom on that day is of Allah's only. He will judge between them. Then those who believed and did good deeds, they are in the Gardens of comfort.",
        "verse_57": "And those who disbelieved, and belied Our signs, for them is the torment of humiliation.",
        "verse_58": "And those who left their homes, in the way of Allah, and were then slain or died, Allah will necessarily provide them with a goodly provision. And undoubtedly, the provision of Allah is the best.",
        "verse_59": "Most certainly, He will carry them to such place which they will like. And undoubtedly, Allah is Knowing, Forbearing.",
        "verse_60": "The thing is this, and whoso takes revenge the like of which he was tortured, and again he is transgressed against, then surely Allah will help him. Undoubtedly, Allah is Pardoning, Forgiving.",
        "verse_61": "And that is because, Allah causes the night to enter into the day, and causes the day to enter into the night and that Allah is Hearing, Seeing.",
        "verse_62": "And that is because Allah only is the Truth, and whosoever they worship besides Him, it is the false, and because Allah only is the High, the Great.",
        "verse_63": "Have you not seen that Allah sent down water from the sky, then in the morning ‘the earth became green? Undoubtedly, Allah is Holy, Aware.",
        "verse_64": "To Him belongs all that is in heavens and all that is in the earth. And undoubtedly, only Allah is the SelfSufficient, the Laudable.",
        "verse_65": "Have you not seen that Allah has subjected to you whatever is in the earth, and that the boat runs in the river by His command? And He has withheld the sky that it may not fall on the earth but by His command. Undoubtedly, Allah is most Loving, most Affectionate towards human beings.",
        "verse_66": "And it is He Who gave life to you, then He will cause you to die, again He will give life to you. Undoubtedly the human being is most ungrateful.",
        "verse_67": "To every nation We made principles of worship that they should observe, so they necessarily let not dispute with you in this matter; and call them towards your Lord. Undoubtedly, you are on the straight path.",
        "verse_68": "And if they dispute with you, then say, Allah knows well what you do.",
        "verse_69": "Allah will judge between you on the Day of Judgement regarding that you are differing.'",
        "verse_70": "Did you not know that Allah knows whatever is in the heavens and is in the earth? Undoubtedly, all this is in a Book. Verily this is easy for Allah.",
        "verse_71": "And they worship besides Allah that for which He has not sent down any authority and that of which they have themselves no knowledge. And for the oppressors there is no helper.",
        "verse_72": "And when Our bright signs are recited to them, then you will see symptoms of denial in the faces of those who have disbelieved. It is near that they may attack on those who recite Our signs to them. Say you, 'Shall I inform you of what is worse than of your this condition? That is the Fire. Allah has promised It to the infidels. And what is an evil place of return.'",
        "verse_73": "O people! a similitude is related, listen to it attentively. Those whom you worship besides Allah cannot make a fly though they should all gather for it. And if the fly snatch away something from them, then they cannot take it back from it. How weak is the desirer and that which was desired.",
        "verse_74": "They valued not Allah as He should be valued. Undoubtedly, Allah is Powerful, Dominant.",
        "verse_75": "Allah chooses Messengers from amongst the angels and from amongst the men. Undoubtedly, Allah is Hearing, Seeing.",
        "verse_76": "He knows what is before them and what is behind them. And the return of every affair is towards Allah.",
        "verse_77": "O believers! Bow and prostrate and worship your Lord, and do good deeds haply you may be relieved.",
        "verse_78": "And strive in the path of Allah as is due for striving. He has chosen you and has not laid upon you any narrowness in religion; the faith of your father Ibrahim. Allah has named you Muslims in earlier Books and in this Qur'an too, so that the Messenger may be your custodian and witness and that you may be witness against mankind; so establish the prayer and pay the poor due (Zakat) and hold fast the rope of Allah. He is your Protector, then what an Excellent Protector and what an Excellent Helper."
    },
    "count": 78
}
