{
    "name": "al-Muddatstsir",
    "index": "074",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O the mantled one.",
        "verse_2": "Stand up, then warn.",
        "verse_3": "And magnify your Lord alone.",
        "verse_4": "And keep clean your clothes.",
        "verse_5": "And remain away from the idols.",
        "verse_6": "And bestow not favour to anyone seeking increase.",
        "verse_7": "And be patient for the sake of your Lord.",
        "verse_8": "For when the trumpet shall be blown.",
        "verse_9": "That day is then a harsh day.",
        "verse_10": "For the infidels it is not easy.",
        "verse_11": "Leave him when I created alone to Me.",
        "verse_12": "And bestowed him ample wealth.",
        "verse_13": "And sons present before him.",
        "verse_14": "And I prepared for him numerous preparations.",
        "verse_15": "Then he covets that I may give him more.",
        "verse_16": "Never, he is hostile to Our signs.",
        "verse_17": "Soon, I shall cause him to ascend to the mountain of fire sand.",
        "verse_18": "Certainly, he reflected and determined.",
        "verse_19": "Then be he cursed, how he determined.",
        "verse_20": "Again, be he cursed, how he determined.",
        "verse_21": "Then he looked about.",
        "verse_22": "Then he frowned and scowled.",
        "verse_23": "Then he turned his back and waxed pround.",
        "verse_24": "And said, 'this is the same magic learnt from old ones.'",
        "verse_25": "'This is not but the word of man.'",
        "verse_26": "I shall soon thrust him into the Hell.",
        "verse_27": "And what did you know what the hell is?",
        "verse_28": "It leaves not and spares none.",
        "verse_29": "It takes out the skin of man.",
        "verse_30": "Over it there are nineteen guards.",
        "verse_31": "And We have not made the guards of the hell but the angels, and We have not kept their calculation but as a test of the infidels, in order that those who are men of the Book may be convinced and the faith of the believers may increase, and those who are men of the Book and the Muslims may not doubt, and that those in whose hearts is a disease and the infidels may say, \"what does, Allah mean by such a strange illustration?\" In this way Allah leads astray whom He will and He guides whom He will. And none knows the hosts of your Lord save He. And this is nothing but an admonition for man.",
        "verse_32": "Yes, by the moon.",
        "verse_33": "And the night when it retreats.",
        "verse_34": "And by the morning when it shines.",
        "verse_35": "Undoubtedly, the hell is one of the greatest things.",
        "verse_36": "A warning to man.",
        "verse_37": "For anyone of you, who wishes to advance or to fall back?",
        "verse_38": "Every soul is pledged for what it has done.",
        "verse_39": "But those on the right hand.",
        "verse_40": "In Gardens, they ask.",
        "verse_41": "From the culprits.",
        "verse_42": "What brought you into the Hell?",
        "verse_43": "They said, 'We used not to offer prayer.",
        "verse_44": "'And We used not to feed the needy ones.",
        "verse_45": "'And We used to indulge in objectionable talk with those who indulge therein.",
        "verse_46": "'And We used to belie the Day of Judgement.",
        "verse_47": "'Until! Death overtook us.'",
        "verse_48": "So the intercession of the intercessors will be of no use to them.",
        "verse_49": "Now what heppened to them that they turn their faces from admonition.",
        "verse_50": "As if they are frightened asses.",
        "verse_51": "Fleeing from a lion.",
        "verse_52": "Nay, rather every one of them wishes that he may be given open sheets of revelation.",
        "verse_53": "Never, but rather they fear not the Hereafter.",
        "verse_54": "Yes, no doubt, this is an admonition.",
        "verse_55": "So that, whoever wishes may take admonition thereof.",
        "verse_56": "And they will not accept admonition unless Allah so please. He alone is worthy to be feared and He alone is worthy for forgive."
   },
    "count": 56
}
