{
    "name": "al-'Ankabut",
    "index": "029",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif—Lam — Mim.",
        "verse_2": "Are the people proud of this thinking that they will be left alone because they say 'We believed,' and they will not be rested'?",
        "verse_3": "And undoubtedly We tested those before them, therefore Allah will necessarily see the truthful and will necessarily see the liars.",
        "verse_4": "Or those who do evil deeds have taken it for granted that they will get away from Us What an evil order they pass!",
        "verse_5": "Whosoever hopes to meet Allah, then undoubtedly, the term of Allah is necessarily to come. And He is the Hearer, the Knower.",
        "verse_6": "And whosoever struggles in the way of Allah, then he struggles for his own good. Undoubtedly, Allah is Content from the needs of the entire world.",
        "verse_7": "And those who have believed and have done good deeds. We shall necessarily remove their evils, and shall necessarily recompense them for the best work with their doings.",
        "verse_8": "We have insisted on man to be kind towards their parents. And if they strive to make you associate with Me of which you have no knowledge, then obey them not. To Me is your return, then I will inform you what you used to do.",
        "verse_9": "And those who have believed and have done good works, necessarily We shall admit them among the righteous.",
        "verse_10": "And there are some persons who say 'we have believed in Allah, 'then when they are meted with any affliction in the way of Allah, they regard the persecution of the people as equal to the torment of Allah. And if help comes from your Lord, then they shall surely say, 'We were with you'. Does Allah not know well what is in the hearts of the people of entire world?",
        "verse_11": "And surely Allah will disclose the believers and will surely disclose the hypocrites.",
        "verse_12": "And the infidels said to the Muslims, 'follow our path and we shall bear your sins,' whereas they shall not bear anything out of their sins. Undoubtedly, they are liars.",
        "verse_13": "And undoubtedly, they shall surely bear their burdens, and along-with their own burdens other burdens. And they shall be surely questioned on the Day of Resurrection concerning that which they used to devise falsely.",
        "verse_14": "And undoubtedly, We sent Nuh towards his people, then he stayed among them for a thousand years less fifty years. Then the Deluge overtook them and they were oppressors.",
        "verse_15": "Then We saved him and those in the ark, and made the Ark a sign for the entire world.",
        "verse_16": "And (sent) Ibrahim, when he said to his people, 'worship Allah, and fear Him'. There is good for you in it if you would have known.",
        "verse_17": "You indeed worship idols besides Allah and you fabricate pure lie. Undoubtedly, those whom you worship besides Allah have no power to provide for you, then seek your provision from Allah and worship Him and be grateful to Him. You are to return towards Him.",
        "verse_18": "And if you belie, then many of the people have already belied before you. And the Messenger is not responsible but to deliver the message manifestly.",
        "verse_19": "And have they not seen how Allah originates creation, then He will reproduce it? Undoubtedly, it is easy for Allah.",
        "verse_20": "Say you, 'travel in the earth, then see how Allah makes first, then Allah up brings the second growth. Undoubtedly Allah can do everything.",
        "verse_21": "He torments whom He pleases and shows mercy whom He pleases, and you are to return only to Him.",
        "verse_22": "And neither you can get out of the hold in the earth and nor in the heaven. And neither you have any friend in need and nor any helper save Allah.",
        "verse_23": "And those who believed not in My signs and meeting with Me, it is they who have no hope of My mercy and for them is the painful torment.",
        "verse_24": "Then his people could answer nothing but that they said, 'slay him or bum him, then Allah rescued him from the fire, undoubtedly, in it surely are signs for the believers.",
        "verse_25": "And Ibrahim said, 'you have indeed taken ‘besides Allah these idols with whom your friendship is within the span of the life of the world. Then on the Day of Resurrection you will deny each other and will curse each other. And the abode of you all is the Hell and you will have no helper.'",
        "verse_26": "Then Lut believed him. And Ibrahim said, 'I migrate towards my Lord'. Undoubtedly, only He it is, the Mighty, the Wise.",
        "verse_27": "And We bestowed him Ishaq and Yaqoob, and We put Prophet hood, and the Book in his offspring, and We gave him his reward in the world. And undoubtedly, in the Hereafter, he is among those who are worthy of Our proximity.",
        "verse_28": "And delivered Lut when he said to his people, 'undoubtedly you commit indecency which none among the entire world has done before you.",
        "verse_29": "'Do you commit unnatural offence with males and cut off the ways, and commit evil deeds in your assembly?' Then his people's answer was nothing, but that they said, 'bring upon us the torment of Allah if you are truthful.'",
        "verse_30": "He submitted, 'O my Lord, help me against these mischievous people'.",
        "verse_31": "When Our angels came to Ibrahim with glad tidings, they said, 'We shall surely destroy the people of this city'. Undoubtedly, its inhabitants are oppressors'.",
        "verse_32": "He said, 'in it indeed is Lut'. The angels said, 'we know well who is in it, we shall surely deliver him and his family but his wife, she is among those who remain behind.'",
        "verse_33": "And when Our angels came to Lut, their coming became unpleasant to him and on account of them his heart was straitened, and they said, 'fear not and nor grieve, undoubtedly, we shall deliver you and your family but your wife, she is among those who remain behind.",
        "verse_34": "'Undoubtedly, we are going to bring down upon the people of this city a torment from the heaven, the recompense of their disobedience.",
        "verse_35": "And undoubtedly, We have left remained from it a bright sign for a people who understand.",
        "verse_36": "And to Madian We sent their compatriot Shoaib, then he said, 'O my people, worship Allah, and hope for the Last Day, and wander not spreading mischief in the Land'.",
        "verse_37": "Then they belied him, therefore the earthquake overtook them, then in the morning they remained lying prostrated in their homes.",
        "verse_38": "And destroyed Aad and Thamud and you have already known their dwellings, and the devil (Satan) made their work appear fair-seeming to them and kept them back from the path though they could see clearly.",
        "verse_39": "And Quaroon and Firawn and Haman (We destroyed). And undoubtedly, Musa came to them with bright signs, then they showed haughtiness in the land, and they could not outstrip Us.",
        "verse_40": "Then We seized each of them on account of his sin, then as to some of them We sent the storm of stoning, and as to some of them, a roaring blast overtook them and as to some of them We buried in the earth and as to some of them, We drowned. And it was not befitting to the Dignity of Allah that He would have oppressed them, yes they themselves oppressed their souls.",
        "verse_41": "The example of those who have made guardians other than Allah is like the spider. She has made a house of cobweb. And undoubtedly, the frailest of all houses is the house of the spider. What a good thing it would have been if they knew!",
        "verse_42": "Allah knows whatever they worship besides Allah. And He it is the Mighty, the Wise.",
        "verse_43": "And these examples We narrate to the people, and none understand them but the learned.",
        "verse_44": "Allah has made the heavens and the land with truth. Undoubtedly, in it, there is sign for the Muslim.",
        "verse_45": "O beloved! Recite the Book that has been revealed to you, and establish prayer. Undoubtedly, the prayer forbids one from indecency and evil thing. And no doubt, the remembrance of Allah is the greatest. And Allah knows what you do.",
        "verse_46": "And O Muslims! dispute not with the people of the Book but in a better manner, except those of them who did wrong and say, 'we have believed in that which has been sent to us and what has been sent down to you and our God and your God is One and we have submitted before Him'.",
        "verse_47": "And O beloved! In the same manner We sent down the Book to you. Then those whom We gave Book believe in it and there are some of these persons who also believe in it. And no one denies Our signs but the infidels.",
        "verse_48": "And you used not to recite any Book before it and nor you used to write anything with your hand, in that case the followers of falsehood would have doubted.",
        "verse_49": "Rather it is bright signs in the breasts of those who have been given knowledge. And none denies Our signs but the unjust.",
        "verse_50": "And they said, 'why are not signs were sent down upon them from his Lord'? Say you, 'the signs are with Allah. And I am indeed a clear warner'.",
        "verse_51": "Does it not suffice them that We have sent down upon you the Book that is recited to them? Undoubtedly, in it there is mercy and admonition for the believers.",
        "verse_52": "Say you, 'Allah is Sufficient as a Witness between me and you.' He knows what is in the heavens and in the earth'. And those who believed in falsehood and denied Allah, they are the people who are in loss.",
        "verse_53": "And they demand you to hasten the torment. And if there had not been an appointed term, then most certainly the torment would have come upon them. And necessarily, it shall come upon them suddenly, when they shall be unaware.",
        "verse_54": "They demand you to hasten the torment and undoubtedly, the Hell has already surrounded the infidels.",
        "verse_55": "The day when the torment will cover them from above them and from beneath their feet, and He will say, 'taste what you have done'.",
        "verse_56": "O My bondmen! Who have believed, no doubt, My Land is spacious, therefore worship Me only.",
        "verse_57": "Every soul is to taste death, then you shall return to Us.",
        "verse_58": "And undoubtedly, those who have believed and did good deeds, certainly We shall lodge them in the lofty apartments of the Heaven beneath which streams flow, they shall abide therein forever. What an excellent reward of good doers!",
        "verse_59": "Those who have preserved and rely only upon their Lord.",
        "verse_60": "And how many there are who move on the earth that they have not their provisions with them, Allah provides them and you also. He is the Hearing, the Knowing.",
        "verse_61": "And if you ask them, who has made the heavens and earth and made to serve the sun and the moon, then they will certainly say, 'Allah', then where are they going perverted?",
        "verse_62": "Allah expands provision for whom He will of His bondmen and straitens for whom He will. Undoubtedly Allah knows everything.",
        "verse_63": "And if you ask them, who has sent down water from the heaven and therewith revived the earth after its death, they shall certainly say, 'Allah'. Say you, all praises to Allah. Nay! Most of them have no wisdom.",
        "verse_64": "And this life of the world is nothing but sport and play. And undoubtedly the home of the Hereafter — necessarily, that is the true life. What a good thing it was if they knew!",
        "verse_65": "Then when they embark on boat they call upon Allah having exclusive faith upon Him. But when He brings them safe to the land, henceforth they begin to associate.",
        "verse_66": "That they may be ungrateful to that which We have bestowed on them and they may enjoy themselves, now then they are to know.",
        "verse_67": "Have they not seen that We have made the sanctified Land secure and the people around them are snatched away? What! Then they believe in falsehood and are ungrateful to the favor of Allah.",
        "verse_68": "And who is more unjust than one who forged lie against Allah or belied the truth when it comes to him? Is there not an abode of the infidels in the Hell?",
        "verse_69": "And those who struggled in Our path, surely We shall guide them in Our ways. And no doubt, Allah is with the righteous."
     },
    "count": 69
}
