{
    "name": "al-Insan",
    "index": "076",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Undoubtedly, there has come upon man a time when there was no mentioning of his name anywhere.",
        "verse_2": "Undoubtedly, We created man from a mingled spermdrop that We might try him; so We made him hearing, seeing.",
        "verse_3": "Undoubtedly, We have shown him the way, whether he be grateful or ungrateful.",
        "verse_4": "Undoubtedly, We have already prepared for the infidels chains and iron collars and a blazing fire.",
        "verse_5": "Undoubtedly, the virtuous will drink of a cup whereof the admixture is camphor.",
        "verse_6": "What is the camphor, it is spring wherefrom the most special bondmen of Allah will drink. They will make it gush forth wherever they would like in their places.",
        "verse_7": "They fulfil their vows, and fear a day the evil of which is wide-spread.",
        "verse_8": "And they feed, for love of Him, the poor, the orphan and the prisoner.",
        "verse_9": "They say to them, 'We feed you for Allah's pleasure only. We desire no recompense or thanks from you.",
        "verse_10": "'Undoubtedly, we fear from our Lord a day which is frowning and very hard.'",
        "verse_11": "So Allah has saved them from the evil of that day and granted them cheerfulness and happiness.",
        "verse_12": "And recompensed them for their patience with a Garden, and silken clothes.",
        "verse_13": "They will be reclined upon couches in the Garden; neither will they see therein sunny heat nor excessive cold.",
        "verse_14": "And its shades will be inclined over them, and its clusters would have been made hanging down.",
        "verse_15": "And there shall be passed around them silver vessels and goblets which will be bright as' glass.",
        "verse_16": "What type of glass, glass of silver, the cupbearers, would have placed them on complete measurement.",
        "verse_17": "And therein, they shall be made to drink a cup whose mixture will be ginger.",
        "verse_18": "What ginger is, it is a spring in the Paradise called Sal-Sabil.",
        "verse_19": "And never aging youths shall go around them for service, when you see them, you think them to be pearls sprinkled.",
        "verse_20": "And when you look to them, you see a bliss and a great Kingdom.",
        "verse_21": "Upon their bodies, there are green silken garments and brocade and are made to wear bracelets of silver. And their Lord made them to drink pure beverage.",
        "verse_22": "It will be told to them, this is your recompense, and your labour bore fruits.",
        "verse_23": "Undoubtedly, We have sent down the Quran on you in piecemeal.",
        "verse_24": "So be you patient under the order of your Lord, and hear not anyone of them sinner or unthankful.",
        "verse_25": "And remember the name of your Lord Morning and evening.",
        "verse_26": "And in part of night, prostrate yourself before Him and magnify Him through the long night.",
        "verse_27": "Undoubtedly, these people love the things under feet, and has already left behind a heavy day.",
        "verse_28": "We created them, and strengthened their joints, and, when We will, We shall exchange their likes.",
       "verse_29": "This is a reminder; so whoever wills, let him take a path to his Lord.",
        "verse_30": "Yet you cannot will, unless God wills. God is Knowing and Wise.",
        "verse_31": "He admits into His mercy whomever He wills. But as for the wrongdoers, He has prepared for them a painful punishment."
    },
    "count": 31
}
