{
    "name": "an-Nahl",
    "index": "016",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Now comes the Command of Allah, therefore, ask not to hasten it. Holy is He and is exalted above all the associates.",
        "verse_2": "He sends down the angels with the spirit of faith that is the revelation on whomsoever of His bondmen He pleases, 'Warn that none to be worshipped save Me, then fear Me.'",
        "verse_3": "He created the heavens and earth rightly. He is far high above from their associates.",
        "verse_4": "He created man from a purified drop, therefore he is an open disputer.",
        "verse_5": "And created cattle, in them, for you there is warm costume and there are profits, and of them you eat.",
        "verse_6": "And there is beauty in them for you, when you bring them back in the evening and when you leave them for grazing.",
        "verse_7": "And they carry your loads to a city which you could not reach but being heavily tired. No doubt, your Lord is most Kind, Merciful.",
        "verse_8": "And horses and mules and asses that you may ride upon them and for adornment. And He will create what you know not.",
        "verse_9": "And the middle path is rightly up to Allah and some path is crooked. And had He willed, He would have guided you altogether.",
        "verse_10": "It is He Who sent down water from the heaven, there is drink therefrom for you, and from which are trees by which you pasture.",
        "verse_11": "With this water He causes to grow for you crops and olives and dates and grapes and fruits of every kind. No doubt, in it there is a sign for a people who ponder.",
        "verse_12": "And He has made subservient for you, the night and the day and the sun and the moon. And the stars are subservient by His Command. No doubt, in it there are signs for the wise people.",
        "verse_13": "And that which He has created for you of various kinds in the land. No doubt, in it there is a sign for a people who remember.",
        "verse_14": "And it is He Who has made the sea subservient for you, that you eat fresh flesh from it and bring forth from it ornaments which you wear. And you see boats cleaving through water, and that you seek of His bounty and that haply, you may be grateful to Him.",
        "verse_15": "And He has set up anchors in the earth, lest it may shake with you and rivers and roads that you may get direction.",
        "verse_16": "And way marks. And by the stars they find the way.",
        "verse_17": "Will then He Who creates become like him who creates not? Do you not then accept admonition?",
        "verse_18": "And if you count the favors of Allah, you would not be able to number them. No doubt, Allah is Forgiving, Merciful.",
        "verse_19": "And Allah knows that what you conceal and what you reveal.",
        "verse_20": "And those whom they worship besides Allah create nothing but they are themselves created.",
        "verse_21": "They are dead, not alive; and they know not when the people will be raised.",
        "verse_22": "Your God is One God, then those who believe not in the Hereafter, their hearts deny, and they are proud.",
        "verse_23": "In fact Allah knows what they hide and what they declare. Undoubtedly, He likes not the proud ones.",
        "verse_24": "And when it is said to them, 'What has your Lord sent down?' they say, 'Tales of the ancients.'",
        "verse_25": "That they may bear their loads in full on the Day of Judgment and also some loads of those whom they mislead by their ignorance. Hear! What an evil load they bear!",
        "verse_26": "No doubt, those before them had plotted (against their Prophets), then Allah brought down their structure from the foundation, then the roof fell down on the from above, and the torment came to them whence they were not aware.",
        "verse_27": "Then on the Day of Judgment, He will disgrace them and will say, ‘Where are those My associates, regarding whom you used to dispute'. The men of knowledge will say, 'Today all disgrace and vice are upon the infidels.'",
        "verse_28": "Those whose lives are taken out by the angels while they were wronging themselves, now they will offer submission that we were not doing any evil. Yes why not, beyond doubt, Allah knows well what you used to do.",
        "verse_29": "Now enter the gates of Hell, abide in it for ever. Then what an evil abode of the proud ones.",
        "verse_30": "And it was said to the God-fearing, 'What is that your Lord sent down,' they said 'Good'. For those who did good in this world is good. And undoubtedly the home of the Hereafter is best. And necessarily, what an excellent abode of the God-fearing.",
        "verse_31": "Gardens of abode which they will enter, streams running beneath, they will get therein what they wish. Allah thus recompense the duty bound.",
        "verse_32": "Those whose lives are taken out by angles while they are pure, saying, 'Peace be open you.' 'Enter paradise for what you did.'",
        "verse_33": "What for they are waiting, but that the angels should come to them or the torment of your Lord should come? Thus did those before them. And Allah oppressed them not yes they wronged their own souls.",
        "verse_34": "Then their evil earnings befell them and surrounded them that they used to mock at.",
        "verse_35": "And the polytheists said, 'Had Allah willed, we would not have worshipped anything save Him, neither we nor our fathers, nor we would have forbidden anything apart from Him.' Thus did those before them; then what is on the Messengers, but to deliver clearly.",
        "verse_36": "And no doubt, We sent a Messenger in every nation (saying) that 'Worship Allah, and avoid the devil (Satan), then some of them were guided by Allah and upon some of them a straying came rightly. Therefore travel in the land and behold, how the end of those who belied was.",
        "verse_37": "If you are eager for their guidance, then undoubtedly, Allah guides not him who has been sent astray and they have no helper.",
        "verse_38": "And they swore by Allah with the utmost endeavor in their oaths that Allah would not raise the dead, yes why not, the true promise is on Him but most people know not.",
        "verse_39": "In order that He may tell them plainly that in which they used to dispute and in order that the infidels should know that they were liars.",
        "verse_40": "Anything We intend, our saying to it is that We say 'Be' it becomes at once.",
        "verse_41": "And those who left their homes and hearths in the way of Allah being oppressed. We shall surely give them good place in the world. And undoubtedly, the reward of the Hereafter is much greater; any-how people would have known.",
        "verse_42": "Those who have kept patience, and rely only on their Lord.",
        "verse_43": "And We sent not before you any but men to whom We reveal, then O people! Ask the men of knowledge if you know not.",
        "verse_44": "With clear arguments and Books. And ‘O Beloved! We sent down to you the Remembrance (the Holy Quran) that you may explain to people what was sent down to them and that haply they may ponder.",
        "verse_45": "Do, then, those who devise evil plans not fear that Allah may sink them in the earth, or the torment may come to them whence they know not?",
        "verse_46": "Or that He may seize them while going to and fro, because they cannot tire Him.",
        "verse_47": "Or that He may catch them by a process of slow wastage. No doubt, your Lord is very Kind, Merciful.",
        "verse_48": "And have they not observed that whatever Allah has made, their shadows turn right and left prostrating to Allah and they are abased before Allah?",
        "verse_49": "And to Allah prostrate all that is in the heavens and all that are crawling in the earth and the angels (too) and they do not boast.",
        "verse_50": "They fear their Lord above them and do what they are commanded.",
        "verse_51": "And Allah has said, Take not two gods. He is only One God to be worshipped; and therefore fear Me alone.'",
        "verse_52": "And whatever is in the heavens and earth for Him only and only His obedience is incumbent. Will you then fear any other than Allah?",
        "verse_53": "And whatever good thing you have is all from Allah, then when trouble touches you, to Him you cry for shelter.",
        "verse_54": "Then when He removes evil from you, then a group of you begins to associate others with their Lord.",
        "verse_55": "That they may be ungrateful to what good We have bestowed them. Then enjoy a little, but soon you will come to know.",
        "verse_56": "And they appoint a portion out of what We have provided them for unknown things. By Allah'. You are surely to be questioned as to what you used to forge.",
        "verse_57": "And they appoint daughters for Allah, Holy is He, and for themselves they have what they desire.",
        "verse_58": "And when the glad tidings of the birth of a daughter is conveyed to any of them, then his face remains black all along the day, and he suppresses his anger.",
        "verse_59": "He hides himself from the people, because of the evil of this glad tidings. Shall he keep it with disgrace or bury it in the dust? Lo! Very bad they judge.",
        "verse_60": "The condition of those who believe not in the Hereafter is evil one, and the glory of Allah is Loftiest. And He is the Honorable, Wise.",
        "verse_61": "And if Allah would have seized people for their wrong doings, then He would have left no crawling creature on earth, but He defers them till a time fixed, then when their term will come, they cannot remain behind a single hour, nor can they go ahead of it.",
        "verse_62": "And they appoint for Allah what they themselves dislike, and their tongues tell a lie that for them is good. Then undoubtedly, for them is the fire, and they are the persons who have crossed the limit.",
        "verse_63": "By Allah, We have sent Messengers to many nations before you, then the devil (Satan) made their works beautiful in their eyes, so he alone is their companion this day and for them is the torment painful.",
        "verse_64": "And We have not sent down this Book to you but in order that you may make clear to them that about which they differ, and a guidance and mercy for the believers.",
        "verse_65": "And Allah sent down water from the heaven then gave life to earth by it after its death. Undoubtedly, there is a sign in it for those who have ears.",
        "verse_66": "And no doubt, there is a lesson for you in the cattle. We give you to drink of what is in their bellies from between the dung and blood, milk pure easy to swallow for the drinkers.",
        "verse_67": "And of the fruits of date palms and the grapes, you make therefrom a non-alcoholic drink and a good provision. Undoubtedly, in it, there is a sign for a people of wisdom.",
        "verse_68": "And your Lord inspired the bee, \"Make houses in the hills and in the trees and in the roofs.",
        "verse_69": "\"Then eat of every kind of fruit, and walk the ways of your Lord that is smooth and easy for you.\" There comes out from their bellies a drink of varied colors in which there is healing for the people. Undoubtedly, in it there is a sign for those who ponder.",
        "verse_70": "And Allah has created you, then He will cause you to die, and some of you are turned towards the worst part of life, so that they know not after having knowledge. No doubt, Allah is All-Knowing, All- Doing.",
        "verse_71": "And Allah has preferred one over the other in the means of subsistence, then those who have been preferred will not divert their means of subsistence to their handmaid and slaves, so that they all should become equal in it. Do they then deny the blessing of Allah?",
        "verse_72": "And Allah has made for you women from among yourselves, and created sons, paternal grandsons and maternal grandsons for you from your women, and provided you with clean things. Do they then believe in falsehood and deny the favor of Allah?",
        "verse_73": "And they worship besides Allah such which have no power to give any provision from the heavens and earth, nor can they do anything.",
        "verse_74": "Then set not similitudes for Allah. No doubt, Allah knows and you know not.",
        "verse_75": "Allah explained an example, that there is a slave, property of the other, having himself no power, and there is another whom We have provided from Ourselves with good provision, then he spends out of it secretly and openly; will they be equal? All praise belong to Allah. But most of them know not.",
        "verse_76": "And Allah explained an example, there are two men, one dumb who can do nothing and is a burden over his master wherever he sends him, he brings him no good. Will he be equal to him who orders justice and he is himself on the straight path?",
        "verse_77": "And for only Allah is the secret things of heavens and earth .And the matter of the Hour is not but as twinkling of the eye but even nearer than. No doubt, Allah can do everything.",
        "verse_78": "And Allah has created you from the wombs of your mothers while you knew nothing, and gave you ears and eyes and hearts so that you may be grateful.",
        "verse_79": "Have they not seen the birds tied to order in the firmament of the heaven, none holds them save Allah? No doubt, in it there are signs for those who believe.",
        "verse_80": "And Allah gave you houses for habitation, and made for you of the skins of cattle some houses which are light to you for the day you travel and for the day you stay at stages, and from their wool and fur and hair some household goods and the things of use for a time.",
        "verse_81": "And Allah gave you shades out of things He made, and made for you shelters in the mountains, and made for you some garments to protect you from heat and some garments to protect you in fighting. Thus does He complete His favor on you, that you may submit to His Command.",
        "verse_82": "Then if they turn away their faces, then O beloved, there is nothing upon you but to deliver clearly.",
        "verse_83": "They recognize the favor of Allah, then they deny it and most of them are infidels.",
        "verse_84": "And the day when We shall raise a witness from every nation, then the infidels will neither be permitted nor shall they be pleased.",
        "verse_85": "And when the wrongdoers will see the torment, and then it shall not be lightened from them nor will they get time.",
        "verse_86": "And when those who associated partners will see their associates, they will say, 'O our Lord! These are our associates whom we used to worship besides You; Then they will throw back at them the word, 'Undoubtedly, you are liars.'",
        "verse_87": "And they will fall submissively to Allah on that day and what they used to forge will be lost from them.",
        "verse_88": "Those who disbelieved and debarred from the path of Allah We increased torment upon torment, the recompense of their mischief.",
        "verse_89": "And the day when We shall raise a witness in every community from amongst themselves that they may give evidence against them, and O beloved! We shall bring you as a witness against all those. And We have sent down this Quran on you in which everything is clearly explained and as a guidance and mercy and good tidings for the Muslims.",
        "verse_90": "Undoubtedly, Allah bids justice and good doing and giving to kindred and forbids indecency and wicked things and rebellion. He admonishes you that you may be mindful.",
        "verse_91": "And fulfil the covenant of Allah when you have made the covenant, and break not the oaths after making them fast, and you have already made Allah a Surety upon you. No doubt, Allah knows your work.",
        "verse_92": "And be not like that woman who has broken her yarn into pieces after it has become strong. You make your oaths an unreal excuse amongst yourselves so that one community may not be more numerous than another community. Surely Allah tries you thereby. And necessarily, He will make clear to you on the Day of Judgment as to what you used to dispute.",
        "verse_93": "And if Allah had willed, He would have made you a single nation but Allah leads astray whom He pleases and guides whom He pleases. And necessarily, you will be asked of your works.",
        "verse_94": "And do not make your oaths as unfounded excuse amongst yourselves lest any foot may slip after its being made firm and you may have to taste evil for you used to hinder from the path of Allah and a great torment descend on you.",
        "verse_95": "And take not a little price for the covenant of Allah; undoubtedly, that which is with Allah is better for you if you know.",
        "verse_96": "What is with you will be exhausted and what is with Allah is to remain forever. And certainly We shall give those who are patient that reward befitting to their best work.",
        "verse_97": "Whoever works good, male or female and be a Muslim, then certainly We shall make him live a good life; and necessarily, We shall give them their reward befitting to their best work.",
        "verse_98": "Then when you recite the Quran, ask refuge of Allah from the devil (Satan) the rejected one.",
        "verse_99": "No doubt, he has no control over those who believed and have trust in their Lord.",
        "verse_100": "He has his control over those who befriend him and those who set associates with Him.",
        "verse_101": "And when We exchange one verse for the other, and Allah knows well what He sends down, the infidels say, 'You make it on your own.' But most of them know not.",
        "verse_102": "Say, 'The Holy spirit has brought it down from your Lord with truth, that He may make firm the believers and as a guidance and glad tidings to the Muslims.'",
        "verse_103": "And undoubtedly, We know that they say, 'It is only a man who teaches him.' The tongue of him towards whom they hint at is foreign and this is clear Arabic language.",
        "verse_104": "No doubt, those who believe not in the verses of Allah, Allah guides them not and for them is the painful torment.",
        "verse_105": "lt is only those who believe not in the verses of Allah forge lies and they are the liars.",
        "verse_106": "Whoso denies Allah after believing in Him save him who is compelled and his heart is firm in belief, yes whoso becomes infidel with open heart, upon them is the wrath of Allah and for them is the great torment.",
        "verse_107": "It is because they knew the life of the world more pleasing than the life of the Hereafter, and because Allah guides not (such) infidels.",
        "verse_108": "These are they upon whose hearts and ears and eyes Allah has set a seal and it is they who are lying heedlessly.",
        "verse_109": "Undoubtedly, in the Hereafter it is they the losers.",
        "verse_110": "Then no doubt, your Lord, for those who left their homes after being tortured, then they struggled and remained patient, no doubt, your Lord thereafter is necessarily Forgiving, Merciful.",
        "verse_111": "The day when every soul will come disputing towards itself; and every soul shall be paid in full for what it did and they shall not be wronged.",
        "verse_112": "And Allah explained a saying of a town which was safe and satisfied, its provision came in abundance from all sides, then it began showing un thankfulness to the blessings of Allah, then Allah made it to taste this punishment that it was caused to wear the garment of hunger and fear, the recompense of what they did.",
        "verse_113": "And no doubt, a Messenger came to them from amongst themselves; then they belied him; then the torment seized them and they were unjust.",
        "verse_114": "Then eat out of the provisions of Allah lawful and clean and be thankful of the blessing of Allah if you worship Him.",
        "verse_115": "He has made unlawful to you only these, the dead, and the blood, and the flesh of swine, and that upon which other than God's name has been pronounced at the time of slaughter; then who is helpless, neither desiring nor exceeding the limit, then no doubt, Allah is Forgiving, Merciful.",
        "verse_116": "And say not what your tongues tell falsely, this is lawful and this is unlawful so that you may forge a lie against Allah. No doubt, those who forge a lie against Allah, they will not prosper.",
        "verse_117": "There is a short enjoyment and for them is the painful torment.",
        "verse_118": "And We made specially unlawful to the Jews those things which We have already related to you, and We oppressed them not, yes they used to wrong their own souls.",
        "verse_119": "Then undoubtedly, your Lord to those who commit evil ignorantly, then repent thereafter and get corrected, no doubt, your Lord thereafter is necessarily Forgiving, Merciful.",
        "verse_120": "No doubt, Ibrahim was a Leader, obedient to Allah and separate from all others and was not a polytheist.",
        "verse_121": "Thankful to His Blessings; Allah chose him and showed him the straight path.",
        "verse_122": "And We gave him good, in the world. And undoubtedly, in the Hereafter he is among the righteous.",
        "verse_123": "Then We revealed to you to follow the faith of Ibrahim who was separate from all falsehood and was not a polytheist.",
        "verse_124": "The Saturday (Sabbath) was imposed only upon those who differed in it. And undoubtedly your, Lord will judge between them on the Day of Judgment about that in which they differed.",
        "verse_125": "Call to the way of your Lord with wisdom and good admonition and argue with them in a way that is best. No doubt, your Lord knows well who has strayed from His way and He knows well those who are guided.",
        "verse_126": "And if you give punishment, then punish them to the extent they had afflicted you, and if you be patient, then undoubtedly, patience is best for those who are patient.",
        "verse_127": "And O beloved! Be patient and your patience is because of Allah and grieve not for them and be not strained because of their plots.",
        "verse_128": "No doubt, Allah is with those who fear and do good."
    
    },
    "count": 128
}
