{
    "name": "an-Nisa'",
    "index": "004",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O people! Fear your Lord Who created you from a single soul and made its mate from within it, and from that pair spread many men and women and fear Allah in whose name you ask for (your rights) and pay attention to the ties of relationship. Undoubtedly Allah is watching you all time.",
  "verse_2": "And give the orphans their property and do not exchange dirty for the clean and consume not their property mixing it with your property. Undoubtedly, it is a great sin.",
  "verse_3": "And if you apprehend that you will not be able to do justice to orphan girls, then marry such other women as seem good to you, two, three, four but if you are afraid that you will not to be able to keep two wives on equal terms, then marry one only or captives whom you own. This is nearer to keeping you away from doing injustice.",
  "verse_4": "And give the women their dowries willingly. But if they, of their own pleasure of heart remit something of it to you, then consume it with taste and pleasure.",
  "verse_5": "And give not to the unwise their property you have, which Allah has made a means of your living and feed them therewith and clothe them and speak to them good words.",
  "verse_6": "And remain testing the orphans, until they are able to marry; then if you find them of right understanding, deliver to them their property and consume it not in extravagance and in such haste that they should not reach their maturity. And whoso is not needy, let him abstain and whoso is needy, let him consume it with equity. Then when you deliver them their property, then take witnesses against them. And Allah is Sufficient in taking account.",
  "verse_7": "For men there is share in what their parents and relatives have left behind, and for women there is share in what their parents and relatives have left behind, be the bequest little or be it much, it is a share estimated, determined.",
  "verse_8": "But if at the time of division, the relatives and the orphans and the needy come, then give them too something therefrom and speak to them good words.",
  "verse_9": "And let those fear, who if they had to leave behind them weak offspring, would have been afraid for them, so they should be afraid of Allah and speak the upright speech.",
  "verse_10": "Those who consume the property of orphans unjustly, they fill in their belies with fire only, and they shall soon enter into the flaming fire.",
  "verse_11": "Allah commands you concerning your children, the share of male is equal to the share of two females; then if there be daughters only, though more than two, then for them is two third of what is left, and if there be only one daughter, for her is one half. And for each of the parents of the deceased is one sixth of what is left, if there be a child of the deceased, but if he has no child and leaves parents, then for the mother is one third; but if there be his many sisters and brothers, then for the mother is one sixth, after any bequest which has been made and debts. Your fathers and your sons, you know not which of them will be more profitable to you. This is fixed proportion from Allah. Undoubtedly, Allah is All Knowing, Wise.",
  "verse_12": "And for you is one half of what is left by your wives, if they have no issue; but if they have issue, then you have one fourth of what they leave after (paying) any bequest made by them and the debts. And for the women is one fourth of what you leave if you have no issue; but if you have issue, then for them is one eight of what you leave after (paying) any bequest made by you and the debts. And if the heritage of any such male or female who leave behind nothing, neither parents nor children, is to be divided and from mother side he or she has brother or sister, then for each one of them is one sixth. Then if the sister and brother be more than one, then all are sharer in one third, after (payment of the bequest of the deceased and debts in which the deceased would not have caused any harm. This is an injunction from Allah and Allah is All-Knowing, Gentle.",
  "verse_13": "These are the limits of Allah; and whoso obeys Allah and His Messenger; Allah will make him enter Gardens beneath which flow rivers, will abide therein. And this is the great success.",
  "verse_14": "And whoso disobeys Allah and His Messenger and transgresses His all limits; Allah will cause him to enter the Fire, in which he will abide and for him is degrading torment.",
  "verse_15": "And those of your women who commit adultery; take the evidence of four males specially from amongst you against them; then again if they give evidence, then confine those women to the houses until death takes them or Allah envisages some way for them.",
  "verse_16": "And those male, female of you commit such act, torture them; and then again if they repent and amend, then leave them alone. Undoubtedly Allah is most Relenting, Merciful.",
  "verse_17": "The repentance whose acceptance has been undertaken by Allah with His own Grace is only for those who do evil ignorantly and then again repent soon after. Towards such people Allah turns with His Mercy; and Allah is Knowing, Wise.",
  "verse_18": "And that repentance is not of those who continue doing evil until when death comes to anyone of them, he says, 'now I repented', nor for those who died as infidels. For them We have prepared a painful torment.",
  "verse_19": "O believers! it is not lawful for you to be heir of the women forcibly, and prevent them not with this design that you may take away part of what you had given them as dower except in this shape that they commit an act of flagrant indecency and treat with them fairly; then if you dislike them, it is likelihood that you may dislike a thing and wherein Allah has placed much good.",
  "verse_20": "And if you desire to change one wife for another and you have already given her a heap of treasure; then take not anything thereof. Will you take it by slander and with manifest sin?",
  "verse_21": "How you shall take it when each of you has already become unveiled before one another and they have taken from you a most firm covenant?",
  "verse_22": "And do not marry those women whom your fathers have married; except what has already passed. Undoubtedly, that is an act of indecency and wrath and an evil way.",
  "verse_23": "Forbidden to you are your mothers and your daughters and sisters and your father's sisters and mother's sisters and your brother's daughters and your sister's daughters, and your mothers who have given suck you and your foster sisters and the mothers of your wives and daughters (your step-daughters) who are in your care from the wives with whom you had intercourse but if you had not intercourse with them, then there is no harm in their daughters, and the wives of your sons who are of your loins and to have two sisters together except what has already passed. Undoubtedly. Allah is Forgiving, Merciful.",
  "verse_24": "And forbidden to you are the women having husbands save the women of infidels who come in your possession. This is the prescription of Allah unto you and the remaining besides those are lawful for you; so that you seek them in exchange of your properties bringing them in bondage (through marriage) and not desiring for lust. Therefore, as to those women whom you wish to marry, give them their fixed dowries. And there is no sin in what you mutually agree upon after fixation. Undoubtedly, Allah is Knowing, Wise.",
  "verse_25": "And amongst you one who cannot marry free believing women due to insufficient means; then let him marry such of the believing handmaids who are the possession of your hands. And Allah knows your faith very well; the one of you is from the other, therefore, marry them with the leave of their masters and give them their dowries according to convention bringing them into bondage (through marriage), not desiring for lust, and nor making lovers; when they come under bondage and again commit any act of indecency, then on them the punishment is half of that for free women. This is for him who of you is afraid of adultery and it is better for you to have patience. And Allah is Forgiving, Merciful.",
  "verse_26": "Allah desires to explain to you His commandments and to tell you the ways of those before you and to turn to you with His Mercy. And Allah is Knowing, Wise.",
  "verse_27": "And Allah desires to turn to you with His Mercy, and those who follow their lusts desire that you should stray far away from the right path.",
  "verse_28": "Allah desires to lighten unto you, and man has been created weak.",
  "verse_29": "O believers! Consume not unjustly the property of one another among yourselves except it be a trade by your mutual consent. And kill not yourselves. Undoubtedly, Allah is Merciful to you.",
  "verse_30": "And whosoever shall do so with excessiveness and injustice, then We shall make him enter into Fire soon: and that is easy for Allah.",
  "verse_31": "If you keep away from major sins that are forbidden to you, then We will forgive your other sins and make you enter a place of honor.",
  "verse_32": "And covet not that whereby Allah has made one of you excel over the other. For men there is share from their earning, and for women there is share from their earning. And ask Allah for His Grace. Undoubtedly, Allah knows everything.",
  "verse_33": "And for everyone We have made heirs of the property that is left by parents and relations, and those with whom you have sworn compact, give them their share, undoubtedly everything is before Allah.",
  "verse_34": "Men are in charge over women, because Allah has made one of them excel over another, and because men have expanded their wealth over them, so the virtuous women are submissive, they keep watch in the absence of husband as Allah commanded to watch. And as to those women whose disobedience you fear, then admonish them and sleep apart from them, and beat them (lightly), then if they come under your command, then seek not anyway of excess against them, Undoubtedly, Allah is Exalted, Great.",
  "verse_35": "And if you fear a dispute between husband and wife, then appoint an arbiter from the side of the family of man and an arbiter from the side of the family of woman, if these two will desire reconciliation, then Allah will cause unity between them. Undoubtedly, Allah is Knowing, Aware.",
  "verse_36": "And worship Allah, and do not associate anyone with Him and do good to parents, and to relatives and orphans, and the needy, and the near neighbor and the distant neighbor and the companion of your side and the wayfarer and to your male and female servants. Undoubtedly, Allah loves not the proud, boastful.",
  "verse_37": "Those who themselves act miserly and say others to be misers and conceal that which Allah has given them of His bounty. And We have prepared for the infidels a degrading torment.",
  "verse_38": "And those who spend their wealth to show off to men and do not have faith into Allah and nor the Last Day and whose companion has become Satan, then what an evil companion is he?",
  "verse_39": "And what was the harm, if they would have faith in Allah and the Last Day and spent out of what Allah has given them? And Allah knows them.",
  "verse_40": "Allah does not do injustice even to the weight of an atom, and if there be a good deed, He doubles it and gives from Himself immense reward.",
  "verse_41": "Then how shall it be, when We bring up a witness from every nation, and O beloved Muhammed! We will bring you as a witness and a guardian against all those.",
  "verse_42": "On that day those who disbelieved and disobeyed the Messenger will wish the earth would be levelled after burying them in it, and they will not be able to conceal anything from Allah.",
  "verse_43": "O believers! approach not prayer while you are intoxicated, until you have so much sense that what you say, you under-stand, nor when you are unclean without taking a bath except when you are travelling; and if you are ailing, or on a journey, or anyone of you comes from privy, or you have touched women and you do not find water, then take some pure earth and wipe therewith your faces and your hands. Undoubtedly, Allah is Pardoning, Forgiving.",
  "verse_44": "Have you not seen those who were given a portion of the Book? They buy error and intend that you too may lose the way.",
  "verse_45": "And Allah knows well your enemies. And Allah is Sufficient as Guardian; and Allah is Sufficient as Helper.",
  "verse_46": "Some of the Jews pervert words from their places and say, 'We heard and disobeyed and (Say) 'hear, you be not made to hear', and say 'Raa'ina' twisting their tongues and taunting in Faith. And if they had said that 'We heard and obeyed, and sir, hear our talks and sir, look at us', it would have been better for them and more upright. But Allah has cursed them for their infidelity, so they believe not, save a little.",
  "verse_47": "O people of the Book! Believe in what We sent down confirming the Book with you, before We deface some faces and turn them on their backs or curse them as We cursed the people of the Sabt (Saturday). And the decree of Allah is bound to be carried out.",
  "verse_48": "Undoubtedly, Allah forgives not that infidelity be done with Him and whatever is less than infidelity forgives whomsoever He pleases, and whoso associates partners with Allah forged a great sin.",
  "verse_49": "Have you not observed those who declare themselves to be pure? Nay, It is Allah Who purifies whomsoever He pleases, and they shall not be wronged a single date-thread.",
  "verse_50": "Behold, how they are forging lie against Allah. And that is itself a sufficient sin.",
  "verse_51": "Have you not observed those who were given a portion of the Book, they believe in idols and demon (Satan) and say about infidels, 'These are more guided on the way than Muslims.'",
  "verse_52": "These are they whom Allah cursed. And he whom Allah curses, you shall never find for him any helper.",
  "verse_53": "Have they some share in the kingdom? It is so then they would not give mankind a speck.",
  "verse_54": "Or do they envy the people for what Allah given them out of His bounty? Then We gave the Book and wisdom to the children of Abraham and granted them a great kingdom.",
  "verse_55": "Then some of them believed in him and someone turned the face from him; and sufficient is Hell, as blazing fire.",
  "verse_56": "Those who rejected Our signs, We shall soon cause them to enter Fire. Whenever their skins shall be fully burnt up, We shall change them with other skins, that they may taste the torment. Undoubtedly Allah is Dominant, Wise.",
  "verse_57": "And those who believed and did good deeds, We shall soon make them enter Gardens beneath which rivers flow; they shall abide therein forever. For them there are pure wives, And We cause them to enter a place where there shall be shade only shade.",
  "verse_58": "Undoubtedly, Allah commands you to pay back the trusts to their owners, and that when you judge amongst people, judge with justice. Undoubtedly how well Allah admonishes you. Verily Allah hears, sees.",
  "verse_59": "O believers! Obey Allah and Obey the Messenger, and those who have power of command amongst you, then again if there may arise any difference amongst you, refer it to Allah and His Messenger, if you have faith in Allah and the Last Day. This is better, and its end is best.",
  "verse_60": "Have you not observed those who claim that they believed in what has been sent down to you, and what has been sent down before you? Then they wish to make the devil their arbiter, whereas they were commanded to reject him wholly. And Satan desires to lead them far astray.",
  "verse_61": "And when it is said to them, 'Come towards the Book sent down by Allah and the Messenger', then you shall see that the hypocrites turn away from you averting their faces.",
  "verse_62": "How shall it be, when any affliction befalls them, for what their hands have sent forth? Then O beloved! They come to you swearing by Allah that our object was kindness and concord only.",
  "verse_63": "Allah knows what is in their hearts, then over look them, and admonish them and say to them convincing words concerning their affairs.",
  "verse_64": "And We did not send any Messenger, but that he should be obeyed by Allah's will. And if when they do injustice unto their souls, then O beloved! They should come to you and then beg forgiveness of Allah and the Messenger should intercede for them, then surely, they would find Allah Most Relenting, Merciful.",
  "verse_65": "Then O beloved! By your Lord, they shall not be Muslims until they make you judge in all disputes among themselves, then they find not any impediment in their hearts concerning whatever you decide, and accept from the core of their hearts.",
  "verse_66": "And if We had made it obligatory on them; that 'kill yourselves or go out leaving your hearth and home, then only a few of them would have done so; and if they do of what they are advised, then it was better for them and stronger in establishing faith.",
  "verse_67": "And if it had been so, then We would have certainly given them a great reward from Our self.",
  "verse_68": "And We would surely have guided them to the straight path.",
  "verse_69": "And he who obeys Allah and His Messenger, then he will get the company of those who have been blessed by Allah, viz. the Prophets, and the truthful, and martyrs and the righteous, and what good companions they are!.",
  "verse_70": "This is the bounty from Allah, And Allah is Sufficient, Knower.",
  "verse_71": "O believers! Take precaution, then march forth towards enemies in bits or go forth altogether.",
  "verse_72": "And among you someone is he, who will indeed tarry behind, then if any calamity comes to you he says, 'It was Allah's favor on me that I was not present with them.'",
  "verse_73": "And if you get bounty of Allah, then he would certainly say, as if there was no friendship between you and him; I wish I had been with them, then I would have gained a great gain.",
  "verse_74": "Then let them who sell the worldly life for the Hereafter fight in the way of Allah; and whoso fights in the way of Allah, then he is slain or be he victorious then soon We shall give him a great reward.",
  "verse_75": "And what happened to you that you fight not in the way of Allah, and for the weak men and women and children who are praying, 'O our Lord! Take us out of this town whose people are unjust and give us any defender from Yourself and give us any helper from Yourself.",
  "verse_76": "The believers fight in the way of Allah and the infidels fight in the way of the devil, then fight against the friends of Satan's; undoubtedly, the Satan's strategy is weak.",
  "verse_77": "Have you not observed those to whom it was said, 'restrain your hands, and establish prayer and pay the specified charity (Zakat)', then when fighting was made obligatory on them, then some of them began to fear people as they should fear Allah or even more than that; and said they, 'O our Lord! Why have you prescribed fighting on us, You would have allowed us to live for a short period.' Say you, 'the enjoyment of the world is little and the Hereafter is better for the Godfearer, and you shall not be wronged a single thread (a least).",
  "verse_78": "Wherever you may be, death will overtake you, though if you be in strong forts. And if some good reaches them, then they say, 'this is from Allah and if some bad reaches them, then they say, 'this has come from you. Say you, 'All is from Allah. Then what happened to them; they seem not to understand anything.",
  "verse_79": "O Listener! Whatsoever good reaches to you is from Allah, and whatsoever bad reaches to you is from yourself. And O beloved! We sent you as a Messenger to all mankind and Allah is Sufficient as Witness.",
  "verse_80": "Whoso obeys the Messenger has indeed obeyed Allah, and whoso turns away his face, then We did not send you to save them.",
  "verse_81": "And they say, 'we obeyed,' but when they go forth from your presence, then a group of them makes plan in the night against what they had said; and Allah writes down their night plans, then O beloved! You, overlook them and trust in Allah. And Sufficient is Allah as a Disposer of affairs.",
  "verse_82": "Then do they not ponder in Quran? And if it had been from other than Allah, then they would surely have found therein much discrepancy.",
  "verse_83": "And when there comes to them any matter of satisfaction or of fear, they spread it about; and if they had referred it towards the Messenger and their men of authority, then surely they would have known its reality from those who investigate and can draw conclusion. And if there had not been the grace of Allah and His Mercy upon you, then surely you would have followed the devil save a few of you.",
  "verse_84": "Then O beloved! Fight in the way of Allah, you shall not be taxed except for yourself and persuade the Muslims; it is likelihood that Allah would withhold the fierceness of infidels. And the force of Allah is strongest and His torment hardest.",
  "verse_85": "Whoso makes a good intercession, there is a share in it for him and whoso makes an evil intercession, there is a share in it for him. And Allah has power over everything.",
  "verse_86": "And when you are greeted with any word of greeting, then greet him back with a better word than it or return the same. Undoubtedly, Allah is Reckoner of everything.",
  "verse_87": "Allah is, besides Whom there is none to be worshiped. And He will certainly gather you on the Day of Resurrection of which there is no doubt. And who is more truthful in his word than Allah.",
  "verse_88": "And what happened to you that you are divided into two parties regarding hypocrites? And Allah upset them for their deeds. Do you desire to guide him whom Allah led astray? And whom Allah leads astray you shall never find a way for him.",
  "verse_89": "They wish that you should also become disbelievers as they became disbelievers, so that you may all become equals, then take not anyone of them as your friend unless they leave their homes and hearths in the way of Allah, again if they trun faces, then seize them and kill them wherever you find them and take not any of them as friends or helpers.",
  "verse_90": "Except those who are connected with such a people between whom and you there is a pact, or they come to you because their hearts have no strength to fight against you or fight their own people. And if Allah had so pleased, He would certainly have given them control over you, then they would have surely fought with you. So if they keep aloof from you and fight you not, and make you an offer of peace, then Allah opened no way for you against them.",
  "verse_91": "Now you will find some such other who desire that they may be safe from you and may be safe from their people too, whenever their people turn them towards mischief, they fall head-long into it, then if they do not keep aloof from you and nor offer you peace and withhold not their hands, then seize them and kill them wherever you find. And these are against whom We gave you clear authority.",
  "verse_92": "And it is not befitting Muslims to shed the blood of Muslim save by a mischance and he who kills any Muslim unknowingly, then he has to free a Muslim slave and blood compensation to be paid to the family of the deceased but that they forgo. Then if he is from a people who is your enemy and he is himself a Muslim then there is only the freeing of a Muslim slave, and if he is from a people between whom and you there is a pact, then the blood compensation be delivered to his family and the freeing of a slave Muslim, but whose hand does not reach this (finds no means to free a slave Muslim), then he should fast for two consecutive months, this is his repentance near Allah. And Allah is Knowing, Wise.",
  "verse_93": "And whoso kills a Muslim willfully, then his recompense is Hell, abiding therein for a long time and Allah's wrath is upon him and cursed him and prepared for him a great torment.",
  "verse_94": "O believers! when you march forth for a crusade, then make proper investigation and he who greets you, say not to him, you are not Muslim, you seek the goods of living world, then with Allah there are spoils abundant, you too were such before, then Allah conferred His favor on you; so you are duty-bound to investigate. Undoubtedly, Allah is Aware of what you do.",
  "verse_95": "Those Muslims who sit aloof from the fighting without excuse and those who strive in the way of Allah with their wealth and lives are not equal. Allah exalted in rank those who strive with their wealth and lives over those who sit aloof. And Allah promised good to all. And Allah has preferred the strivers over the sitters by a great reward.",
  "verse_96": "From Him, ranks and forgiveness and mercy. And Allah is Forgiving, Merciful.",
  "verse_97": "Those whose souls are taken out by angels while they were wronging themselves the angels say to them, 'what were you in'? They say 'We were weak in the land.' They say 'Was not Allah's earth spacious so that you might have emigrated in it' Then the abode of such people is Hell, and an evil returning place is that.",
  "verse_98": "Except those who are- suppressed, men and women and children who are unable to devise a plan or of finding any way.",
  "verse_99": "Then it is likelihood that as for such Allah will pardon. And Allah is Pardoning, Forgiving.",
  "verse_100": "And he who will come out leaving his home and hearth in the way of Allah will find abundant place and space in the earth. And he who comes out from his home, emigrating towards Allah and Messenger, then death overtakes him, then his reward lies on Allah, And Allah is Forgiving, Merciful?",
  "verse_101": "And when you journey in the land, there is no sin of you that you offer your some prayer by shortening it, if you fear that the infidels will afflict you. Undoubtedly, the infidels are your open enemies.",
  "verse_102": "And O beloved! (Prophet) when you are amidst them, then lead them in prayer, then let a party of them be with you and let them take their arms, then when they have finished their prostrations, then moving from there they should go to your rear; and now let other party who had not participated in the prayer at that time come and be your follower in the prayer and let them also take their means of protection and weapons; the infidels wish that in case you become negligent of your arms and your baggage, then once they may fall upon you. And there is no fault upon you, if you are in trouble due to rain or you are sick that you put aside your arms, and you carry your means of protection with you. Undoubtedly, Allah has prepared for the infidels a degrading torment.",
  "verse_103": "Then when you have finished your prayer, remember Allah, standing, sitting and lying on your sides; then when you are secure, establish prayer as usual; undoubtedly, the prayer is a fixed time obligation on Muslims.",
  "verse_104": "And slacken not in seeking infidels, if you are troubled, then they too are troubled as you are troubled; and you hope from Allah what they hope not. And Allah is Knowing, Wise.",
  "verse_105": "O beloved! (Prophet) undoubtedly, We sent down to you the Book with truth, that you may judge amongst people as you are shown by Allah. And quarrel not from the side of deceivers.",
  "verse_106": "And seek forgiveness of Allah. Undoubtedly Allah is Forgiving, Merciful.",
  "verse_107": "And dispute not for those who deceive their souls. Undoubtedly, Allah loves not any big deceitful sinner.",
  "verse_108": "They hide from men, but hide not from Allah, and Allah is with them when they design in their hearts that thing which is disliked by Allah. And Allah has encompassed their doings.",
  "verse_109": "Do you hear? It is you who have contended on behalf of them in the life of this world; then who will contend on behalf of them with Allah on the Day of Judgement or who will be their pleader?",
  "verse_110": "And who so does evil or wrongs his own soul, thereafter seeks forgiveness of Allah shall find Allah Forgiving, Merciful.",
  "verse_111": "And whoso earns sin, then his earning is against his own soul only. And Allah is Knowing and Wise.",
  "verse_112": "And whoso earns a fault or sin, then casts it upon any innocent, certainly he has borne a calumny and a clear sin.",
  "verse_113": "And O beloved. (Prophet)! If there had not been the grace and mercy of Allah upon you, then some people of them had wished to defraud you. And they are misleading themselves only and they will not hurt you in anything. And Allah sent down to you the Book and Wisdom and taught you what you did not know, and great is the grace of Allah upon you.",
  "verse_114": "There is no good in most of their counsels, but whoso commands charity or good things or making peace amongst people. And who so does this for seeking the approvals of Allah, We shall soon give him a great reward.",
  "verse_115": "And whoso opposes the Messenger after the right way has become clear and follows a way other than the way of Muslims, We shall leave him on his own condition and shall cause him to enter Hell; and what is an evil place of returning!",
  "verse_116": "Allah forgives not that anyone be associated with Him as partner but whatever is below that He forgives to whomsoever He pleases. And whoso associates with Allah any partner has indeed strayed far away.",
  "verse_117": "These polytheists worship not besides Allah but some females and worship not but a rebel Satan (devil).",
  "verse_118": "Whom Allah cursed. And he said, 'I swear, I will certainly take some fixed portion of your bondmen.",
  "verse_119": "'I swear, I will certainly lead them astray and certainly I will excite in them desires and will certainly say to them that they would cut the ears of cattle and will certainly-bid them that they would alter the creation of Allah? And he who takes Satan for a friend besides Allah suffered a manifest loss.",
  "verse_120": "Satan makes them promises and stirs in them desires, and Satan makes them not promises but deception.",
  "verse_121": "Their destination is Hell, they will not find a place to escape therefrom.",
  "verse_122": "And those who believed and did good deeds, soon We shall cause them to enter gardens beneath which flow rivers abiding therein forever. Promise of Allah is true and whose word is more truthful than Allah.",
  "verse_123": "Neither the work depends on your wishful thinking, nor on the desires of the people of the Book, whoso will do evil shall be requited thereof and he shall not find, besides Allah, any protector or helper.",
  "verse_124": "And whoso will do some good deeds, may be a male or female and be a Muslim, then they shall enter Paradise, and they shall not be wronged a bit.",
  "verse_125": "And whose religion is better than he who submits his face to Allah and he is a doer of good and follows the faith of Ibrahim who was separate from every falsehood. And Allah took Ibrahim for His fast friend.",
  "verse_126": "And to Allah belongs all that is in the heavens, and all that is in the earth. And over everything Allah has control.",
  "verse_127": "And they ask you your verdict concerning women. Say them, Allah gives verdict to you concerning them and that which is recited to you in Quran concerning the orphan girls whom you give not what is prescribed for them, and turn your faces from marrying them, and concerning the weak children, and concerning this that you maintain justice towards orphans. And whatever good you do, then Allah is Aware of it.",
  "verse_128": "And if any woman be afraid of high handedness or disregard from her husband, then there is no sin on them that they may reconcile among themselves and reconciliation is best. And the hearts are entangled into greediness. And if you do good and be God-fearing, then Allah is Aware of your doings.",
  "verse_129": "And it would never be possible for you that you keep women on equal footing, however much you may desire it, then this should not be the case that you should incline wholly towards one side so that you leave other hanging in the midst. And if you do good and be God-fearing, then undoubtedly, Allah is Forgiving, Merciful.",
  "verse_130": "And if they both separate, then Allah will make each of you independent from the other out of His bounty. And Allah is Bountiful, Wise.",
  "verse_131": "And to Allah belongs whatever is in the heavens and whatever is in the earth. And undoubtedly, Allah has enjoined those who were given the Book before you and you too that remain fearing Allah. But if you commit infidelity, then undoubtedly, to Allah belongs whatever is in the heavens and whatever is in the earth. And Allah is Carefree, All-Praised.",
  "verse_132": "And to Allah belongs whatever is in the heavens and whatever is in the earth. And Allah is Sufficient as real Doer.",
        "verse_133": "O people! if He pleases, He can take you away and bring others. And Allah has full power to do this.",
  "verse_134": "Whoso desires the reward of the world, then with Allah is the reward both of the world and of the Hereafter. And Allah is Hearing, Seeing.",
  "verse_135": "O believers stand firmly for justice, giving witness for Allah, may be therein your own loss, or of your parents or of your relations. Against whom you be a witness, he be a rich or be a poor, in any case Allah has more power than anyone over them, therefore follow not passion lest you may be far away from justice; and if you distort or turn your faces, then Allah is Aware of your doings.",
  "verse_136": "O believers! Keep faith in Allah and His Messenger and the Book which He sent down upon His Messenger and the Book which was sent down before. And who denies Allah and His angels and His Books and His Messengers and the Last Day, then certainly he strayed far away.",
  "verse_137": "Undoubtedly, those who accepted faith, then became infidels, then again accepted faith, then became infidels, then after increased in infidelity, Allah will never forgive them nor will show them the way.",
  "verse_138": "Give glad tidings to the hypocrites that for them is the painful torment.",
  "verse_139": "Those who take infidels for friends instead of Muslims. Do they seek honor with them, then all honor is for Allah.",
  "verse_140": "And undoubtedly Allah has already sent down to you in the Book that, when you hear the signs of Allah being denied and is being ridiculed, then sit not with them until they engage in some other conversation, otherwise you would be like them too. Undoubtedly, Allah will gather hypocrites and infidels-all in Hell.",
  "verse_141": "Those who use to watch your position, then if you get victory from Allah, they say, 'Were We not with you? And if the infidels had a share, then they say to them, had we not control over you? And we protected you from the Muslims. Then Allah will decide between you all on the Day of Judgement. And Allah will not make a way for the infidels against Muslims.",
  "verse_142": "Undoubtedly, the hypocrites are likely to deceive Allah in their own conjecture, and it is He Who will kill them making them negligent, and when they stand up for prayer, they stand up with a defeated soul (lazily) making a show to the people and remember not Allah but little.",
  "verse_143": "They are wavering in the midst neither of this side nor of that. And whom Allah leads astray, you shall not then find a way for him.",
  "verse_144": "O believers! Take not infidels for friends except Muslims. Do you wish that you may provide clear proof for Allah against you?",
  "verse_145": "Undoubtedly, the hypocrites are in the lowest section of the Hell, and you shall never get any helper for them.",
  "verse_146": "But those who repented, and mended (themselves) and hold fast by the rope of Allah and made their religion purely for Allah, then these are with the Muslims. And soon Allah will give a great reward to Muslims.",
  "verse_147": "And what will Allah do by tormenting you, if you accept the just and accept faith. And Allah is Responsive, Aware.",
  "verse_148": "Allah likes not the uttering ofevil words except one who is being oppressed. And Allah is Hearing, Knowing.",
  "verse_149": "If you do any good openly or in secret or pardon anyone's evil, then undoubtedly, Allah is Pardoning, Powerful.",
  "verse_150": "Those who disbelieve in Allah and His Messengers and desire to separate from Allah His Messengers and say, 'some we believe and other some we deny,' and desire to envisage a way between believing and disbelieving.",
  "verse_151": "They are the infidels in truth and We have already prepared a degrading torment for the infidels.",
  "verse_152": "And those who have believed in Allah and in all of His Messengers and have made no distinction between any of them in believing, soon Allah will give their reward; and Allah is Forgiving, Merciful.",
  "verse_153": "O beloved (Prophet) the people of the Book ask you to bring down a book upon them from heaven; but they have already asked Moses a greater thing than this, that they said, \"show us Allah openly,\" then, thunder overtook them for their sins, then they took the calf after clear sings had come to them; but We pardoned even that, and We gave Moses a clear dominance.",
  "verse_154": "Then We raised the Tur (Mountain) over them for taking covenant with them and said to them, 'enter the gate prostrating\", and said to them, 'transgress not in the matter of Sabbath', (Saturday of the Jews) and We took from them a firm covenant.",
  "verse_155": "Then We cursed them because of their breaking the covenant and that they denied the signs of Allah, and slaying unjustly the Prophets and for their saying, 'there are covers on our hearts'. But Allah has sealed their hearts because of their infidelity, so that they do not accept faith but little of them.",
  "verse_156": "And for this that they committed infidelity and raised a tremendous calumny over Mariam (Mary).",
  "verse_157": "And for their saying, 'We slew the Messiah, Jesus son of Mary, the Messenger of Allah; whereas they slew him not, and neither crucified him, but one was made like him for them. And those who are differing about him, certainly, they are in doubt regarding him. They have not the least knowledge about it, but merely following a conjecture, and undoubtedly, they slew him not.",
  "verse_158": "But Allah raised him up towards Himself, and Allah is Dominant, Wise.",
  "verse_159": "There is not any one of the people of the Book, who will not believe in him before his (Jesus Christ's) death, and he will be a witness against them on the Day of Judgement.",
  "verse_160": "Then on account of great injustice of the Jews, We made unlawful for them some of those pure things that were lawful for them, and because of that they kept away many from the way of Allah.",
  "verse_161": "And because they took usury whereas they were prohibited from it, and they consumed people's wealth unjustly, and those of them who became infidels, We have prepared a painful torment for them.",
  "verse_162": "Yes, but those of them who are firm in knowledge are believers, they believe in that which (O beloved Prophet) has been sent down to you and that which was sent down before you, and the establishers of prayer and giver of poor-due (Zakat) and the believers in Allah and the Last Day; to such We shall soon give a great reward.",
  "verse_163": "Undoubtedly, O beloved Prophet! We sent to you the revelation as We sent revelation to Nuh (Noah) and the Prophets after him, and We sent revelation to Abraham, and Ismail and Ishaque and Yaqoob and his sons and 'Isaa and Ayub and Yunus and Haroon and Sulaiman; and We gave to Daud (David) the Book Zaboor (Psalms).",
  "verse_164": "And to Messengers whom We have already mentioned to you before and to those Messengers whom We have not mentioned to you. And Allah in fact spoke to Musa.",
  "verse_165": "The Messengers bearing good tidings and warning, so that mankind might not have any excuse against Allah after Messengers. And Allah is Dominant, Wise.",
  "verse_166": "But O beloved Prophet! Allah is Witness to that what He has sent down to you. He has sent it down with His knowledge.And the angels are witnesses. And Allah is Sufficient as a Witness.",
  "verse_167": "Those who committed infidelity and kept others away from the way of Allah, undoubtedly, they strayed far away.",
  "verse_168": "Undoubtedly, who committed infidelity and transgressed, Allah will never forgive them, nor will show them any way.",
  "verse_169": "But the way of the Hell, that they will abide therein for ever. And this is easy for Allah.",
  "verse_170": "O people! This Messenger has come to you with truth from your Lord, then believe (in him) for your own good. And if you commit infidelity, then undoubtedly, to Allah belongs whatever is in the heavens and in the earth. And Allah is Knowing, Wise.",
  "verse_171": "O people of the Book! Exceed not in your religion, and do not say of Allah anything but truth. The Maseeh, 'Isaa son of Maryam (Mary), is only the Messenger of Allah and His Word, that was sent to Mary and a spirit from Him, then believe in Allah and His Messengers and do not say, 'three'. Refrain for your own good. Allah the only One God. Far is it from His Holiness that He should have a son. To Him belongs whatever is in the heavens and whatever is in the earth. And Allah is Sufficient, as real Doer.",
  "verse_172": "Maseeh scrons not to be a bondman of Allah nor do the near angels. And whoso scorns from His bondage and is proud, then soon He will gather them all towards Himself.",
  "verse_173": "Then those who accepted faith and did good deeds, after paying them their wages in full, He will give them more out of His Grace, and those who were scornful and proud, He will give them a painful torment.",
  "verse_174": "And they will not find for themselves besides Allah any supporter or helper.",
  "verse_175": "O people! Undoubtedly, a manifest argument has come to you from Allah, and We have sent down to you a manifest light.",
  "verse_176": "Then those who believed in Allah and hold His rope firmly, then soon Allah will cause them to enter His Mercy and Grace and will show them straight way towards Himself.",
  "verse_177": "O beloved Prophet! They ask you for a decree. Say you, \"Allah decrees to you in respect of a person who leaves neither father nor child that if a man dies and has no child and he has a sister, then his sister has half in his heritage and the man will be the heir of his sister, if the sister has no child. Then if there are two sisters then they have two-third in the heritage, and if there are brother, sister, males and females both, then the share of male is equal to the shares of two women. Allah explains for you clearly so that you may not go astray. And Allah knows everything.\"",
    },
    "count": 177
}
