{
    "name": "ad-Dukhan",
    "index": "044",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Ha — Mim.",
  "verse_2": "By this luminous Book.",
  "verse_3": "Undoubtedly We sent it down in a blessed night, verily We are to warn.",
  "verse_4": "Therein every affair of wisdom is divided.",
  "verse_5": "A command from Us, Verily, We are to send.",
  "verse_6": "A mercy from your Lord; undoubtedly, He, hears, knows.",
  "verse_7": "He Who is the Lord of the heavens and the earth and whatsoever is in between if you are convinced.",
  "verse_8": "None is to be worshipped but He. He gives life and causes death, your Lord and the Lord of your forefathers.",
  "verse_9": "Nay, but they are in doubt, playing.",
  "verse_10": "Therefore wait you the day when the sky will bring a clear smoke.",
  "verse_11": "That it shall cover the people. This is a painful torment.",
  "verse_12": "They will say that day, 'O our Lord! Remove from us the torment, We believe'.",
  "verse_13": "Whence they are to accept admonition, whereas there has already come a clear Messenger.",
  "verse_14": "Then they turned away from him and said, 'He is tutored, madman'.",
  "verse_15": "We let loose the torment for some time, you will again do the same.",
  "verse_16": "The day when We will seize the greatest seizing, verily We are to take vengeance.",
  "verse_17": "And undoubtedly, We tested the people of Firawn before them, and an honorable Messenger came to them.",
  "verse_18": "Saying, 'hand over to me the bondmen of Allah. Verily Ham a trusted Messenger for you.",
  "verse_19": "'Rise not up against Allah, I bring to you a clear authority.",
  "verse_20": "'I take refuge of my Lord and your Lord, lest you stone me.",
  "verse_21": "'And if you believe not in me, go you apart from me.'",
  "verse_22": "Then he called upon his Lord, these are guilty people.",
  "verse_23": "We commanded that go forth with My bondmen, necessarily, you shall be followed.",
  "verse_24": "And leave you the river open from place to place, undoubtedly the host shall be drowned.",
  "verse_25": "How many gardens and springs, they left behind.",
  "verse_26": "And cornfields and nice houses.",
  "verse_27": "And comforts wherein they were free from care.",
  "verse_28": "We did thus, and We made another people to inherit them.",
  "verse_29": "And the heavens and the earth did not shed tears for them, nor were they given respite.",
  "verse_30": "And undoubtedly, We delivered the children of Israel from the abasing torment.",
  "verse_31": "From Firawn, he was surely haughty and of the extravagant.",
  "verse_32": "And undoubtedly, We chose them knowingly from among the people of that time.",
  "verse_33": "And We bestowed them the signs wherein there was clear reward.",
  "verse_34": "These men do say.",
  "verse_35": "That is not but our first death and we shall not be raised?",
  "verse_36": "'Bring back then, our fathers if you are truthful.'",
  "verse_37": "Are they better or the people of Tubba and those before them whom We destroyed? Verily they were culprits.",
  "verse_38": "And We made not the heavens and the earth and whatsoever is in between them in play.",
  "verse_39": "We made not them but with truth, but most of them know not.",
  "verse_40": "Undoubtedly, 'the Day of Judgement is the term appointed for all of them.",
  "verse_41": "The day when a friend shall not avail a friend at all and nor they shall be helped.",
  "verse_42": "Save those on whom Allah has mercy. Undoubtedly He is the Honorable, the Merciful.",
  "verse_43": "Verily the tree of Zaqqqum (Cactus).",
  "verse_44": "Is the food of the sinners?",
  "verse_45": "Like molten copper bubbles in the belies.",
  "verse_46": "As boiling water bubbles.",
  "verse_47": "Seize him and drag him forcibly towards the center of the blazing fire.",
  "verse_48": "'Then pour over his head the torment of boiling water.'",
  "verse_49": "Taste it, Yes, certainly, you are the honorable, the benignant.",
  "verse_50": "Undoubtedly, it is that in which you were doubting.",
  "verse_51": "Undoubtedly, the God fearing are in a place of security.",
  "verse_52": "In the gardens and springs.",
  "verse_53": "They shall wear fine silk and brocade facing one another.",
  "verse_54": "Thus it is, and We got them married to black, and bright large eyed maidens.",
  "verse_55": "They will ask for therein every kind of fruit in peace and security.",
  "verse_56": "They will not taste death therein, other than the first death, and Allah saved them from the torment of the fire.",
  "verse_57": "By the grace of your Lord. This is the supreme victory.",
  "verse_58": "And We have made this Quran easy in your tongue so that they may understand.",
  "verse_59": "So wait you, they too are waiting." },
    "count": 59
}
