{
    "name": "al-Hadid",
    "index": "057",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
       "verse_1": "Whatever is in the heavens and in the earth glorifies Allah; and it is He the Esteemed One the Wise.",
        "verse_2": "For Him is the Kingdom of the heavens and the earth, He gives life and causes to die; and he can do everything.",
        "verse_3": "He is the First, He is the Last, He is the Manifest, He is the Hidden and He knows everything.",
        "verse_4": "It is He Who created the heavens and the earth in six days, then seated Himself upon the Throne befitting to His Dignity. He knows what penetrates in the earth and what comes forth from it, and what comes down from heaven and what ascends into it. And He is with you wherever you may be. And Allah is seeing your works.",
        "verse_5": "For Him is the Kingdom of the heavens and the earth. And towards Allah is the return of all affairs.",
        "verse_6": "He brings the night into the day and brings the day into the night. And He knows the thoughts of the hearts.",
        "verse_7": "Believe in Allah and His Messenger and spend in the way of Allah out of that to which He has made you heirs, And those of you who believed and spent in the way of Allah, for them is the great reward.",
        "verse_8": "And what is to you that you believe not in Allah whereas the Messenger is calling you to believe in Allah; and undoubtedly, He has already taken a covenant from you if indeed you believe.",
        "verse_9": "It is He Who sends down upon His bondman bright signs so that He may bring you forth from the darkness towards the light. And verily Allah is Kind and Merciful to you.",
        "verse_10": "And what is to you, that you spend not in the way of Allah, whereas to Allah belongs the heritage of the heavens and the earth altogether. Those of you who spent and fought before the victory of Mecca are not equal. They are greater in rank than those who spent and fought after victory. And to all has Allah already promised the reward of the paradise. And Allah is Aware of your deeds.",
        "verse_11": "Who is he who may lend to Allah a good loan, and He may double it for him and there is an honorable reward for him.",
        "verse_12": "The day when you shall see the believing man and women that their light run before them and on their right, it is being said to them, 'today the happiest tidings for you are those Gardens beneath which the streams flow, wherein you will abide. This is the supreme triumph.",
        "verse_13": "The day when the hypocrite men and the hypocrite women will say to Muslims, 'look towards us, so that we may take something from your light'. It will be said to them', 'go you back and seek there a light. They will go back, henceforth a wall shall be set up between them, in which there is a door. The inside of it has mercy and the outside has torment.",
        "verse_14": "The hypocrites will call the Muslims, saying, 'were we not with you?' They will say, 'why not, you put your souls in temptation and looked out for the evils of Muslims and doubted and your vain desires deceived you till the decree of Allah came and the great Deceiver deceived you regarding the decree of Allah.",
        "verse_15": "Therefore this day no ransom shall be accepted from you or from the manifest infidels. Your destination is the Fire. It is your friend, and what an evil end it is!",
        "verse_16": "Has not the time arrived for the believers that their hearts should lean for the remembrance of Allah and for the truth which has come down, and that they should not become like those who were given the Book before, then the term was prolonged for them, so their hearts were hardened? And many of them are disobedients.",
        "verse_17": "Know that Allah gives life to the earth after its death. Surely We explained the signs to you, that you may understand.",
        "verse_18": "Surely, the alms giving men and alms giving women and those who gave a goodly loan to Allah, it shall be doubled for them and for them is an honorable reward.",
        "verse_19": "And those who believe in Allah and His Messengers, they are the perfect truthfuls and witnesses against others before their Lord. For them is their reward and their light, and those who disbelieved and belied Our signs, they are the inmates of Hell.",
        "verse_20": "Know that the life of the world is not but a sport and amusement and an adornment and a source of boasting among yourselves and desiring multiplication in riches and children against one another. It is like the rain whose vegetation pleased the tillers, then it dried up that you see it yellow then it was trampled into pieces. And in the Hereafter there is severe torment and forgiveness from Allah and His pleasure. And the life of the world is nothing but a deceitful wealth.",
        "verse_21": "Go forward towards the forgiveness of your Lord and towards a paradise of which the breadth is as the width of the heavens and the earth prepared for those who believed in Allah and His Messenger. This is the grace of Allah; He bestows it upon whomsoever He pleases. And Allah is the Possessor of great grace.",
        "verse_22": "No calamity reaches either in the earth or in your own persons, but it is in a Book, before We create it; undoubtedly, it is easy for Allah.",
        "verse_23": "So that you may not grieve over what is lost to you, nor rejoice over what is given to you and Allah loves not any exultant, boastful.",
        "verse_24": "Such as are niggardly and command men to be niggardly. And whosoever turns away, then surely, Allah is the Self-Sufficient, All-Praised.",
        "verse_25": "Verily, We have sent Messengers with arguments and have sent down with them the Book and the Balance of justice, so that men might uphold justice. And We have sent down iron, wherein is great strength and uses for mankind, and in order that Allah may see him who helps Him and His Messengers without seeing. Surely, Allah is Powerful, Dominant.",
        "verse_26": "And undoubtedly, We sent Nuh and Ibrahim and We placed Prophet hood and the Book in their offspring. So some of them were guided, but most of them are disobedient.",
        "verse_27": "Then We sent after them Our other Messengers following in their footsteps, and We sent following, Isa son of Maryam and bestowed him the Injil. And We placed tenderness and mercy in the hearts of his followers. And as for adopting monasticism, they invented it into the religion on their own accord, We prescribed it not for them, yes this innovation they created for seeking the pleasure of Allah, but they observed it not as it was to be observed, so We gave the believers of them their reward, but most of them are disobedient.",
        "verse_28": "O believers! Fear Allah, and believe in His Messenger, He will give you a twofold portion of His mercy and will provide for you a light wherein you will walk, and will grant you forgiveness. And Allah is Forgiving, Merciful.",
        "verse_29": "This is so in order that the non-believing people of the Book may know that they have no control over the grace of Allah and that the grace is entirely in the hands of Allah. He gives to whomsoever He pleases. And Allah is the Possessor of great grace."
      },
    "count": 29
}
