{
    "name": "Yunus",
    "index": "010",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif-Lam Ra. These are the verses of the Book of wisdom.",
        "verse_2": "Have the people wondered that We sent down revelation to a man among them, warn the people, and give glad tidings to the believers, that they have the position of truth with their Lord? The infidels said, 'This is a manifest sorcerer.'",
        "verse_3": "No doubt, your Lord is Allah, Who made the heavens and earth in six days, then seated Himself on the Throne befitting to His Dignity, He plans the work. No intercessor is there but after His leave. This is Allah your Lord, then worship Him. Do you then not ponder?",
        "verse_4": "To Him you all are to return. The promise of Allah is true. No doubt, He creates for the first time, then He shall reproduce it after destruction, so that He may give the reward of justice to those who believed and did good deeds. And for the infidels the boiling drink and painful torment, the recompense of their infidelity.",
        "verse_5": "It is He Who has made the sun shining, and the moon glittering, and appointed for it stages, so that you may know the number of years and calculation. Allah has not created that but in truth. He explains fully the signs for the people of knowledge.",
        "verse_6": "No doubt, the coming of night and day alternately and whatever Allah has produced in the heavens and earth, therein are the signs for those who fear.",
        "verse_7": "No doubt, those who hope not to meet Us and are well- pleased with the life of the world and are contented with it, and those who are neglectful of Our signs.",
        "verse_8": "Their abode is Hell-the recompense of their earnings.",
        "verse_9": "No doubt, who believed and did good deeds, their Lord will guide them on account of their faith, beneath them rivers will be flowing in the gardens of delight.",
        "verse_10": "Their prayer therein shall be this, 'Sanctity to you O Allah', and the opening word at the time of their greeting is 'salaam' (peace), and the end of their prayer is 'all praise be to Allah, Who is the Lord of entire worlds!",
        "verse_11": "And if Allah would have hasten evil to people as they hasten for the good, then their promised term would have already been completed. So We leave those who hope not to meet Us, that they wander in their contumacy.",
        "verse_12": "And when trouble touches man, he calls Us lying down and sitting down and standing up; then when We remove his trouble, he passes on as if he never called Us at the time of any trouble touching him. Thus it has been made fair seeming to the extravagant their deeds.",
        "verse_13": "And no doubt, We ruined generations before you, when they crossed the limit, and their Messengers came to them with bright evidences, and they were not such as to believe. Thus We recompense the guilty.",
        "verse_14": "Then We made you to succeed after them, that We may see how you act.",
        "verse_15": "And when Our clear signs are recited unto them, then those who hope not to meet Us begin to say, 'Bring a Quran other than this, or alter it.' Say you, 'It is not for me to change it on my own accord. I only follow what is revealed to me, If I disobey my Lord, then I fear the torment of the great Day!'",
        "verse_16": "Say you, 'If Allah had willed, then I would have not recited it to you, nor would He have made it known to you; then I have already passed a portion of my life amongst you before it. Have you then no wisdom?'",
        "verse_17": "Then who is more unjust than one who forges lie against Allah or belies His signs? Undoubtedly, the guilty will have no good.",
        "verse_18": "And they worship besides Allah that which neither harms them nor does any good and say, 'These are our intercessors with Allah.' Say you, 'Do you tell Allah the thing which is not in His Knowledge either in heavens or on earth. Holy is He and exalted is He from their association.'",
        "verse_19": "And the people were only one nation, then differed. And if a Word from your Lord had not occurred before, then their differences would have been decided between them.",
        "verse_20": "And they say, 'Why has not a sign been sent down to them from their Lord?' Say you, 'the hidden is for Allah, now wait, I am also waiting with you.'",
        "verse_21": "And We make the men to taste mercy after any trouble had touched them, forthwith they begin to play trick with Our signs. Say you, 'The secret planning of Allah is swiftest.' No doubt, Our angels are writing your devices.",
        "verse_22": "It is He Who conveys you on the land and sea; Until when you are in the ship and they sail with them with a fair breeze and they rejoiced thereat, there came upon them a hurricane wind and the waves from every side overtook them, and they thought that they were encircled, then at that time, they call Allah being purely His bondmen, that if You would save us from this, we shall then surely be thankful.",
        "verse_23": "Then when Allah saves them, they forthwith begin to commit excesses in the land wrongfully. O people! Your excesses are only against your own selves, enjoy it till your living in the world, then you are to return towards Us, at that time We will inform you what you used to do.",
        "verse_24": "The example of the life of the world is like that water which We have sent down from the sky, on account of which the vegetation of earth came out in abundance, of which men and cattle eat, till when the earth took on its ornament and was fully adorned, and its owners thought that it is under their authority; there came upon it Our command by night or by day, then We made it mown down as if it had not existed yesterday. Thus We explain fully Our signs for a people who reflect.",
        "verse_25": "And Allah calls towards the home of peace. And guides whomsoever He will to the straight path.",
        "verse_26": "For the good doers there is good and even more than that. And neither darkness nor insult will cover their faces. It is they who are the inhabitants of Paradise; they will abide therein forever.",
        "verse_27": "And those who earned evils, then the recompense of the evil is the like of it, and insult will cover them. There will be none to defend them against Allah; as if their faces have been covered by patches of the dark night. It is they who are the people of the Hell, they will abide therein forever.",
        "verse_28": "And the Day when We shall raise all of them together, then will say to the polytheists, 'remain at your places, you and your associates,' then We shall separate them from the Muslims, and their associates will say to them, 'When you used to worship us.'",
        "verse_29": "Then Allah is Sufficient as Witness between us and you, that we were not aware of your worship.",
        "verse_30": "Here every soul will test what it sent before, and they shall be returned to Allah, Who is their True Master, and their all fabrications shall be lost from them.",
        "verse_31": "Say you, 'Who provides you from the heaven and the earth, or who is the master of ear and eyes, and who brings out the living from the dead and brings out the dead from the living and who plans all affairs? They will then now say, 'Allah,' then say, you, 'why do not you fear then?'",
        "verse_32": "This then is Allah, your True Lord. What remains then after the truth but erring? Then where are you turning away.",
        "verse_33": "Thus the word of your Lord is proved against the transgressors that they will not believe.",
        "verse_34": "Say you, 'Is there any of your associates who originates creation, then reproduce after destruction. Say you, 'Allah originates, then He will reproduce after destruction,' then where you are turning away.",
        "verse_35": "Say you, 'is there any of your associates that may guide to the truth? Say you, 'Allah guides to the truth.' Then should He Who guides to the truth be followed, or he who himself finds not the guidance unless is guided? Then what happened to you? How do you judge?",
        "verse_36": "And most of them follow not but conjecture. Undoubtedly, conjecture avails not against truth. No doubt, Allah knows their works.",
        "verse_37": "And this is not the attribute of this Quran, that anyone might fabricate it without being sent down by Allah, Yes it is a confirmation of the former Books, and is the detail explanation of what is written in the Table, there is no doubt in it, it is from the Lord of the worlds.",
        "verse_38": "Do they say, 'He has fabricated it?' Say you, 'Then bring a sura like it, and call upon all whom you could get besides Allah, if you are truthful.",
        "verse_39": "But they have belied that, the knowledge of which they did not get control and they have not yet seen its end, in the like manner have belied those who were before them, then see what became the end of the unjust.",
        "verse_40": "And of them there is one who believes in it, and of them there is one who does not believe in it, and your Lord knows well the mischief makers.",
        "verse_41": "And if they belie you, then say you, 'for me is my doing, and for you is your doing, you are not responsible for what I do, and I am not responsible for what you do.'",
        "verse_42": "And of them are some who give ear to you, then will you make the deaf hear, even though they understand not?",
        "verse_43": "And of them is one who looks at you, then will you guide the blind, even though they do not see?",
        "verse_44": "Unfortunately, Allah does not do injustice to mankind, but men do injustice to themselves.",
        "verse_45": "And the Day when He will raise them, as if they had not stayed in the world but an hour of that Day, they shall mutually recognize. Those who belied the meeting with Allah, remained in full loss and they were not on guidance.",
        "verse_46": "And if We show you some of the things, We are promising to them, or We call you unto Us before, anyhow, they have to return to Us, then Allah is a Witness of what they do.",
        "verse_47": "And for every nation there has been a Messenger, when their Messenger had come to them, it would have been judged unto them with equity and they would not have been wronged.",
        "verse_48": "And they say, 'when this promise will come, if you are truthful.'",
        "verse_49": "Say, you, 'I have no (personal) power of the good and bad for myself but whatever Allah pleases.' For every nation there is a fixed term. When their term will come, then neither they can stay behind for an hour, nor can they advance.",
        "verse_50": "Say you, 'tell me, if His torment comes upon you by night or day, then what is there in for which the guilty are in hurry?'",
        "verse_51": "Will you then believe therein when it would occur actually? Do you now believe, whereas you were hastening for it before?",
        "verse_52": "Then it will be said to the wrong doers, 'Taste the torment everlasting. You will get nothing more as “recompense but whatever you used to earn.”",
        "verse_53": "And they ask you, 'Is that true,' Say you, 'Yes by my Lord? No doubt, that is necessarily true. And you cannot get it tired;'",
        "verse_54": "And if every unjust soul would have owned all that is in the earth, then it would certainly ransom for itself. And they were secretly ashamed in their hearts, when they saw the torment, and it was decided between them with equity and they shall not be wronged.",
        "verse_55": "Listen, no doubt, it is of Allah only whatever is in the heavens and earth. Listen, verily Allah's promise is true, but most of them know not.",
        "verse_56": "He gives life and causes death, and to Him you shall return.",
        "verse_57": "O people! There has come an admonition to you from your Lord, and healing of hearts, and a guidance and a mercy for the believers.",
        "verse_58": "Say you, 'Only Allah's grace and only His mercy, on it therefore let them rejoice.' That is better than all their wealth.",
        "verse_59": "Say you, 'bethink what Allah has sent down to you of provision, you have yourselves made thereof lawful and unlawful.' Say you, 'Has Allah permitted it to you, or you forge lie against Allah?",
        "verse_60": "And what do they fancy who forge lie against Allah that what will be their position on the Day of Resurrection? No doubt Allah is Graceful to people, but most of them are not thankful.",
        "verse_61": "And you are busy in any work, and recite some of Quran from Him, and you people perform any act, We are witnesses over you when you commence it. And there is nothing hidden from your Lord even an atom's weight in the earth or in heaven, and there is nothing smaller than that or greater but it is in a luminous Book.",
        "verse_62": "Listen carefully! No doubt, there is no fear nor any grief upon the friends of Allah.",
        "verse_63": "Those who believed and keep up their duty.",
        "verse_64": "For them are glad tidings in the life of the world and in the Hereafter. The words of Allah are not changed. That indeed is the supreme triumph.",
        "verse_65": "And you be not grieved by their words. No doubt, all honor belongs to Allah. 'It is He Who hears, knows.",
        "verse_66": "Listen, no doubt, all who are in the heavens and all in the earth belong to Allah. And what they are following those who are calling associates besides Allah? They follow nothing but fancy. And they are doing nothing but conjecturing.",
        "verse_67": "It is He Who has made night for you, that you may rest therein, and made the day enlightening. No doubt, therein are signs for those who listen.",
        "verse_68": "They spoke, Allah has taken to Him a son, 'Holy is He! The Self Sufficient, to Him belongs whatever is in the heavens and whatever is in the earth. You have no authority for this. Do you say against Allah that you know not?",
        "verse_69": "Say you, 'Those who forge lie against Allah they will never prosper.'",
        "verse_70": "They are to pull on a little in the world, then they are to return to Us, then We shall make them taste a severe torment, the recompense of their infidelity.",
        "verse_71": "Recite to them the story of Nuh, when he said to his people. 'O my people! if my standing up and reminding the signs of Allah has offended you, then I relied on Allah only, then do your work unitedly, and complete your work with your false deities, so that nothing may be obscure to you in your work, then do against me what you can and respite me not.",
        "verse_72": "Then if you turn your face, \"then I ask not any wage from you. My wage is only with Allah, and I have been ordered to be of Muslims.",
        "verse_73": "But they belied him, then We delivered him and those who were with him in the ark, and We made them successors, and We drowned those who belied Our signs, then see what the end of those who were warned was.",
        "verse_74": "Then after him We sent other Messengers towards their people, then they brought them bright proofs, but they were not to believe what they had already belied before. Thus We seal the hearts of the transgressors.",
        "verse_75": "Then after them We sent Musa and Haroon to Firawn and his courtiers with Our Signs, then they waxed proud and they were a sinful people.",
        "verse_76": "Then when truth came to them from Us, they said This is surely a manifest magic;",
        "verse_77": "Musa said, 'Do you say such with regard to the truth when it came to you? Is this magic? And magicians do not attain to their goal;",
        "verse_78": "They said, 'Have you come to us, so that you may turn us from that upon which we found our forefathers, and that you two may have greatness in the land? And we are not to believe you two.",
        "verse_79": "And Firawn said, 'Bring me every magician of knowledge.'",
        "verse_80": "Then when the magicians came, Musa said to them, 'Cast down whatever you are to cast.'",
        "verse_81": "Then when they had cast down, Musa said, 'What you have brought is magic. Now Allah will nullify it. Allah rectifies not the work of mischief-makers.",
        "verse_82": "And Allah shows the truth as truth by His words, may the culprits be displeased.",
        "verse_83": "Then none believed Musa but few from the seed of his people fearing from Firawn and his courtiers lest they may compel them to fall back (from Din, i.e., religion). And no doubt, Firawn was high-headed in the land, and no doubt he crossed the limit.",
        "verse_84": "Musa said, 'O my people, if you have believed in Allah, then rely upon Him alone, if you are Muslims.'",
        "verse_85": "They said, 'We relied only upon Allah. Our Lord make us not a test for unjust people.",
        "verse_86": "And deliver us by Your mercy from the infidels.",
        "verse_87": "And We revealed to Musa and his brother, 'Build houses for your people in Egypt, and make your houses the place of prayer, and establish prayer and give glad tidings to Muslims.'",
        "verse_88": "And Musa submitted, 'O our Lord! You have given Firawn and his chief’s adornment and wealth in the life of the world, 'O our Lord! that they may lead people astray from Your path. O our' Lord! Destroy their wealth and harden their hearts, so that they may not believe until they see the painful torment.'",
        "verse_89": "He said, 'The prayers of you both have been accepted, then be steadfast, and follow not the path of ignorants.'",
        "verse_90": "And We led the children of Israel across the sea, then Firawn and his armies followed them with contumacy and oppression, until, when the drawing overtook him, he said, 'I believed, that there is no True Deity except He in Whom the children of Israel believed, and I am Muslim.'",
        "verse_91": "What! Now! And you had been disobedient from before and you had been mischief-monger.",
        "verse_92": "Today We shall cause to swim your dead body, so that you might be a sign to those after you. And no doubt, people are heedless of Our signs.",
        "verse_93": "And no doubt, We gave a place of honor to the children of Israel and provided them with the pure things, then they differed not, until the knowledge came to them. No doubt, your Lord will decide between them on the Day of Resurrection in that with regard to which they differed.",
        "verse_94": "And O listener! If you are in some doubt regarding what We have sent down towards you, then ask those who recite the Book before you. Indeed the truth has come to you from your Lord, then you never be of those who doubt.",
        "verse_95": "And never be of those who belied the signs of Allah otherwise you shall be of the losers.",
        "verse_96": "No doubt, those against whom the word of your Lord has been proved correctly will not believe.",
        "verse_97": "Though all signs should come to them, until they see the painful torment.",
        "verse_98": "Then why there has not been any town that believed so that its belief would have profited, but yes, the people of Younus. When they believed. We removed from them the torment of disgrace in the life of the world and allowed them to pull on for a time.",
        "verse_99": "And if your Lord had willed, all those who are in the earth would have believed together. Will you, then, force people until they become Muslims?",
        "verse_100": "And no soul has power to believe but by the leave of Allah. And He lays His torment upon those who have no wisdom.",
        "verse_101": "Say you, 'Behold what is in the heavens and in the earth!' And signs and Messengers give nothing to those who are not to believe.",
        "verse_102": "Then what for they are waiting, but the like of the days of those who passed away before them? Say you, 'then wait I am too with you in waiting.'",
        "verse_103": "Then We shall deliver Our Messengers and the believers. It is thus binding on Our mercy to deliver the Muslims.",
        "verse_104": "Say you, 'O people! If you are in any doubt as to my religion, then I shall worship not those whom you worship besides Allah, yes I worship that Allah Who will cause you to die, and I have been commanded to be of believers.",
        "verse_105": "And that: keep your face straight for the religion leaving all others, and never be of the polytheists.",
        "verse_106": "And worship not besides Allah that which can neither profit you nor harm you. Then if you does, then at that time thou wouldst be of the unjust.",
        "verse_107": "And if Allah touches you with any harm, then there is none to remove it save He, and if He desires good for you, then there is none to repel His grace. He causes it to reach whomsoever of His bondsmen He wills. And He is the Forgiving, the Merciful.",
        "verse_108": "Say you, 'O people! the truth has come to you from your Lord, then whoever came aright, he came aright for his own good, and whoever strayed, strayed against himself and I am not a guardian over you.",
        "verse_109": "And follow that which is revealed to you and have patience until Allah decrees, And He is the Best of Judges."
       },
    "count": 109
}
