{
    "name": "Fushshilat",
    "index": "041",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "HA —MIM.",
  "verse_2": "This is a sending down from the Most Affectionate, the Merciful.",
  "verse_3": "This is a Book whose verses have been fully explained, an Arabic Quran for a people of understanding.",
  "verse_4": "Bearing glad tidings and warning. But most of them turned away their faces and listen not.",
  "verse_5": "And they said, 'Our hearts are in covers from that to which you invite us and our ears are plugs and between us and you there is a curtain, therefore you do your work and we are doing ours.'",
  "verse_6": "Say you, 'In being a human being I am indeed like you, it is revealed to me that your God is One God, so be straight before Him and beg forgiveness from Him. And woe be to the associators.'",
  "verse_7": "Who do not pay poor due (Zakat) and they deny the Hereafter.",
  "verse_8": "Undoubtedly, those who believed and did good works, there is for them endless reward.",
  "verse_9": "Say you, 'Do you indeed disbelieve in Him Who made the earth in two days? And do you set up equals to Him’ That is the Lord of the entire world.",
  "verse_10": "And He placed therein anchors [of mountains] rising above it and put blessings therein and ordained therein provisions for its inhabitants, all this in four days, complete; this for the enquirers.",
  "verse_11": "Then He turned towards the heaven and it was a smoke, then He said to it and to the earth, 'come both of you willingly or unwillingly. They both submitted,' we have come willingly.'",
  "verse_12": "Then He completed them as seven heavens in two days and He sent to each heaven the commands of its own function. And We adorned the lower heaven with lamps and for protection. This is the decree of the Honorable, the All-Knowing.",
  "verse_13": "But if they turn their faces then say you, 'I warn you of a thunderbolt like the thunderbolt which overtook Aad and Thamud.'",
  "verse_14": "When Messengers came to them from before them and behind saying, 'worship none but Allah'. They said, 'had our Lord so wished. He would have sent down angels, so we disbelieve in what you have been sent with.'",
  "verse_15": "And as to those who were Aad, they waxed proud in the earth without right and said, 'who is mightier in strength than us'. Did they not know that Allah, Who created them, is mightier than they in strength? But they continued to deny Our signs.",
  "verse_16": "We therefore sent upon them a furious cold wind in the days of their misfortune so that We make them taste the torment of humiliation in the life of the world. And undoubtedly, there is great humiliation in the torment of the Hereafter and they shall not be helped.",
  "verse_17": "And as for Thamud We guided them but they preferred blindness to the guidance, therefore the thunder of a humiliating torment overtook them, the punishment of their doings.",
  "verse_18": "And We saved those who believed and used to fear.",
  "verse_19": "And on the day when the enemies of Allah shall be driven towards the Fire, then those who will come first shall be stopped till those coming next should meet them.",
  "verse_20": "Till when they will reach there, their ears and their eyes and their skins will bear witness against their doings.",
  "verse_21": "And they will say to their skins. 'Why did you bear witness against us'? They will say, 'Allah made us speak. He Who bestowed speaking power on everything and He created you the first time and towards Him you are to return.'",
  "verse_22": "And where you would have gone hiding yourselves from Him lest your ears and your eyes and your skins should bear witness against you, but you had already taken it for granted that Allah knows not much of your doings.",
  "verse_23": "And this is your conception which you formed for your Lord and it has ruined you, so now you are amongst the losers.",
  "verse_24": "Then if they endure, then the fire is their destination. And if they bet to please Allah, then none would accept their pleasing.",
  "verse_25": "And We appointed for them some companions, who made to appear fair-seeming to them what is before them and what behind them, and the sentence was justified against them along with those groups that had already gone before them from amongst the jinn and mankind. Undoubtedly, they were losers.",
  "verse_26": "And the infidels said, listen not to this Quran and make absurd noise therein, haply you may overcome.'",
  "verse_27": "Therefore, most certainly We shall necessarily make the infidels to taste a severe torment. And undoubtedly. We shall recompense them for the worst of their deeds.",
  "verse_28": "This is the recompense of the enemies of Allah, the Fire wherein they are to abide forever, as the punishment for that they used to deny Our signs.",
  "verse_29": "And the infidels said, 'O Our Lord, show us those who misled us both Jinn and men that we may put them under our feet, so that they may remain among the lowest;",
  "verse_30": "Undoubtedly, those who said, 'our Lord is Allah,' then remained firm on it, the angels descend upon them, saying, 'fear not, nor grieve and be glad with the paradise which you were promised.'",
  "verse_31": "'We are your friends in the life of this world and in the Hereafter. And for you therein is that which your soul may desire, and for you therein is that which you may ask for.'",
  "verse_32": "'An entertainment from the Forgiving, the Merciful.'",
  "verse_33": "And who is better in speech than him who invites towards Allah and does righteousness and says, 'I am Muslim.'",
  "verse_34": "And good and evil will not be equal, O listener; repel the evil with good, then he between whom and you there was enmity will become as though he was your warm friend.",
  "verse_35": "And this wealth is granted not but to those who are steadfast and it is granted not but to the owner of great fortune.",
  "verse_36": "And if any provocation of the devil reaches you, then seek refuge in Allah. Undoubtedly, He is the Hearer, the Knower.",
  "verse_37": "And among His signs are the night and the day and the sun and the moon. Prostrate not before the sun nor the moon and prostrate before Allah' Who has created them if you are His bondmen.",
  "verse_38": "But if they wax proud, then those who are with your Lord sanctify Him night and day and they weary not.",
  "verse_39": "And of His signs is that you see the earth lying worthless, but when We sent down rain to it, it became fresh and mellow and grew. Undoubtedly He Who gave life to it shall necessarily give life to the dead. No doubt, He can do everything.",
  "verse_40": "Undoubtedly those who seek crooked ways in Our signs are not hidden from Us. Is he then who shall be thrown in the Fire better or he who shall come secure on the Day of Resurrection? Do what you please, undoubtedly He is seeing your work.",
  "verse_41": "Undoubtedly, those who denied the reminder [Qur'an] when it came to them (ask not the condition of their misery), and undoubtedly it is an esteemed Book.",
  "verse_42": "There is no approach of falsehood to it either from before or from behind it. It is a sending down from the All — Wise, All- Praised.",
  "verse_43": "Nothing will be said to you, but only that which was said to the Messengers before you. Undoubtedly, your Lord is Forgiving and Master of painful torment.",
  "verse_44": "And if We had made it a Quran in a foreign tongue, they surely would have said, 'why not its verses have been made clear?' What, a book in foreign tongue and the Prophet Arabian. Say you, 'that is a guidance and a cure for the believers.' And those who believe not, in their ears is a plug and to them it is a blindness. They are like those who are called from a far-off place.",
  "verse_45": "And undoubtedly, We bestowed a Book on Musa, but difference was created therein. And if a word had not gone before from your Lord, then henceforth the matter would have been decided between them. And undoubtedly, they are surely in a confusing doubt about it.",
  "verse_46": "Whoso does righteousness, it is for his own good and whoso does evil, it is for his own bad. And your Lord is not at all unjust to His bondmen.",
  "verse_47": "The knowledge of the Hour is referred to Him alone. And no fruit comes forth from its sheath, and neither any female bears and nor brings forth but with His knowledge. And the day when He will call them; 'Where are My associates?' they will say, 'We have already proclaimed to you that there is no witness among us.'",
  "verse_48": "And those whom they used to worship before were lost from them and they have known for certain that they have no place of escape.",
  "verse_49": "Man tires not of praying for good and if any evil touches him, then he loses hope, becoming desperate.",
  "verse_50": "And if We make him taste of mercy from Us after the affliction that had touched him, then he will say, 'this is my own, and in my opinion the Hour will not come.' And even if I be returned to my Lord, necessarily, for me there is good with Him.' Then surely We shall tell the infidels all that whatever they did, and We shall certainly make them taste severe torment.",
  "verse_51": "And when We bestow favor on man, he turns his face and withdraws towards himself and when evil touches him, then he is of prolonged prayer.",
  "verse_52": "Say you, 'well tell you if this Quran is from Allah and yet you reject it, who is then more astray than one who is in a far-off opposition.'",
  "verse_53": "Soon, We shall show them Our signs in the entire world and in their own selves till it becomes clear to them that it is the truth. Is it not sufficient that your Lord is Witness over all things?",
  "verse_54": "Listen, they are surely in doubt concerning the meeting with their Lord. Hearken! He encompasses everything."
},
    "count": 54
}
