{
    "name": "Ali Imran",
    "index": "003",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif. Laam Meem.",
  "verse_2": "Allah is, besides Whom none is to be worshiped. Self-Living, Sustainer of others.",
  "verse_3": "He sent down to you this true Book, confirming preceding Books; and He sent down Tawraat (Torah) and Injeel (Gospel) before this.",
  "verse_4": "Afore-time guiding the people and sent down the criterion; No doubt, for those who denied the Signs of Allah is the severe torment, and Allah, the Mighty, is Possessor of the power of retribution.",
  "verse_5": "Nothing is hidden from Allah; neither in the earth nor in the heaven.",
  "verse_6": "It is He Who forms your shape in the wombs of the mothers as He pleases. Besides Whom none is to be worshiped, the Dominant, the Wise.",
  "verse_7": "It is He Who sent down upon you the Book, in which some verses have clear meanings, they are the substance of the Book, and others are those in the meanings of which there is doubt. Those in whose hearts there is perversity pursue doubtful one desiring deviation and searching their own view point of it, and its right interpretation is known to Allah alone. And those of firm knowledge say, 'We believed in it, all is from our Lord and none accept admonition save men of understanding.",
  "verse_8": "'O: our Lord! Let not our hearts become perverse after this that you guided us and bestow on us mercy from Yourself; no doubt, You are the big Bestower.",
  "verse_9": "'O our Lord! 'No doubt You are the Assembler of all people for the Day in which there is no doubt. Undoubtedly the promise of Allah changes not.'",
  "verse_10": "No doubt, those who became infidels; their riches and their children shall avail them nothing against Allah and it is they who are the fuel of the hell.",
  "verse_11": "Like the people of Pharaoh and those before them, they belied Our Signs; then Allah seized them for their sins and Allah's punishment is severe.",
  "verse_12": "Say to the disbelievers, 'soon you shall be overcome and be driven towards the hell and what an extreme evil bed that is!'",
  "verse_13": "No doubt, there was a sign for you in two groups that encountered among themselves. One gang fighting in the way of Allah and the other disbeliever that they understood them double of themselves in their eyesight; and Allah strengthens with His help whom He pleases. No doubt, in it there is teaching after seeing for the men of understanding.",
  "verse_14": "Adorned for men is the love of these lusts, women and children and the stored-up heaps of Gold and Silver and branded horses and cattle and crops. This is the capital of living world; and it is Allah with Whom there is an excellent destination.",
  "verse_15": "Say you 'Shall I inform you of something better than that. For pious ones there are gardens with their Lord beneath which rivers flow; therein shall they abide, and pure wives and Allah's pleasure. And Allah sees bondsmen.",
  "verse_16": "'Those who say, 'O our Lord! we did accept faith; then forgive us our sins and save us from the torment of the hell.\"",
  "verse_17": "The steadfast and truthful and humble and those who spend in the way of Allah and those who seek forgiveness in the latter part of the night.",
  "verse_18": "Allah bore witness that none is to be worshiped save Him, and the angels and the men of learning (too) standing with justice; none is to be worshiped save Him, the most Reverend, Wise.",
  "verse_19": "Verily, only Islam is the Deen (Religion) before Allah, and the men of Book did not dissent but after the knowledge had come to them, because of their hearts burning. And whoso denies the signs of Allah; then no doubt Allah is to call to account very soon.",
  "verse_20": "Again O beloved! If they argue with you, then say 'I have submitted my face before Allah and those who followed Me; and say to the men of Books and to those who read not, 'Have you submitted'? Hence if they submit, then they got the guidance and if turn their faces, then upon you it is only to convey the message, and Allah is seeing bondsmen.",
  "verse_21": "Those who deny the signs of Allah, and slay the Prophets unjustly and kill the men ordering justice; give them good tidings of painful torment.",
  "verse_22": "These are they whose deeds have perished in this world and the next and they shall have no helpers.",
  "verse_23": "Have you not observed those given a portion of the Book are called to the Book of Allah that it may judge between them, then a faction of them turns away being opposed to it?",
  "verse_24": "This boldness came to them because they say, the fire shall not touch us except for a number of days'; and the lies which they used to invent deceived them in their religion.",
  "verse_25": "Then how will it be, when We shall gather them for a Day in which there is no doubt; and every soul shall be paid in full what it has earned and they shall not be wronged.",
  "verse_26": "Say like this, 'O Allah Master of the Kingdom, You give the Kingdom to whom You please; and seize the Kingdom from whom You please. And You exalt whom You please and You abase whom You please; in Your hand is all good. No doubt You can do all things.",
  "verse_27": "'You cause the night to enter into day and cause the day to enter into night, and bring forth the living from the dead and bring forth the dead from the living, and provide whom so ever please without reckoning.'",
  "verse_28": "Let not the Muslims take infidels as their friends besides the Muslims and whosoever shall do that he has no connection with Allah, but this that have some fear of them; and Allah cautions you against His wrath; and unto Allah is the return.",
  "verse_29": "Say, you, 'whether you conceal what is in your hearts or declare it, Allah knows all, and knows whatever is in the heavens and whatever is in the earth. And Allah has the authority over everything.'",
  "verse_30": "The day when every soul shall find presented whatever it did of good and whatever it did of evil; it will long, would there be a far distance between me and it. And Allah warns you of His torment; and Allah is Kind enough over His bondsmen.",
  "verse_31": "O beloved! Say you, 'O people! If you love Allah, then follow me; Allah will love you and forgive your sins and Allah is Forgiving, Merciful.'",
  "verse_32": "Say you, 'Obey Allah and the Messenger; and then if they turn their faces, then Allah loves not the infidels.",
  "verse_33": "No doubt, Allah chose Adam and Noah and the family of Ibrahim and the family of Imran from over the entire world.",
  "verse_34": "It is a race from one another. And Allah hears and knows.",
  "verse_35": "When the wife of Imran said, 'I make a vow to You for what is in my womb to remain purely in Your service. Therefore accept this from me; no doubt, You alone are Hearing, Knowing?",
  "verse_36": "Then when she gave birth to her, said, 'O my Lord I gave birth to a female. ‘And Allah knows well whatever she gave birth to, and that male whom she demanded was not like this female and I have named her Mary, and I give her and her offspring under Your protection from Satan the rejected.'",
  "verse_37": "Therefore her Lord accepted her graciously and caused her to grow an excellent growth and gave her under the guardianship of Zakaria (Zecha- riah). Whenever Zakaria went to her place of prayer, he found new provision with her. He said: 'O Mary! Whence came this to you?' She spoke, 'that is from Allah,' No doubt, Allah gives whomsoever He pleases without measure.",
  "verse_38": "Here Zakaria called his Lord, said, 'O my Lord! Give me from yourself pure offspring; no doubt, You only are the Hearer of prayers.",
  "verse_39": "Then the angels called him, and he was offering prayer standing at his place of prayer, no doubt Allah gives you glad tidings of Yahya (John) who shall confirm a word from Allah, and be a chief and he will always avoid women, and, be a Prophet from amongst Our righteous.",
  "verse_40": "Said, 'O my Lord! From where shall I have a son, while the old age has reached me and my wife is barren'. Said, 'Allah does so whatever He pleases.'",
  "verse_41": "Submitted he, 'O my Lord! 'appoint a token for me' Said, your token is this that you shall not speak to people for three days but with signal, and remember your Lord much and praise Him at a time nearing sunset and at dawn'.",
  "verse_42": "And when the angels said, 'O Mary! Verily Allah has chosen you and purified well and today has chosen you from amongst the women of all worlds.",
  "verse_43": "'O Mary! Stand before your Lord humbly and prostrate for Him and bow down with those who bow down'",
  "verse_44": "These are the tidings of unseen that We reveal to you in secret. And you were not with them when they drew lots with their pens that under whose guardianship Mary should be given, and you were not with them when they were disputing.",
  "verse_45": "And remember when the angels said to Mary, 'O Mary! Allah gives you glad tidings of a Word from Him, whose name is Maseeh, Isa (Jesus Christ) son of Mary, he shall be dignified in the world and the Hereafter and of those nearest to Allah.",
  "verse_46": "'And he shall talk to the people in the cradle and in the ripe age (Maturity) and shall be of the righteous'.",
  "verse_47": "She said, 'O my Lord! From where shall I have a son, no person has touched me.' Said He, \"Allah creates in such away what He pleases. When He decrees anything, then He only says to it, 'Be, and it is straight away.\"",
  "verse_48": "And Allah will teach him the Book and wisdom and the Taurat and Injeel.",
  "verse_49": "And he shall be a Messenger towards the children of Israel saying this, 'I have brought to you a sign from your Lord; that I make a form out of clay like a bird for you then again breathe in it and it becomes a bird at once by the command of Allah; and I heal the born blind and the leper and I make the dead alive by the command of Allah and tell you whatever you eat and what you store in your houses. No doubt, in these things there is a great sign for you if you believe.",
  "verse_50": "'And I have come confirming the book Taurat that was before me; and for this that I should make lawful some of those things which were forbidden to you; and I have brought to you a sign from your Lord then fear Allah and obey my command.",
  "verse_51": "No doubt Allah is the Lord of me, of yours, of all, so worship Him only. This is the straight path.",
  "verse_52": "Then again when Isa found infidelity in them, said, 'Who become my helpers towards Allah? ‘The disciples said, 'We are the helpers of the religion of God; we have believed in Allah and bear, you, witness that we are Muslims.",
  "verse_53": "‘O our Lord! we believed in what you have sent down and followed the Messenger, then write us among those who bear witness on truth’.",
  "verse_54": "And the infidels plotted and Allah secretly devised for their destruction and Allah is the Best of secret devisers.",
  "verse_55": "Remember, when Allah said 'O Isa! I shall cause you to reach to your full life and I shall raise you towards Myself and I shall purify you from the infidels, and shall give your followers superiority over the rejecters until the Day of Resurrection; then you all shall come returning to Me, then I shall decide between you concerning that wherein you dispute'.",
  "verse_56": "Then those who became infidels, I shall torment them with severe punishment in this world and the next, and they shall have no helpers.",
  "verse_57": "And to those who believed and did good deeds, Allah will pay them their rewards in full and the unjust are not acceptable to Allah.",
  "verse_58": "Thus We recite to you of some signs and wise admonition.",
  "verse_59": "The likeness of Isa with Allah is like Adam. He created him of dust, then said, 'Be', and he is at once.",
  "verse_60": "O Listener! This is the truth from your Lord; be not therefore of doubters.",
  "verse_61": "Then O beloved! Whoever disputes with you about Isa after knowledge has come to you, then tell them, 'come, let us call our sons and your sons and our women and your women and our souls and your souls, then let us pray earnestly, and so lay the curse of Allah upon the liars.'",
  "verse_62": "This verily is the true narrative; and there is none worthy of worship save Allah; and verily only Allah is Almighty, the All-Wise.",
  "verse_63": "Then if they turn back their faces, then Allah knows the mischief-mongers.",
  "verse_64": "Say you, 'O people of the Book! Come towards such a word which is common between us and you, that is we worship none but Allah and associate no partner with Him; and none of us make one another as Lord besides Allah'; then if they do not accept, then say, 'bear witness that we are Muslims.'",
  "verse_65": "O people of the Book! Why do you dispute about Ibrahim? The Torah and Injeel (Gospel) were not sent down but after him, then have you no reason?",
  "verse_66": "Behold! you are those who disputed in that of which you had knowledge, then why you dispute in that of which you have no knowledge, and Allah knows and you know not.",
  "verse_67": "Abraham was neither a Jew nor Christian but was a Muslim separate from every falsehood and was not of the polytheists.",
  "verse_68": "Verily, the more rightful claimant of Abraham than all people were those who followed him and this Prophet and the believers, And Allah is the Protector of the believers.",
  "verse_69": "A section of the people of the Book yearns that in any way you go astray and they make astray to themselves and they have no sense.",
  "verse_70": "O people of the Book! Why do you deny the signs of Allah, whereas you are yourselves witnesses?",
  "verse_71": "O people of the Book! Why do you confound truth with falsehood and why do you conceal the truth whereas you have knowledge?",
  "verse_72": "A section of the people of the Book said, 'believe at morning in that which has been sent down upon the believers and deny at evening; perchance they may return.'",
  "verse_73": "And believe not any but him who is the follower of your religion. Say you, 'The guidance of only Allah is the guidance. (What do you not believe in) I hat may be given to anyone the like of that was given to you', or anyone might argue you before your Lord. Say, you, 'the bounty is in the hand of Allah alone; He gives it to whomsoever He pleases; and Allah is All- Embracing, All-Knowing.",
  "verse_74": "He singles out with His mercy whomsoever He pleases; and Allah is of exceeding bounty.",
  "verse_75": "And among the people of the Book there is someone with whom if you keep a huge treasure in trust, then he will pay it back to you, and in them there is someone with whom if you keep in trust a single dinar, then he will not repay it to you, except when you remain standing over his head. It is because they say, 'there is no responsibility over us in the matter of these illiterates and they utter a lie against Allah knowingly.",
  "verse_76": "Yes, why not, one who fulfilled his pledge and feared God and verily, Allah loves those who fear God.",
  "verse_77": "Those who accept mean price in exchange of their covenant with Allah and their oaths, they have no portion in the Hereafter, and Allah will neither speak to them nor look towards them on Resurrection Day, nor will He purify them; and for them there is painful torment.",
  "verse_78": "And among them some are those who distort the Book by twisting their tongues; that you may think it is also in the Book, and that is not in the Book. And they say, 'It is from Allah, whereas it is not from Allah and they forge a lie against Allah purposely and knowingly.",
  "verse_79": "It is not the right of any man that Allah should give him the Book and command and Prophet Hood, then he should say to people, 'Be my bondmen leaving Allah; Yes he will say this, and ‘be men of Allah because you teach the Book and because you study it.'",
  "verse_80": "And He would not order you this that you should take the angels and Prophets as God. Would He order you to infidelity after it that you have become Muslims?",
  "verse_81": "And remember when Allah took from the Prophets their covenant whatever I should give you of the Book and wisdom, then comes to you the Messenger confirming your Books, then assuredly you must believe in him and assuredly you must help him. He said, 'do you agree, and do you accept My heavy responsibility on it. All submitted, 'We did affirm', He said, 'then be witnesses against one another and I am Myself among witnesses with you.",
  "verse_82": "'Now whoso turns away after this, then they are the dis-obedients.'",
  "verse_83": "Then, do they like a religion other than the religion of Allah? And to Him has submitted whoso is in the heavens and the earth, willingly and unwillingly, and to Him shall they be returned.",
  "verse_84": "Say like this, 'that we believed in Allah and in that which was sent down to us and in that which was sent down to Ibrahim and Ismail and Ishaque and Yaqoob and his children and that which was given to Musa and Isa and Prophets from their Lord. We make no distinction between any of them in believing and to Him we have bowed down our necks.'",
  "verse_85": "And whoso will desire for a religion other than Islam, that shall never be accepted from him and in the next world he shall be among the losers.",
  "verse_86": "How Allah shall wish to guide such a people who disbelieved after believing and had borne witness that the Messenger is true and to them had come clear signs? And Allah guides not a people unjust.",
  "verse_87": "Their meed is this that on them there is curse of Allah, and of angels and of men, all together.",
  "verse_88": "They should abide therein. Neither the torment shall be lightened from over them and nor shall they be respited.",
  "verse_89": "But those who repented thereafter and amended themselves, then necessarily, Allah is Forgiving, Merciful.",
  "verse_90": "No doubt, those who disbelieved after believing, then again waxed in infidelity, their repentance shall never be accepted and these are they who have gone astray.",
  "verse_91": "Those who disbelieved and died infidels, there shall never be accepted an earth full of gold from anyone of them, though he offers it in ransom for himself. There is painful torment for them, and they have no helpers.",
  "verse_92": "You shall never attain unless you spend your favorite thing; and whatever you spend is known to Allah.",
  "verse_93": "All food was lawful to the children of Israel save what Yaqoob had made unlawful for himself before the Torah was sent down. Say you, 'Bring the Taurat (Torah) and read it if you are truthful.'",
  "verse_94": "Then after that whoso forges lie against Allah, those are the persons unjust.",
  "verse_95": "Say you, 'Allah is true, therefore follow the religion of Abraham who was separate from every falsehood and was not of the polytheists.",
  "verse_96": "Verily, the first House among all marked for the worship of the people is that which is in Mecca abounding in blessings and a guide of all world.",
  "verse_97": "Therein are clear signs: the place where Abraham stood: and whosoever enters it, is in security. And for the sake of Allah, the people is to perform Hajj (pilgrimage) to this House, who could find a way thither. And who denies, then Allah is Independent of entire world.",
  "verse_98": "Say you, 'O people of the Book! Why do you not accept the signs of Allah while your work is before Allah.",
  "verse_99": "Say you, 'O people of the Book! Why do you hinder those who accepted the faith from the path of Allah, you desire to crook it and you are yourselves witnesses thereof? And Allah is not unware of your doings.'",
  "verse_100": "O believers! if you obey some, of the people of the Book, then they will render you infidels after your belief.",
  "verse_101": "And how would you commit infidelity, (whereas) the signs (verses) of Allah are recited to you; and in your midst has come the Messenger of Allah? And he who sought the support of Allah has been directed to a straight path.",
  "verse_102": "O believers! Fear Allah as rightly He is to be feared, and do not die ever save as Muslims.",
  "verse_103": "And hold fast, all together, by the rope of Allah, and be not divided among yourselves. And remember Allah's favour upon you, when there was enmity among you, He joined your hearts together then, by His grace, you became brothers together and you were upon the brink of a pit of the Fire, then He rescued you from it; thus Allah explains to you His signs; that haply you may get guidance.",
  "verse_104": "And let there be such a group among you, that they may call towards goodness and command what is just and forbid evil. And the very same attained to their goals.",
  "verse_105": "And be not like those who were divided (in sections) and disagreed among themselves, after this that bright signs had come to them, and for them there is mighty torment.",
  "verse_106": "On the day when some faces shall be white, and some black. Then those whose faces have been blackened, (they will be told) 'did you become infidels after accepting faith then now taste the torment, the recompense of your infidelity.",
  "verse_107": "And as for those whose faces are whitened, they are under the mercy of Allah, they shall abide in it.",
  "verse_108": "These are the signs of Allah that We recite unto you correctly, and Allah intends not injustice to the people of the worlds.",
  "verse_109": "And to Allah belongs whatever is in the heavens and whatever is in the earth and unto Allah is the return of all matters.",
  "verse_110": "You are the best among all those nations appeared unto mankind, you command to good, and forbid evil, and keep faith unto Allah. Had the people of the Book believed, then it was good for them. Some of them are Muslims and most of them are infidels.",
  "verse_111": "They will not harm you save annoying; and if they fight with you, they will turn their backs from you, then again they will not be helped.",
  "verse_112": "Ignominy has been pitched on them, wherever they are, they shall get no security save with a rope from Allah and a rope from men, (they may get protection). And they became worthy of the wrath of Allah and on them destitution has been pitched. This is because they used to reject the signs of Allah and slay the Prophets unjustly. This is because they were disobedient and transgressors.",
  "verse_113": "All are not alike. Among the people of the Book some are those who stand right, recite the signs of Allah in the hours of night and prostrate.",
  "verse_114": "They believe in Allah and the Last Day and command good and forbid evil and run for good works, and they are righteous.",
  "verse_115": "And those who will do good, their right shall not be denied and Allah knows the God-fearing.",
  "verse_116": "Those who became infidels, their riches and children shall not avail them at all against Allah and they are the men of hell and shall abide therein.",
  "verse_117": "The example of that which they spend in the life of this world is like a wind in which there is intense cold; that struck the harvest of such a nation which wronged themselves, therefore it destroyed that, and Allah wronged them not, but yes, they wrong unto their own souls.",
  "verse_118": "O believers! Do not make strangers as your confidents, they leave no stone unturned in harming you. They yearn for what distresses you. Hostility appeared from their utterances and what they have concealed in their breasts is yet greater. We have made you hear Our signs clearly, if you have wisdom.",
  "verse_119": "Behold, it is you who love them, and they love you not. Though you believe in all the Books. And when they meet you, they say, 'we accepted faith1, and when they are alone, then they bite their fingertips at you out of wrath. Say you, 'die in your passion'. Allah knows well the thoughts of the hearts.",
  "verse_120": "Anything good befalls you it vexes them; and if an evil befalls you, then they are happy at it, and if you have patience and fear Allah, then their guile will not hurt you at all. Verily, their all doings are under the circumference of Allah.",
  "verse_121": "Andremember, O beloved! When you came out from your house in the morning, assigning to the Muslims their positions for battle. And Allah is all-hearing, All Knowing.",
  "verse_122": "When two of your groups intended cowardice, but Allah is their Supporter, and upon Allah should the Muslims rely.",
  "verse_123": "And verily, Allah did help you at Badr, when you were resource less. So fear Allah that perhaps you may be thankful.",
  "verse_124": "When O beloved! You did say to Muslims, \"Is it not enough for you that your Lord should assist you by sending down three thousand angels?\"",
  "verse_125": "Yes, why not, if you have patience and fear God, and the infidels came upon you instantly, then your Lord will send five thousand angels with marks for your help.",
  "verse_126": "And this victory Allah did not make, save for pleasing you and so that your hearts might get rest with it, and there is no help except from Allah, the Dominant, the Wise.",
  "verse_127": "In order that He might cut off a portion of the infidels or abase them, so that they may go back disappointed.",
  "verse_128": "This matter is not in your hand, whether He shows His graciousness to them for repentance or torment them, for they are unjust.",
  "verse_129": "Andto Allah belongs whatever is in the heavens and whatever is in the earth. He forgives whomsoever He pleases and torments whomsoever He pleases; and Allah is Forgiving, Merciful.",
  "verse_130": "O believers! Devour not interest, doubled and redoubled; and fear Allah, in the hope that you may get prosperity.",
  "verse_131": "And ward off the Fire which is already prepared for the infidels.",
  "verse_132": "And remain obedient to Allah and Messenger, in the hope that you be shown mercy.",
  "verse_133": "Andrun towards the forgiveness of your Lord and to such a paradise whose width covers all heavens and earth, is already prepared for those who are pious.",
  "verse_134": "Those who spend in the path of Allah in prosperity and adversity and who restrain anger and who pardon men and virtuous people are dear to Allah.",
  "verse_135": "Andthose who, when they have committed indecency or wronged their own souls, beg forgiveness for their sins remembering Allah, and who forgives sins save Allah? And do not persist knowingly in what they have done.",
  "verse_136": "For such the recompense is their Lord's forgiveness and Gardens with rivers flowing underneath, they shall remain for ever therein, and what an excellent reward is for workers.",
  "verse_137": "Some systems have already been experimented, before you, then see, going through the earth, how the end of the beliers was!",
  "verse_138": "This is to state to people and to guide and is admonition to those who are pious.",
  "verse_139": "And be not sluggish and neither be grieved, you are the very same who shall overcome if you have faith.",
  "verse_140": "If any distress has come to you, then they too have already received a similar distress. These are the days in which we have fixed turns for the people and that is because Allah may make one to distinguish the believers and may assign some of you the position of martyrs. And Allah loves not the unjust.",
  "verse_141": "And so that Allah may purify the Muslims and wipe out the infidels.",
  "verse_142": "Are you in this supposition that you shall enter the paradise and yet Allah has not tested your warriors and neither has experimented the steadfast?",
  "verse_143": "And you used to long for death before meeting it, so now you have seen it with your eyes.",
  "verse_144": "And Muhammad is only a Messenger. There have been many other Messengers before him. Will you then, if he departs or be slain, turn back on your heels? And he who will turn back on his heels, shall not harm Allah at all. And very soon Allah will recompense the thankful.",
  "verse_145": "And no soul can die save by the leave of God. The time of all is already recorded. And whoso desires the reward of the world, We give to him of this, and he who desires the reward of the Hereafter, We give to him of this, And it is very soon, We may recompense the thankful.",
  "verse_146": "And many a Prophet fought, with them there were many God- men, they fell not sluggish with the miseries they faced in the path of Allah, and neither became weak nor gave in. And the steadfast are dear to Allah.",
  "verse_147": "They did say nothing save this prayer, 'O Our Lord! Forgive our sins and our excesses that we committed in our affairs, and make firm our steps and help us against these disbelieving people.",
  "verse_148": "So Allah gave them the reward of the world, and goodness of the reward of Hereafter. And the good doers are dear to Allah.",
  "verse_149": "O believers! if you follow the line of infidels, then they will turn you upon your heels, and you will be back after losing.",
  "verse_150": "Whereas Allah is your Patron; and He is the best Helper.",
   "verse_151": "Soon We shall cast terror in the hearts of infidels, because they associated partners with Allah for which He sent down not any understanding and their abode is Fire, and what the evil abode of the unjust is!",
  "verse_152": "And verily, Allah did prove the truth of His promise to you when you were killing the infidels by His leave, until when you showed weakness and quarreled about the order and disobeyed after He had shown you the thing you desired for. Of you someone desired the world and of you someone desired the Hereafter, then He turned your faces from them that He might test you; and no doubt, He forgave you and Allah is Bounteous over Muslims.",
  "verse_153": "When you were going up and did not look back towards anyone and Our Messenger was calling you in another group; therefore He gave you sorrow in recompense for a sorrow, and forgave in order that you might not grieve for what sent out of your hand and what befell you. And Allah is informed of your doings.",
  "verse_154": "Then after sorrow, He sent down to you slumber that had surrounded a party of you, and another party was anxious about themselves, suspected of Allah unjustly; like the suspicion of ignorance. They say, 'Have we any power in this affair?' Say you, 'Entire authority is of Allah. 'They conceal in their hearts that they reveal not unto you; they say, 'If we had had any power, then we would not have been killed here.\" Say you, 'If you had been in your houses, even then those for whom killing was already written would have gone forth to the place of their slaughter; and in order that Allah might test the feelings of your breasts, and whatever is in your hearts might purge it. Allah knows the thoughts of your hearts.",
  "verse_155": "No doubt, those of you who turned back on the day when two armies met. It was Satan who made them slip because of their certain actions, and surely Allah forgave them. Verily, Allah is Forgiving, Gentle.",
  "verse_156": "O believers! Be not like those infidels who told about their brothers when went on journey or on holy war; that had they been with us, they would not have died and not been slain, in order that Allah may make it a cause of regret in their hearts. And Allah gives life and causes death, and Allah is seeing your works.",
  "verse_157": "And undoubtedly, if you are slain in the way of Allah or die, then the forgiveness of Allah and His mercy are better than their entire wealth.",
  "verse_158": "And if you die or be slain, certainly you are to gather towards Allah.",
  "verse_159": "Then, it is of the mercy of Allah that O beloved! You became gentle for them and if you had been hot-headed, hard hearted, then they certainly would have dispersed from your circle; so pardon them and intercede for them and consult them in the affairs; and when you have made up your mind for anything, then put your trust in Allah. Undoubtedly, the trustful are dear to Allah.",
  "verse_160": "If Allah helps you, then none can overcome you; and He forsakes you, then who is such that can help you again. And the Muslim should trust unto Allah alone.",
  "verse_161": "It cannot be thought about any Prophet that he hides away something and whatever he hides away, he shall come with his hidden thing on the Day of Resurrection; then every soul shall be paid in full what it has earned, and there shall be no unjustice unto them.",
  "verse_162": "Will then he who follows the pleasure of Allah be like him who has earned the wrath of Allah and his abode is hell? And what a bad place of return it is!",
  "verse_163": "They are according to their ranks near Allah and Allah sees their work.",
  "verse_164": "Undoubtedly, Allah did a great favor to the Muslims that in them from among themselves sent a Messenger who recites unto them His signs and purifies them and teaches them the Book and wisdom, and necessarily before that they were certainly in apparent error.",
  "verse_165": "What! When any calamity reaches you, though double of which you had caused to reach (to them), you began to say, \"Whence it came.\" Say you, 'It is from your own side.' Undoubtedly Allah can do everything.",
  "verse_166": "And that calamity which befell you on the day the two armies had met was by Allah's leave, and thus He might make known the believers.",
  "verse_167": "And that He might make one to distinguish the hypocrites; and it was said to them, \"Come, fight in the way of Allah or drive out the enemy\". They said, \"If we knew fighting, then certainly we would have sided you.\" And they on that day were nearer to apparent infidelity than to express faith. They say with their mouths, what is not in their hearts. And Allah knows what they are concealing.",
  "verse_168": "Those who said about their brothers and while themselves remained behind, 'Had they obeyed us, they would not have been killed.' Say you, 'then avert your own death if you are truthful.'",
  "verse_169": "Andthose who have been slain in the way of Allah, never think of them as dead; but they are alive with their Lord, get their subsistence.",
  "verse_170": "They are happy because of that which Allah has bestowed upon them of His Bounty and are rejoicing for their successors who have not yet joined them that on them there is not any fear, nor any grief.",
  "verse_171": "They rejoice at the favor of Allah and His bounty, and that Allah wastes not the reward of Muslims.",
  "verse_172": "Those who responded to the call of Allah and Messenger after the wound had smitten them. There is great reward for their right righteous and reverent people.",
  "verse_173": "Those to whom people said, 'the people have gathered against you, therefore fear them; but this increased their faith and said, 'Allah is Sufficient for us and what an Excellent Disposer of affairs!",
  "verse_174": "Hence they returned with a favor from Allah and His Bounty, no evil touched them and followed the pleasure of Allah. And Allah is of great Bounty.",
  "verse_175": "lt is only the Satan that threatens you of his friends: so fear them not and fear Me if you have faith.",
  "verse_176": "And(O beloved!) you grieve not of them at all, who run after infidelity, they will not harm Allah at all. And Allah intends not to assign any position for them in the Hereafter and for them there is great torment.",
  "verse_177": "Those who purchased infidelity for faith will not harm Allah at all, and for them is the painful torment.",
  "verse_178": "And let never the unbelievers suppose that respite, We grant them is something good for them. Certainly We grant them respite only because they may further increase in sin. And for them is the degrading torment.",
  "verse_179": "Allah is not to leave the Muslims in the present state of affairs in which you are, until He separates unpure from the pure. And it is not befitting to the dignity of Allah that ‘O general people! He let you know the unseen. Yes, Allah chooses from amongst His Messengers whom He pleases. Then believe in Allah and His Messengers. And if you accept faith and fear, then there is great reward for you.",
  "verse_180": "Andlet not those who are niggardly with respect to what Allah has given them out of His bounty think that it is good for them; on the contrary it is bad for them. Soon that for which they were niggardly shall be their necklace on the Day of Resurrection. And only Allah is the Heir of heavens and earth. And Allah is Aware of your doings.",
  "verse_181": "Undoubtedly Allah heard those who said, \"Allah is needy and we are rich.\" Now We shall put their sayings and their slaying of the Prophets unjustly in writing; and We shall say, 'taste the torment of the fire.'",
  "verse_182": "This is the compensation of what your hands have sent forth. And Allah does not oppress their bondsmen.",
  "verse_183": "Those who say, 'Allah has covenanted with us that we believe not in any Messenger until he brings an order of such sacrifice which the fire consumes; say you, 'Many Messengers came to you before me bearing clear signs and with this order which you speak of; then why did you kill them, if you are truthful?",
  "verse_184": "Then O beloved! if they belie you even, so the Messengers before you, who had come bearing clear signs and the scriptures and the shining Book have already been belied.",
  "verse_185": "Every soul is to taste the death; and you will get your compensation in full only on the Day of Resurrection. Whosoever is saved from the Fire and made to enter into Paradise, attained to his goal. And the life of this world is but the goods of deception.",
  "verse_186": "Undoubtedly, you shall certainly be tested in your property and in your lives, and undoubtedly, you shall certainly hear a good deal of bad things from the people of the Book before you and from idolaters. But if you endure and guard yourselves (against evils), then it is the work of strong determination.",
  "verse_187": "And remember when Allah took a covenant from those who were given the Book that, 'you shall necessarily make it known to the people and conceal it not' but they threw it behind their backs, and took a mean price in exchange of it, then how an evil purchasing it is!",
  "verse_188": "Never think of those who rejoice on their doings and wish that they may be praised without doing. Never think of such people away from the torment; and for them is the painful torment.",
  "verse_189": "And to Allah belongs the kingdom of the heavens and earth; and Allah is Potent over everything.",
  "verse_190": "Undoubtedly, in the creation of heavens and earth and in the mutual alternations of night and day, there are signs for men of understanding.",
  "verse_191": "Those who remember Allah standing and sitting and lying on their sides, and contemplate the creation of heavens and earth; (saying) \"O our Lord! You have not made it in vain, Hallowed be you, then save us from the torment of the Hell.",
  "verse_192": "\"O our Lord! Verily whomsoever you cause to enter the Hell, him you have surely humiliated, and the unjust have no helpers.",
  "verse_193": "\"O our Lord! We heard a proclaimer that he calls for believing, that believe in your Lord; then we believed. O our Lord! Forgive us our sins and wipe off us our evils and cause us to die along with the righteous.",
  "verse_194": "\"O our lord! And give us that what you have promised to us through Your Messengers; and disgrace us not on the Day of Resurrection. Undoubtedly, you do not break the promise.\"",
  "verse_195": "Then their Lord heard their prayer, that I certainly waste not the labour of any worker from amongst you, be a male or female, you are one among yourselves. Hence those who emigrated and were driven out from their homes and were tortured in My way and fought and were killed. I shall surely wipe out all their sins and shall surely cause them to enter into the gardens beneath which flow rivers, a reward from Allah. And with Allah only there is good reward.",
  "verse_196": "O listener! Let not deceive you the strutting about of the infidels in the cities.",
  "verse_197": "A brief enjoyment; their abode is the Hell and what an evil bed!",
  "verse_198": "But those who fear their Lord, for them there are gardens beneath which flow rivers. They shall abide therein, an entertainment from Allah and that which is with Allah is still better for the righteous.",
  "verse_199": "And undoubtedly, some among the men of the Book are such that they believe in Allah and in what has been sent to you and what has been sent down to them, their hearts are bent towards Allah, do not accept mean price for the signs of Allah. These are those whose reward is with their Lord; and Allah is Swift in taking account.",
  "verse_200": "O believers! Be patient, and excel in patience with the enemies and guard Islamic country on the border and remain fearing Allah that haply you may be successful.",
   },
    "count": 200
}
