{
    "name": "Fathir",
    "index": "035",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "All praise to Allah, the Maker of the heavens and the earth, the Appointer of the angels as Messengers who have twos, threes and fours wings. He increases in creation what He please. Undoubtedly, Allah is Potent over everything.",
        "verse_2": "Whatever mercy Allah opens for mankind none there is to withhold it, and whatever He withholds, none there is to release it thereafter. And He is the only Dignified, the Wise.",
        "verse_3": "O mankind! Remember the favor of Allah upon you. Is there any Creator besides Allah Who provides for you from the heavens and the earth? There is no God but He, whither then are you turning back?",
        "verse_4": "And if they belie you, then no doubt, Messengers have been belied before you. And all affairs return to Allah.",
        "verse_5": "O mankind! Undoubtedly, the promise of Allah is true, let never then deceive you the life of the world, and let never the great deceiver deceive you regarding the serenity of Allah.",
        "verse_6": "Undoubtedly, the devil is your enemy, so you too take him as an enemy. He only invites his party that they be among the companions of the Hell.",
        "verse_7": "For the infidels there is severe torment and those who have believed and have done good works, for them is Forgiveness and great reward.",
        "verse_8": "Will he in whose sight his evil work has been adorned so that he thought it good, be like him who is guided? Therefore Allah leads astray whom He please and guides whom He pleases. So let not your soul be gone away in regrets for them, Allah knows well whatever they do.",
        "verse_9": "And Allah is He Who sent the winds that stir up clouds, then We drive it to a dead land then give life to the earth therewith after its death. This is the rising up in the Resurrection.",
        "verse_10": "Whoever desires honor, then all honors belong to Allah. Towards Him ascends all pure words, and the righteous work does He exalt. And those who plot evils, for them is the severe torment. And the plotting of those only will perish.",
        "verse_11": "And Allah created you from dust, then from a sperm drop, then made you pairs. And no female bears, nor she gives birth but with His knowledge. To whom so ever of long age is given age or the age of whom so ever is curtailed, all this is in a Book. Verily it is easy for Allah.",
        "verse_12": "And both seas are not alike. This is sweat, very sweat a pleasant water and this the other one is saltish bitter. And from each you eat fresh meat and take out an ornament to wear, and you see the boats therein that they cleave the water so that you may seek His grace and that you may be grateful.",
        "verse_13": "He brings the night into the day and brings the day into the night and He has engaged the sun and the moon into services; everyone runs up to an appointed time. This is Allah your Lord, His is the kingdom. And those whom you worship besides Him own not even the husk of a date palm.",
        "verse_14": "If you invoke them, then they will not listen to your call, and even if they heard, then they could not grant your wish. And on the Day of Judgement they will deny your associating. And none will inform you like the All-Aware.",
        "verse_15": "O mankind! you are all in need of Allah. And Allah only, He is all Independent, All-praised.",
        "verse_16": "If He please, He may take you away and bring a new creation.",
        "verse_17": "And this is not anything difficult for Allah.",
        "verse_18": "And no soul bearer of burden will bear the burden of another. And if anyone heavily loaded calls any other to share its load, not anyone will bear anything from its burden, even though he may be a near relation. O beloved! Your warning is useful only for those who fear their Lord without seeing and establish prayer. And who became purified, purified himself for his own good. And to Allah is the return.",
        "verse_19": "And the blind and seeing are not equal.",
        "verse_20": "And nor the darkness and the light.",
        "verse_21": "And nor the shadow and the heat of the full sun.",
        "verse_22": "And equal are not the living and the dead. Undoubtedly, Allah causes him to hear whom He pleases; and you are not to make those who are lying in their graves to hear.",
        "verse_23": "You are but a warner.",
        "verse_24": "O beloved! Undoubtedly, We have sent you with truth as a bearer of glad tidings and as a warner. And whoever was a group of people in each of them a warner has already passed away.",
        "verse_25": "And if they belie you, then those before them have already belied; there came to them their Messengers with clear proofs and with the scriptures and the shining Book.",
        "verse_26": "Then I seized the infidels, then how was My abhorrence?",
        "verse_27": "Have you not seen that Allah has sent down water from the sky and then We brought forth therewith fruits of different colors. And in the mountains are streak white and red of different colors and some raven black.",
        "verse_28": "And men and beasts and cattle, in like manner, there are various colors, only those of His bondmen who possess knowledge fear Allah. Undoubtedly, Allah is Dignified, Forgiving.",
        "verse_29": "Verily those who recite the Book of Allah and establish prayer and spend secretly and openly out of what We have given them hope for a trade in which there is never loss.",
        "verse_30": "In order that He may give them their reward in full and give more out of His bounty. Verily He is Forgiving Appreciating.",
        "verse_31": "And the Book We revealed to you is the truth confirming the Books before it. Verily Allah is aware of His bondmen and Seeing.",
        "verse_32": "Then We made Our selected bondmen as inheritors of the Book, then of them is he who wrongs himself; and of them is he who takes a middle course; and of them is he who has gone ahead in goods by Allah's leave. This is indeed the great grace.",
        "verse_33": "In the gardens of inhabitation they will enter, they will be made to wear in it bracelets of gold and pearls, and their dress therein is silken.",
        "verse_34": "And they will say, 'All praise to Allah Who has removed our grief. Undoubtedly, our Lord is Forgiving, Appreciating.",
        "verse_35": "Who out of His grace has made us alight in a place of comfort, wherein no trouble reaches us and nor any weariness affects us.",
        "verse_36": "And those who committed infidelity, for them is the fire of Hell, death will not be decreed for them so that they may die and nor will the torment thereof be lightened for them. Thus do We punish every big ungrateful person.",
        "verse_37": "And they will be crying therein, O our Lord! Take us out that we may do good contrary to that we used to do before. And did We not give you a life in which he who wishes to reflect, reflects? And a warner had come to you, now therefore taste you, there is no helper for the unjust.",
        "verse_38": "Undoubtedly, Allah is the Knower of every hidden thing of the heavens and the earth. Verily He knows the thoughts of the hearts.",
        "verse_39": "He it is Who made you successors of the formers in the earth. Therefore He who commits infidelity his infidelity falls on him And the infidelity of the infidels will not increase with their Lord but disgust; and the infidelity of the infidels will not increase them but loss.",
        "verse_40": "Say you, well, tell your those associate gods whom you worship besides Allah. Show me what portion of the earth they have made, or have they any partnership in the heavens, or have We given them any Book so that they are on clear proofs thereof? Nay but the unjust people promise each other nothing but delusion.",
        "verse_41": "Undoubtedly, Allah has withheld the heavens and the earth lest they move, and if they move, who then might withhold them save Allah? Verily He is All Clement, All-Forgiving.",
        "verse_42": "And they swore by Allah with the utmost strength of their oaths that if a warner came to them, they would necessarily then be better guided than any of the other communities. But when a warner came to them, then it increased in them not but to hate.",
        "verse_43": "Swelling their souls high in the earth and evil plotting. And the evil plotting encompasses only its author. Therefore what they are waiting for but for the same precedents of the ancients. But you will never find the manner of Allah changing, and will never find the laws of Allah shifting.",
        "verse_44": "Have they not travelled in the earth, so that they might see how has been the end of those before them, and they were stronger in power than these? And Allah is not such that anything in the heavens and the earth could go out of His control. Verily He is Knowing, Authoritative.",
        "verse_45": "And if Allah were to seize men for what they did, then He would not leave any moving creature on the back of the earth, but He lets them loose until an appointed time, and when their promise will come, then no doubt, all bondmen of Allah are in His sight."
     
    },
    "count": 45
}
