{
    "name": "adz-Dzariyat",
    "index": "051",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By those who scatter by scattering.",
        "verse_2": "Then the burden bearers.",
        "verse_3": "Then the smooth runners.",
        "verse_4": "And then the distributors by command.",
        "verse_5": "Undoubtedly, what is promised to you is surely true.",
        "verse_6": "And undoubtedly, the justice is sure to be done.",
        "verse_7": "By heaven that is adorned (by stars).",
        "verse_8": "You are at variance in your talks.",
        "verse_9": "He alone is turned away from this Quran who is destined to be turned away.",
        "verse_10": "Killed be the fabricators.",
        "verse_11": "Who are forgetful in intoxication (of ignorance).",
        "verse_12": "They ask, 'when will be the day of judgements'.",
        "verse_13": "It will be a day when they shall be tried on the fire.",
        "verse_14": "And it will be said to them, 'taste your trial'. This is what gardens and springs.",
        "verse_15": "Surely the pious are in the gardens and springs.",
        "verse_16": "Receiving what their Lord gives them. Surely, they were doers of good before that.",
        "verse_17": "They used to sleep little by night.",
        "verse_18": "And in the last part of the night they used to seek forgiveness.",
        "verse_19": "And in their wealth there was the right of the beggars and the unfortunate.",
        "verse_20": "And in the earth are signs for those who are convinced.",
        "verse_21": "And in your own selves. Do you not then perceive?",
        "verse_22": "And in heaven is your provision, and that you are promised.",
        "verse_23": "Therefore by the Lord of the heavens and the earth, verily this Quran is the truth in the same language which you speak.",
        "verse_24": "O beloved! (Prophet) has the news of the honored guest of Ibrahim come to guests of Ibrahim come to you?",
        "verse_25": "When they came to him and said 'Peace' he said, 'peace' they are the persons strangers.",
        "verse_26": "Then he went to his house and brought a fatted calf.",
        "verse_27": "Then he placed before them. He said, 'do you not eat?'",
        "verse_28": "Then he began to fear in his heart on account of them, they said, 'fear not and gave him glad tidings, of the birth of a son of knowledge.",
        "verse_29": "Then his wife came forward crying and smote her forehead and said, 'what! a barren old woman.",
        "verse_30": "They said, 'thus has said your Lord. And He is the Wise, the Knowing.",
        "verse_31": "Ibrahim said, 'And O angels! For what business you have come?",
        "verse_32": "They said, ' We have been sent to a sinful people.",
        "verse_33": "That We may let loose upon them stones of baked clay.",
        "verse_34": "Which are with your Lord marked for the extravagant.",
        "verse_35": "Then We brought forth from the city those who were believers.",
        "verse_36": "But We found there only one house of Muslims.",
        "verse_37": "And We left therein a sign for those who fear a painful torment.",
        "verse_38": "And in Musa also, when We sent him to Firawn with bright authority.",
        "verse_39": "But he turned away with his army and said, 'a magician or a madman?",
        "verse_40": "So seizing him and his army, We cast them into the sea in a condition that he was blaming himself.",
        "verse_41": "And in Aad too, when We sent to them a dry windstorm.",
        "verse_42": "That it left the thing it came upon like a rotten thing.",
        "verse_43": "And in Thamud too, when it was said to them, enjoy yourselves for a while.",
        "verse_44": "But they rebelled against the command of their Lord then a thunderbolt overtook them before their eyes.",
        "verse_45": "Then they neither could stand up nor could they take revenge.",
        "verse_46": "And We destroyed the people of Nuh before them. Undoubtedly they were the people disobedient.",
        "verse_47": "And We have made the heaven with hands, and undoubtedly We are Makers of the vast extent.",
        "verse_48": "And we have made the earth a floor, and what an Excellent Spreader We are!",
        "verse_49": "And We have made pairs of everything that you may reflect.",
        "verse_50": "'Therefore flee towards Allah. Undoubtedly I am a clear warner to you from Him.",
        "verse_51": "'And do not set other gods along with Allah. Surely, I am a clear warner to you from Him.'",
        "verse_52": "In the same way, whenever any Messenger came to those before them, they said only 'a magician or a madman'.",
        "verse_53": "Have they bequeathed it to one another? Nay' rather they are a people contumacious.",
        "verse_54": "Therefore O beloved! (Prophet) turn your face from them and there is no blame on you.",
        "verse_55": "And admonish, for admonition benefits the Muslims.",
        "verse_56": "And I have created the Jinn and the men only for this that they may worship Me.",
        "verse_57": "I ask for no provision from them, and nor I desire that they should feed Me.",
        "verse_58": "Undoubtedly it is only Allah, the Great Provider, the Powerful, the Authoritative.",
        "verse_59": "Surely, then for those who do wrong there is a portion of torment as there was a portion for their fellows, therefore let them not ask Me to hasten.",
        "verse_60": "\"Woe\" is then to the infidels because of that day of theirs which they are promised."
     },
    "count": 60
}
