{
    "name": "al-Qalam",
    "index": "068",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By the pen and by that which they (angels) write.",
        "verse_2": "You are not, by the grace of your Lord, mad.",
        "verse_3": "And certainly, for you there is an endless reward.",
        "verse_4": "And undoubtedly, you possess excellent manners.",
        "verse_5": "Then now you shall soon see and they shall also see.",
        "verse_6": "As to which of you was caught with madness.",
        "verse_7": "Undoubtedly, your Lord knows well him who goes astray from His path, and he knows well those who are guided.",
        "verse_8": "Therefore hear not the words of the beliers.",
        "verse_9": "They desire that anyhow you should be appeased then they too would be appeased.",
        "verse_10": "And hear not any such one who is a big swearer the mean.",
        "verse_11": "One who taunts a lot, going around with slander?",
        "verse_12": "Forbidder of good, transgressor, sinful.",
        "verse_13": "Ill-mannered, and moreover his birth is faulty.",
        "verse_14": "This is because he possesses some wealth and children.",
        "verse_15": "When Our signs are recited to him, he says 'stories of the ancients'.",
        "verse_16": "We shall soon brand upon his swine like snout.",
        "verse_17": "Undoubtedly, We have tried them as We tried the owners of the garden when they swore that they would certainly reap their crop in the morning.",
        "verse_18": "And they said not 'if Allah please'.",
        "verse_19": "Then something going round from your Lord went round it while they were asleep.",
        "verse_20": "And in the morning it was as it were fruits plucked.",
        "verse_21": "Then they called one another in the morning.",
        "verse_22": "Saying, 'go to your fields early in the morning if you are going to reap.'",
        "verse_23": "And they went forth early in the morning, whispering together.",
        "verse_24": "That no needy person should come in your garden today.",
        "verse_25": "And they went forth early in the morning, determined upon their purpose.",
        "verse_26": "But when they saw it, they said, 'undoubtedly, we have lost our way.'",
        "verse_27": "Nay, rather we have been deprived of everything.",
        "verse_28": "The most moderate of them said, \"Did I not say to you why do you not glorify Allah?\"",
        "verse_29": "They said, 'Glory is to our Lord, undoubtedly, we had been unjust.",
        "verse_30": "Now one turned towards other reproaching.",
        "verse_31": "They said, 'Ah! Woe to us, undoubtedly, we were contumacious.",
        "verse_32": "It may be that our Lord will give us in exchange a better than it, we do humbly turn to our Lord.",
        "verse_33": "Such is the punishment, and the punishment of the Hereafter is far greater. What a good thing it was, if they knew?",
        "verse_34": "Undoubtedly, for the God-fearing, there are Gardens of Bliss with their Lord.",
        "verse_35": "Shall We make the Muslims like the culprits?",
        "verse_36": "What happened to you? How you judge?",
        "verse_37": "Have you any Book wherein you read?",
        "verse_38": "That you shall have in it whatever you choose?",
        "verse_39": "Or have you some oaths from Us, reaching to the Day of Resurrection that you shall have all that you claim?",
        "verse_40": "Ask them which of them is guarantor thereof?",
        "verse_41": "Or have they some associates? Let them, then bring their associates, if they are truthful.",
        "verse_42": "The day when a leg shall be exposed (the meaning is known to Allah) and they will be called upon to prostrate themselves, they will not be able to do so.",
        "verse_43": "Their eyes will be cast down, and humiliation will be covering them, and they were indeed called upon to prostrate themselves in the world when they were sound healthy.",
        "verse_44": "So leave him to Me, who belies this word. Soon We shall draw them step by step whence they know not.",
        "verse_45": "And I shall grant them respite, undoubtedly, My secret planning is very strong.",
        "verse_46": "Or do you ask them a wage so that they are laden with debt?",
        "verse_47": "Or is the unseen with them so that they are writing?",
        "verse_48": "Therefore with for the command of your Lord and be not as the Man of the Fish when he called out while his heart was choking.",
        "verse_49": "Had not the favor of his Lord reached him for his care, he would have surely been cast upon land blamed.",
        "verse_50": "Then his Lord chose him and made him of His near ones.",
        "verse_51": "And it seems that the infidels with their bad looks will necessarily, stumble you when they hear Quran and they say, 'He is surely faraway from wisdom.'",
        "verse_52": "And it is not, but an admonition for the worlds."
       },
    "count": 52
}
