{
    "name": "al-Haqqah",
    "index": "069",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "That inevitable truth.",
        "verse_2": "How is that inevitable truth?",
        "verse_3": "And what did you know how is that inevitable?",
        "verse_4": "Thamud and Aad belied that strong calamity.",
        "verse_5": "Then as for Thamud, they were destroyed with an extreme uproar.",
        "verse_6": "And as for Aad, they were destroyed by a fierce roaring windstorm.",
        "verse_7": "Which He subjected them forcefully for seven nights and eight days consecutively, then see those people in it lying down, as though they were trunks of palm-trees lying down.",
        "verse_8": "Do you see any remnant of them?",
        "verse_9": "And Firawn and those before him, and the overthrown towns committed error.",
        "verse_10": "And they disobeyed the Messenger of their Lord, therefore He seized them with a strong seizing.",
        "verse_11": "Undoubtedly, when the water rose high, We bore you in the boat.",
        "verse_12": "That We might make it a reminder for you and it might be ratained by the ears that retain after hearing.",
        "verse_13": "Then when the trumpet is blown instantly.",
        "verse_14": "And the earth and the mountains are being crushed after lifting up all at once.",
        "verse_15": "That is the day when will happen the inevitable event.",
        "verse_16": "And the heaven will cleave asunder, then on the day it will be in a miserable condition.",
        "verse_17": "And the angels will be standing on the sides thereof, and on that day the eight angles will bear over them the throne of your Lord.",
        "verse_18": "On that day you all shall be presented and no hiding soul shall remain hidden.",
        "verse_19": "Then as to him whose record shall be given in his right hand, he will say, 'take and read my record.'",
        "verse_20": "I was convinced that I would reach to my accounting.",
        "verse_21": "Therefore he is in his desired comfort.",
        "verse_22": "In a lofty Garden.",
        "verse_23": "Its clusters are within reach.",
        "verse_24": "Eat and drink a contentful recompense for that you sent forth in the days gone by.",
        "verse_25": "And as for him whose record shall be given in his left hand, he will say, 'oh would that, I had not been given my record!",
        "verse_26": "And I would not have known what is my reckoning?",
        "verse_27": "Oh, would that death had made an end of me.",
        "verse_28": "My wealth has availed me nothing.",
        "verse_29": "My all strength has gone from me.",
        "verse_30": "Seize him and put chains in his neck.",
        "verse_31": "Then cast him into blowing fire.",
        "verse_32": "Then thrust him in a chain the length of which is seventy cubits.",
        "verse_33": "Undoubtedly, he did not believe in Allah, the Great.",
        "verse_34": "And he did not urge the feeding of the needy.",
        "verse_35": "Therefore he today has no friend here.",
        "verse_36": "Nor any food save pus of the people of Hell.",
        "verse_37": "Which none but the sinners eat?",
        "verse_38": "But no, I swear by what you see.",
        "verse_39": "And by all that you see not.",
        "verse_40": "Undoubtedly, this Quran is the talks with a noble Messenger.",
        "verse_41": "And it is not the word of any poet. How little you believe!",
        "verse_42": "And it is not the word of any soothsayer. How little you heed!",
        "verse_43": "It has been sent down by Him who is the Lord of entire world.",
        "verse_44": "And if he would have said against Us even one word forging from himself.",
        "verse_45": "We would surely have taken revenge with full force.",
        "verse_46": "And then We would surely have severed his life vein.",
        "verse_47": "And not any of you could have defended him.",
        "verse_48": "And undoubtedly, this Quran is an admonition to the Godfearing.",
        "verse_49": "And surely We know that some among you are beliers.",
        "verse_50": "And undoubtedly, it is a great sorrow to the infidels.",
        "verse_51": "And undoubtedly, it is the truth of absolute certainty.",
        "verse_52": "So O beloved Prophet! Glorify your Lord the Great."
    },
    "count": 52
}
