{
    "name": "al-Anfal",
    "index": "008",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "(O beloved Prophet,) they ask you concerning the spoils. Say you, The spoils belong to Allah and the Messengers; then fear Allah and set things right among yourselves; and obey Allah and His Messenger, if you believe.'",
        "verse_2": "Only they are believers whose hearts tremble when Allah is mentioned, and when His signs are recited to them, their faith get increased and upon their Lord they put their trust.",
        "verse_3": "Those who establish prayer and spend something of what We have provided them.",
        "verse_4": "It is these the true Muslims. For them are grades with their Lord and forgiveness and an honorable provision.",
        "verse_5": "As (O beloved Prophet!) your Lord brought you forth from your house with truth, and undoubtedly, a group of Muslim was unhappy over it.",
        "verse_6": "They were disputing with you about the truth after it has become clear, as if they are being driven towards death with their eyes open.",
        "verse_7": "And remember, when Allah promised you that in both these parties, one is for you, and you wished, that you should have that in which there is no rankle, and Allah wished that truth be proved truth by His words and to cut off the root of the infidels.",
        "verse_8": "That He might establish truth as truth and falsify the false, though the guilty might dislike.",
        "verse_9": "When you were crying for help from your Lord, then He responded to you that He was going to help you with a series of thousand angels.",
        "verse_10": "And Allah did this but for your pleasure and in order that your hearts might find contentment; and there is no help but from Allah; undoubtedly, Allah is Dominant, Wise.",
        "verse_11": "When He covered you with drowsiness, it was a security from Himself, and sent down water upon you from heaven that He might cleanse you therewith and remove from you the filth of the devil (Satan) and might give courage to your hearts and make your steps firm therewith.",
        "verse_12": "When (O beloved Prophet,) your Lord was revealing to the angels that, 'I am with you, keep ye firm the Muslims. Soon I shall cast terror into the hearts of the infidels, then strike above the ' necks of the infidels and strike off every fingertip of them.'",
        "verse_13": "This is because, they opposed Allah and His Messenger, and whosoever opposes Allah and His Messenger, then undoubtedly, severe is the torment of Allah.",
        "verse_14": "This, taste it then, and along with it is the torment of Fire for the infidels.",
        "verse_15": "O believers! When you encounter the infidels in the battlefield, then turn not your backs to them.",
        "verse_16": "And whosoever will turn his back to them that day, but for practicing the art of war or for the sake of joining his company, then he returns in the wrath of Allah and his abode is Hell; and what an evil place is to return to!",
        "verse_17": "Therefore you did not slay them, but Allah slew them. And O beloved Prophet! The dust that you did throw, you did not throw, but Allah threw, and in order that He might confer on the Muslim a better reward than it. Undoubtedly, Allah ia Hearing, Knowing.",
        "verse_18": "This, take it and with it is this that Allah is the Weakener of the plot of the infidels.",
        "verse_19": "O infidels if you demand judgement, then this judgement has indeed come to you, And if you desist, it is better for you; but if you again make mischief, then We shall again punish you, and your party shall avail you not, however, numerous it be and with it is this that Allah is with the Muslims.",
        "verse_20": "O believers! Obey Allah and His Messenger, and turn not away from him after hearing him.",
        "verse_21": "And be not like those who said, 'we hear', and they hear not.",
        "verse_22": "Undoubtedly, the worst of animals in the sight of Allah are those who are the deaf and dumb, who have no sense.",
        "verse_23": "And if Allah had known any good in them, He would have caused them to listen. And if He had made them hear, even then in the end, they would have turned away, turning their faces.",
        "verse_24": "O believers! respond to the calling of Allah and Messenger, when the Messenger calls you for a thing that will give you life; and know that Allah's command comes between man and his heart's desires and this that you are to be raised towards Him.",
        "verse_25": "And remain fearing that calamity which will never fall exclusively upon those among you who do wrong. And know that severe is the torment of Allah.",
        "verse_26": "And remember, when you were few downtrodden in the land, and were fearful, lest the people should snatch you away, then He gave you shelter, and strengthened you with His help, and provided you with good things, that haply you might be thankful.",
        "verse_27": "O believers! Betray not Allah and Messenger and nor commit defalcation in your trusts knowingly.",
        "verse_28": "And know that your wealth and your children are all a trial, and with Allah is the great reward.",
        "verse_29": "O believers! if you will fear Allah, He will grant you that by which you may be able to distinguish between right and wrong and will remove off your evils and will forgive you. And Allah is the Owner of great Grace.",
        "verse_30": "And (O beloved Prophet!) remember, when the infidels were plotting against you to confine you or to slay you or to drive you forth. And they were plotting their own and Allah was devising His Own and Allah's devise is the best.",
        "verse_31": "And when Our verses are recited to them, then they say, 'Yes, we have heard, if we wished, we could certainly utter the like of this. It is not, but the stories of ancients.'",
        "verse_32": "And when they said, 'O Allah, if this Quran indeed be the truth from You, then rain down upon us stones from heaven or bring down upon us any painful chastisement.'",
        "verse_33": "And Allah is not One to chastise them, till (O beloved Prophet) you are in their midst. And Allah is not to chastise them, whilst they are begging forgiveness.",
        "verse_34": "And what have they that Allah should not chastise them, when they are hindering from the sacred mosque, and they are not its guardian. Its guardians are the pious ones only, but most of them know not.",
        "verse_35": "And their prayer at the Holy House (Ka'bah) is nothing but whistling and clapping. Then taste the torment now, the recompense of your infidelity.",
        "verse_36": "Undoubtedly, the infidels spend their wealth to prevent from the path of Allah, they will spend it now, then again they will regret on it, then will be overpowered. The infidels shall be gathered towards Hell.",
        "verse_37": "In order that Allah may separate the impure from the pure, and putting the impure one upon the other, all piling them together cast them into the hell. It is they who are the losers.",
        "verse_38": "Say you, to the infidels, 'If they desisted, then that which was past would be forgiven. But if they repeated the same thing, then the precedence of the former people had already gone.",
        "verse_39": "And fight them on till there remains not any mischief and the entire religion be only of Allah; then if they desist, then Allah is seeing their deeds.",
        "verse_40": "And if they turn back, then know that Allah is your Protector, what an excellent Protector and what an excellent Helper!",
        "verse_41": "And know that whatever spoil of war you take, then one fifth of it belongs exclusively to Allah and to the Messenger, and to the kindred and the orphans and the needy and the wayfarer, if you have believed in Allah and what We sent down upon Our bondman on the Day of Decision, the day when the two armies met. And Allah can do everything.",
        "verse_42": "When you were on the hither side of the valley and the infidels on the yonder side, and the caravan was below you (on the Coast Plain), and if you would have made any mutual promise, surely you would not have reached on appointed time, but this has happened in order that Allah might fulfil the work which is to be done; so that whoever was to perish might perish with proof, and whoever was to survive might survive with proof. And undoubtedly, Allah is Hearing, Knowing.",
        "verse_43": "When (O Beloved Prophet,) Allah showed the infidels few to you in your dream. And (O Muslims,) if He had shown them numerous, then certainly you would have shown timidity and would have quarreled about the matter, but Allah saved you. Undoubtedly, He knows the thoughts in the breasts.",
        "verse_44": "And when at the time of encounter, the infidels were shown to you as few, and made you appear few in their eyes, so that Allah might fulfill the work which is to be done. And towards Allah is the return of all affairs.",
        "verse_45": "O believers! When you encounter any army, then stand firm, and remember Allah much, that you may attain the goal.",
        "verse_46": "And obey Allah and His Messenger, and dispute not with one another, otherwise you will show timidity, and your tied strength will depart from you, and be patient. Verily Allah is with the patient.",
        "verse_47": "And be not like those who came out of their homes, boastfully and to be seen of men, and barring from Allah's way. All their work is under the control of Allah.",
        "verse_48": "And when the devil (Shaitan) decked their work fair in their sight and said, 'No man is to prevail against you today, and you are under my protection.' Then when both armies came in front of each other, he ran upon his heels and said, 'I am quit of you, I see what you see not, I fear Allah.' And severe is the torment of Allah.",
        "verse_49": "When the hypocrites and those in whose hearts there is disease used to say, 'These Muslims are proud of their religion.' And whosoever relies upon Allah, then undoubtedly, Allah is Dominant, Wise.",
        "verse_50": "And if you could see, when the Angels take away the souls of the infidels, they are smiting their faces and their backs, and taste the torment of burning.",
        "verse_51": "This is in recompense of what your hands have sent on before, and Allah is not unjust unto His bondmen.",
        "verse_52": "In the manner of people of Firawn (Pharaoh) and those before them they disbelieved in the signs of Allah, then Allah seized them for their sins. Undoubtedly Allah is Strong, Severe in torment.",
        "verse_53": "This is so because Allah does not change the favor that He has conferred upon a people, until they change themselves; and verily Allah hears, knows.",
        "verse_54": "In the manner of the people of Firawn (Pharaoh) and those before them, they belied the signs of their Lord, then We destroyed them for their sins, and We drowned the people of Firawn, and they were all unjust.",
        "verse_55": "Undoubtedly, the worst of beasts in the Sight of Allah are those who committed infidelity and would not believe.",
        "verse_56": "Those with whom you had entered into a covenant, then they break their covenant every time and do not fear.",
        "verse_57": "Therefore, if you find them anywhere in war, kill them in such a manner that their remaining ones may be put to flight. Haply, they may be admonished.",
        "verse_58": "And if you fear treachery from any people, throw back to them their covenant on equal basis. Undoubtedly, the treacherous are not liked by Allah.",
        "verse_59": "And let the infidels never boast that they have gone out of hand. Undoubtedly, they cannot frustrate.",
        "verse_60": "And keep ready for them the strength you can and as many of horses as you can, whereby you may put terror in the hearts of those who are enemies of Allah and of yours and in the hearts of some others besides them whom you know not; Allah knows them. And whatever you will spend in the path of Allah shall be repaid to you in full and in no way you will be in loss.",
        "verse_61": "And if they incline towards peace, then incline you also and put trust in Allah. Undoubtedly, He is the One Hearing, Knowing.",
        "verse_62": "And if they intend to deceive you, then Allah is Sufficient for you. He it is Who gave strength to you with His help and with Muslims.",
        "verse_63": "And He put affection in their hearts. If you had spent all that is in the earth, you could not have put affection in their hearts, but Allah have united their hearts. Undoubtedly, it is He, Dominant, Wise.",
        "verse_64": "O Prophet! The communicator of the hidden news! Allah suffices you and all these Muslims who followed you.",
        "verse_65": "O Communicator of the hidden news! Urge the Muslims to wage holy war. If there will be twenty of you patient, they will overcome two hundred, and there be hundreds of you, they will overcome a thousand infidels, because they do not understand.",
        "verse_66": "Now Allah has lightened your burden, and He knows that you are weak. Then if there be a hundred of you patient, they shall overcome two hundred; and if there be a thousand of you, they shall overcome two thousand by the command of Allah. And Allah is with the patient.",
        "verse_67": "It is not befitting to any Prophet that he should make captive to infidels, until he has immensely shed their blood in the land. You desire the goods of the world; and Allah desires the Hereafter. And Allah is Dominant, Wise.",
        "verse_68": "If Allah would not have written a thing before, then O Muslims! a great torment would have come to you for what you took as ransom from the infidels.",
        "verse_69": "Then eat of what you have obtained as spoil of war, lawful and pure, and remain fearing Allah. Verily Allah is Forgiving, Merciful.",
        "verse_70": "O Communicator of the hidden news (Prophet) say to the prisoners in your hands, 'If Allah will find any good in your hearts, then He will give you better than what has been taken from you and will forgive you' And Allah is Forgiving, Merciful.",
        "verse_71": "And O beloved Prophet! If, they will intend to be treacherous to you, then they have already dealt treacherously with Allah before, therefore He gave so many under your control. And Allah Is Knowing, Wise.",
        "verse_72": "Undoubtedly, those who believed and left their hearth and homes for Allah and fought with their wealth and their lives in the way of Allah, and those who gave shelter and helped - they are heirs one of another. And those who believed and did not emigrate, you have no duty to inheritance unless they emigrate, if they seek help from you in the matter of the religion, then it is obligatory upon you to help them,, but against a people between whom and you there is an agreement. And Allah is seeing your doings.",
        "verse_73": "And the infidels are heirs one of another. If you will not do such, then there shall be in the land mischief and great disorder.",
        "verse_74": "And those who believed and emigrated and fought in the way of Allah and those who gave shelter and helped they are true believers. For them is forgiveness and honorable provision.",
        "verse_75": "And those who believed afterwards and emigrated and waged the holy war with you, they also are of you. And the blood relations are nearer to one another in the Book of Allah. Undoubtedly Allah knows all things."
       },
    "count": 75
}
