{
    "name": "Qaf",
    "index": "050",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Qaaf. By the Glorious Quran.",
        "verse_2": "But rather they wondered that there has come to them a warner from among themselves. And the infidels said, 'this is a strange thing.'",
        "verse_3": "Will when we be dead and become dust, we be raised again to life? This return is remote.",
        "verse_4": "We know what the earth diminishes of them; and with Us is a Book preserving.",
        "verse_5": "But rather they belied the truth when it came to them and so they are in a state of confusion.",
        "verse_6": "Have they not looked up to the sky above them, how We have built it and adorned it and that there is no rift therein?",
        "verse_7": "And the earth We have spread it out, and placed therein anchors of mountains and caused to grow therein every beautiful pair.",
        "verse_8": "An insight and understanding for every returning bondman.",
        "verse_9": "And We sent down out of heaven blessed water and We caused to grow there by gardens and the grain that is harvested.",
        "verse_10": "And tall palm trees with spathes piled one over another.",
        "verse_11": "As a provision for bondmen and We thereby revived a dead city. Thus is your coming out from the graves.",
        "verse_12": "Belied before them the people of Nuh and the men of Rass and Thamud.",
        "verse_13": "And Aad, Firawan and the compatriots of Lut.",
        "verse_14": "And the men of wood and the people of Tubba. Every one of them belied the Messengers, and so the promise of My torment was proved.",
        "verse_15": "Have We then become weary by making for the first time? Nay, but rather they are in doubt regarding a new making.",
        "verse_16": "And indeed We created man and We know what his soul whispers within him, and We are nearer to him, and even his jugular vein.",
        "verse_17": "When the two receivers receive from him one sitting on the right side and another at the left.",
        "verse_18": "Not a word the utters but there is sitting a watcher ready by him.",
        "verse_19": "And there has come the stupor of death with truth. This is from which you were trying to run.",
        "verse_20": "And the Trumpet was blown. This is the Day of the torment promised.",
        "verse_21": "And every soul came forth in this manner that with it there was a driver and a witness.",
        "verse_22": "Assuredly, you were heedless of this, therefore We have removed from you the covering so today your sight is sharp.",
        "verse_23": "And his companion angel said, 'this is what is ready with me'.",
        "verse_24": "It will be commanded, cast you, twain into Hell every ungrateful, obstinate.",
        "verse_25": "Who is hinderer of the good transgressor, doubter.",
        "verse_26": "Who has set up any other God with Allah so you twain cast him into the severe torment.",
        "verse_27": "His associate devil said, 'Our Lord,' I did not make him contumacious, yes, he was himself in a far-off error'.",
        "verse_28": "He will say, 'dispute not before Me' for I had already warned you of the torment.",
        "verse_29": "The word is not changed with Me, nor I wrong My bondmen.",
        "verse_30": "The day when We shall say to Hell, 'are you filled up'? It will say, 'is something more?'",
        "verse_31": "The paradise shall be brought near to the pious that it shall be not far off from them.",
        "verse_32": "This is what is promised to you for every pertinent, watchful.",
        "verse_33": "Whoever feared the All- Affectionate in the unseen and came to Him with a pertinent heart.",
        "verse_34": "It will be said to them, 'Enter the paradise in peace. This is the day of Eternity.'",
        "verse_35": "For them there is whatever they desire and with Us there is yet more than that.",
        "verse_36": "How many a generation We destroyed before them that they were stronger in velour than they, then they searched about in the cities, Is there any place of refuge?",
        "verse_37": "Undoubtedly, there is admonition in it for him who has a heart or who gives ear and be heedful.",
        "verse_38": "Surely, We made the heavens and the land and whatever is in between in six days and weariness came not to Us.",
        "verse_39": "Therefore be patient over what they say, and sanctify your Lord praising Him before the rising of the sun and before its setting.",
        "verse_40": "And sanctify Him in the late night and after prayers.",
        "verse_41": "And listen attentively, the day when the caller will call from a place nearby.",
        "verse_42": "The day when they will hear the uproar in truth. This is the day of coming forth from the graves.",
        "verse_43": "Undoubtedly, We give life and cause death and to Us is the return.",
        "verse_44": "The day when the earth will cleave as-under from them and they will come out hastening. This is the gathering, quite easy for Us.",
        "verse_45": "We are knowing well what they are saying and you are not a tyrant over them therefore admonish by Quran him who fears My threat."
     },
    "count": 45
}
