{
    "name": "Yusuf",
    "index": "012",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif-Lam-Ra. These are the verses of a Book luminous.",
  "verse_2": "No doubt, We have sent it down as an Arabic 'Quran so that you may understand.",
  "verse_3": "We relate to you the best narration, in that We revealed to you this Quran, though no doubt, you had no knowledge before.",
  "verse_4": "Recall when Yousuf (Joseph) said to his father, 'O my father, I saw eleven stars and the sun and the moon: I saw them prostrating for me.'",
  "verse_5": "He said, O my son! Relate not your dream to your brothers, that they will devise any scheme against you. No doubt, Satan (the devil) is the clear enemy of man.",
  "verse_6": "And thus your Lord will select you, and teach you to draw conclusion of the discourses, and perfect His blessings upon you and upon the house of Yaqoob (Jacob), as He perfected it formerly on both your forefathers, Ibrahim (Abraham) and Ishaque (Isaac). No doubt, your Lord is Knowing, Wise.",
  "verse_7": "No doubt, in Yousuf and his brethren there are signs for the inquirers.",
  "verse_8": "When they said, 'Surely Yousuf and his brother are dearer to our father than we, and we are a party. No doubt, our father is clearly absorbed in their love.",
  "verse_9": "'Kill Yousuf or cast him forth into some land so that your father's face may only remain towards you, and thereafter be righteous.'",
  "verse_10": "One sayer of them said, 'kill not Yousuf, and cast him into a dark well, that any traveler may take him away, if you are to do.'",
  "verse_11": "They said, 'O Our father! What happened to you that you are not trusting us regarding Yousuf, and we are his wellwishers?",
  "verse_12": "'Send him forth with us tomorrow that he may eat fruits and play; and no doubt, we are his watchmen.'",
  "verse_13": "He said, 'It will grieve me that you should take him away, and I fear that wolf may eat him while you remain unaware of him.'",
  "verse_14": "They said, 'If the wolf eats him, and we are a party, then we are of no use.'",
  "verse_15": "Then when they took him away, and all agreed that they should put him in a dark well, and We revealed to him that necessarily you shall inform them of this doing while they shall not be knowing.",
  "verse_16": "And at night they came to their father weeping.",
  "verse_17": "They said, 'O our father! We went away racing, and left Yousuf near our provisions, then the wolf ate him, and you would not believe us, though we may be true.'",
  "verse_18": "And they brought his shirt stained with false blood. He said, 'Your hearts have made a thing for you, then patience is good; and I seek help only from Allah against what you describe.",
  "verse_19": "And there came a caravan, they sent their water carrier then he let down his bucket. He said.' 'Hurrah'; what a good news, this is a boy,' and concealed him as a treasure. And Allah knows what they do.",
  "verse_20": "And the brothers sold him for a mean price — on a counted dirhams, and they had no inclination in him.",
  "verse_21": "And the man of Egypt who bought him said to his wife, 'Keep him honorably, perchance he may profit us, or we may take him as son.' And thus We established Yousuf in the land, and in order that We may teach him to draw conclusions of the discourses. And Allah is Dominant over His affairs, but most men know not.",
  "verse_22": "And when he reached his full strength, We bestowed upon him wisdom and knowledge. And thus We recompense the righteous.",
  "verse_23": "And she, in whose house he was, allured him lest he may control his self, and bolted all the doors, and she said, 'Come, I say to you.' He said, 'Allah be my refuge that Aziz is my lord that is to say nourisher, he has kept me very well. No doubt, the unjust never prosper.'",
  "verse_24": "And no doubt, the woman desired him, and he would also have desired her, if he would not have seen the proof of his Lord. Thus We did, in order that We might avert from him evil and indecency. No doubt, he is of my selected bondsmen.",
  "verse_25": "And both ran towards the door, and the woman tore his shirt from behind, and both met the husband of the woman near the door. She said, 'What is the punishment of him who desired evil with your wife, but that he should be imprisoned or a painful chastisement?'",
  "verse_26": "He said, 'She allured me lest I may protect myself and a witness of the household of the woman bore witness, 'If his shirt is torn from before, then the woman is true and he is a liar.",
  "verse_27": "'And if his shirt is torn from behind, then the woman is a liar and he is truthful.'",
  "verse_28": "Then when Aziz saw his shirt torn from behind, he said, 'No doubt, this is the device of you women. No doubt, your device is great.",
  "verse_29": "'O Yousuf, do not think of it, and O woman! Ask forgiveness of your sin. No doubt, you are one of the sinners.'",
  "verse_30": "And certain women in the city said, 'The wife of Aziz allures the heart of her young boy. No doubt, his love has deepened in her heart. We find her infatuated with love openly.'",
  "verse_31": "Then when Zalikha heard their whispering then she sent for them and prepared for them cushioned couches, and gave to each of them a knife, and said to Yousuf, 'Come forth to them.' And when the women saw Yousuf, they began to speak of his greatness, and cut their hands and said, 'Holy is Allah, he is not a mankind, he is not but a noble angel.'",
  "verse_32": "Zalikha said, 'Then this is he about whom you used to reproach me, and no doubt, I desired to allure his heart, then he preserved himself, And no doubt, if he will not do what I say to him, then necessarily he will be put in prison and surely he shall bear insult.'",
  "verse_33": "Yousuf said, 'O my Lord, prison is dearer to me than the work to which they call me. And if you shall not turn their guile from me, then I shall incline towards them and will be ignorant.'",
  "verse_34": "Then his Lord heard his prayer, and turned the guile of the women from him. No doubt, He hears, knows.",
  "verse_35": "Then even after seeing all signs, the same previous thought came to their mind that they should put him in prison for a period.",
  "verse_36": "And two young men entered the prison with him. One of them said, 'I dreamed that I press wine' and the other said, 'I dreamed that there were some breads on my head whereof the birds were eating. Tell us its interpretation. No doubt, we see you righteous.'",
  "verse_37": "Yousuf said, 'The food which, you use to get, will not come to you, but I shall tell you the interpretation thereof before it comes to you, this is of those knowledge’s which my Lord has taught me. No doubt, I did not concede to the religion of the people who do not believe in Allah and they are the rejecters of the Hereafter.",
  "verse_38": "'And I followed the religion of my fathers, Ibrahim and Ishaque and Yaqoob. It is not for us to associate anything with Allah. That is a grace of Allah upon us and mankind, but most people thank not.",
  "verse_39": "'O my two fellow prisoners! Are separate Lords better or Allah the One Omnipotent?",
  "verse_40": "'You worship not besides Him but only names which you and your fathers have carved out. Allah has sent down no authority for them. There is no judgement but of Allah. He commanded not to worship anyone besides Him. This is the right religion, but most people know not.",
  "verse_41": "'O my two fellow prisoners! As for one of you he will serve wine for drink to his lord (King), and as for the other, he will be crucified, and the birds will eat of his head. The matter about which you inquired has been decreed.'",
  "verse_42": "And Yusuf said to one whom he considered would be saved of the two, 'Mention me before your lord (King); then Satan (The Devil) made him forget to mention Yousuf to his lord (King), then Yousuf continued in the prison for several years more.",
  "verse_43": "And the King said, 'I saw in a dream seven fat cows that they were being eaten by seven lean cows, and seven green ears and seven others dry. O courtiers! Answer my dream if you know interpretation of the dream.'",
  "verse_44": "They said, 'These are confused dreams, and we know not the interpretation of dreams.'",
  "verse_45": "And the one who was saved of the two said when he remembered after a long time, 'I will tell you it’s interpretation, send me forth.'",
  "verse_46": "'O Yousuf! O man of truth! Give us interpretation regarding seven fat cows which are being eaten by seven lean ones and seven green ears and the other seven dry; perchance, I may return to the people, perchance they learn.'",
  "verse_47": "He said, 'You will do cultivation for seven continuous years, then what you reap, leave it in its ear, but a little which you may eat.",
  "verse_48": "'Then after it there shall come seven hard years, that shall eat up what you had stored up for them before, but a little which you may save.",
  "verse_49": "'Then thereafter there shall come a year wherein people will have rain and in which they will press juice.'",
  "verse_50": "And the king said, 'Bring him to me,' then when the Messenger came to him, he said, 'Return to your lord (king), then ask him what about the women who had cut their hands? No doubt my Lord knows their guile.'",
  "verse_51": "The king said, 'O women, what business you had when you desired to allure the heart of Yousuf.' They said, 'Holy is Allah, we did not find any evil in him.' The wife of Aziz said, 'Now the reality is discovered; I desired to allure his heart and no doubt, he is truthful.'",
  "verse_52": "Yousuf said, 'I have done this because Aziz should know that I betrayed him not behind his back, and Allah allows not the guile of betrayers.",
  "verse_53": "And I do not hold my soul free from sin, no doubt the soul is wont to command evil but that on whom my Lord has mercy. No doubt, my Lord is Forgiving, Merciful.'",
  "verse_54": "The King said, 'Bring him to me that I may choose him especially for myself.' Then, when he talked to him said, 'Certainly today, you are a man dignified, trusted with us.'",
  "verse_55": "Yousuf said, 'Set me over the treasures of earth. No doubt, l am watchful, knowing.'",
  "verse_56": "And thus We gave control to Yousuf over this land, wherein he might live wherever he wished. We cause Our mercy to reach whom We please, and We waste not the reward of the righteous.",
  "verse_57": "And surely the reward of the Hereafter is better for those who believed and remained duty- bound.",
  "verse_58": "And the brethren of Yousuf came, then appeared before him, and Yousuf recognized them but they remained unaware of him.",
  "verse_59": "And when he got ready their baggage, he said, 'Bring your step brother to me, do you not see that I give full measure and I am the best host.",
  "verse_60": "'But if you bring him not to me, then there is not measure for you with me and approach me not.'",
  "verse_61": "They said, 'We shall desire him from his father, and we are certainly to do it.'",
  "verse_62": "And Yousuf said to his servants, 'Put their capital in their saddlebags, haply they may recognize it when they go back to their home; perchance, they may return.'",
  "verse_63": "Then when they returned to their father, they said, 'O our father, the food-grain has been denied to us, so send with us our brother that we may bring food- grain and we shall surely safeguard him.'",
  "verse_64": "He said, 'May I trust you about him likewise I trusted you before about his brother. Then Allah is the best Guard and He is the most Merciful of the merciful.'",
  "verse_65": "And when they opened their goods, they found their capital returned to them. They said, 'O Our father, now what more should we desire? Here is our capital that has been returned to us, and we shall bring food-grain for our family and we shall guard our brother, and we shall find an extra camel load. This offering is nothing before a King.'",
  "verse_66": "He said, 'I will never send him with you, until you give me this solemn pledge of Allah that you will surely bring him back, but that you may be encompassed; then when they gave Yaqoob solemn pledge, he said, 'Allah is Responsible over what we say.'",
  "verse_67": "And said he, 'O my sons, enter not by one door, but enter you by separate gates. I cannot save you against Allah. All decisions belong to Allah; I relied on Him only, and let the relying rely on Him only.'",
  "verse_68": "And when they entered after the manner their father had commanded, it could not save them against Allah, yes there was a desire in the heart of Yaqoob which he fulfilled. And verily, he is the man of knowledge by Our teaching, but most men know not.",
  "verse_69": "And when they went to Yousuf, he gave his brother a place near himself, he said, 'Believe, I am your brother, therefore be not grieved of whatever they do.'",
  "verse_70": "Then when he made ready their baggage, he put the drinking cup in the saddlebag of his brother. Thereafter a crier cried, 'O men of caravan, no doubt, you are thieves.'",
  "verse_71": "They said, and turned to them, 'What it is that you find not.'",
  "verse_72": "They said, 'We do not find the king's measuring cup, and whosoever will bring it, he shall have a camel's load and I am his guarantor.'",
  "verse_73": "They said, 'By God, you are well aware that we came not for creating mischief in the land, nor we are thieves.'",
  "verse_74": "They said, 'What is the penalty of him, if you be liars?'",
  "verse_75": "They said, 'Its penalty is that he in whose baggage it is found, be himself the servant in recompense. Thus is the punishment of the unjust at our place.'",
  "verse_76": "Then first he began the search of their bags before the bag of his brother; then he took it out from the bag of his brother. We taught Yousuf thus to plan. He could not take his brother under the King's Law but this that Allah willed. We exalt in degrees whomsoever We please. And above every man of knowledge there is one of more Knowledge.",
  "verse_77": "The brother said, 'If he commits theft, then no doubt his brother has already committed theft before,' then Yousuf kept this thing secret in his heart and did not disclose it to them. He said within himself, 'You are at worse place, and Allah knows well what you fabricate.'",
  "verse_78": "They said, 'O Aziz, he has a father, aged and advanced in years, so take one of us in his place. No doubt we are seeing your favors.'",
  "verse_79": "He said, 'Be refuge of Allah that we should take any other but him with whom we found our goods, then we shall surely be unjust.'",
  "verse_80": "Then when they were disappointed of him, they began conferring going apart. His elder brother said, 'Do you not remember that your father had taken a solemn pledge of Allah from you, and before this how you committed mistake regarding Yousuf? Then I shall not move from this place until my father permits or Allah commands me, and His command is best.",
  "verse_81": "'Return you all to your father, and say, \"O our father, verily your son has committed theft, and we had become witnesses to this much what we had in our knowledge, and we were not guardians over the unseen.",
  "verse_82": "\"And enquire of the town wherein we were and the caravan in which we came. And no doubt, we are truthful.\"",
  "verse_83": "He said, 'your souls have made for you some excuse. Then patience is good. It is near that Allah may bring them all to me. No doubt, it is He the Knowing, the Wise.'",
  "verse_84": "And he turned away his face from him and said, 'Ah, woe on the separation of Yousuf,' and his eyes were whitened with grief and he suppressed his anger.",
  "verse_85": "They said, 'By God, you shall ever continue to remember Yousuf until you approach grave or pass away with your life.'",
  "verse_86": "He said, ‘I cry out for assistance in my anguish and sorrow unto Allah, and I know those glories of Allah which you know not.",
  "verse_87": "'O my sons! Go and search for Yousuf and his brother and despair not of Allah's mercy. No doubt, none despair of the mercy of Allah but a people disbelieving.'",
  "verse_88": "Then when they reached Yousuf, they said, 'O Aziz, distress has reached us and our family, and we have come with worthless capital, then you give us full measure and be charitable to us. No doubt, Allah rewards the charitable.'",
  "verse_89": "He said, 'Are you aware of what you did with Yousuf and his brother, when you were ignorant.'",
  "verse_90": "They said, 'Are you really Yousuf.' He said, 'I am Yousuf and this is my brother. No doubt, Allah has favored us. Verily whosoever refrains and be patient, then Allah wastes not the reward of the righteous.'",
  "verse_91": "They said, 'By God, surely Allah has preferred you above us, and no doubt, we had been sinners.'",
  "verse_92": "He said, 'There is no reproach today upon you. May Allah forgive you? And He is the most Merciful of the merciful.",
  "verse_93": "'Go with this shirt of mine, put it on my father's face, he shall recover his sight, and bring me all your family together.'",
  "verse_94": "When the caravan departed from Egypt, their father here said, 'No doubt, I find the scent of Yousuf, if you say me not that I am doted.'",
  "verse_95": "The sons said, 'By Allah, you are infatuated with the same old love.'",
  "verse_96": "Then when the bearer of glad tidings came, he laid that shirt on the face of Yaqoob, forthwith his sight came back. He said, 'Did I not say to you, that I know those glories of Allah which you know not.'",
  "verse_97": "They said, 'O our father, beg forgiveness of our sins, no doubt, we are sinful.'",
  "verse_98": "He said, 'Soon I shall beg my Lord to forgive you. Verily, He is the Forgiving, the Merciful.'",
  "verse_99": "Then when they all reached Yousuf, he offered a place near him to his mother and father and said, 'Enter' Egypt, if Allah will with security.'",
  "verse_100": "And he seated his mother and father on the throne, and all fell down prostrate for him, and Yousuf said, 'O my father, this is the interpretation of my first vision. Verily my Lord has made it true. And no doubt, He favored me that He brought forth me from the prison, and brought you all from the village after Satan had created dissention between me and my brothers. Surely my Lord makes easy anything He pleases. Verily He is the Knowing, Wise.",
  "verse_101": "'O my Lord! Verily You have bestowed on me a Kingdom and taught me to draw conclusion of some discourses. O Creator of heavens and earth, You are my Helper in this world and the Hereafter. Make me die as Muslim and join me with those who are worthy to be very close to you.'",
  "verse_102": "These are some tidings of Unseen, which We reveal to you. And you were not with them, when they agreed upon their plan, and they were devising.",
  "verse_103": "And most men will not believe, though you eagerly desire it.",
  "verse_104": "And you do not ask any wage from them; it is not but admonition to the whole world.",
  "verse_105": "And how many a sign there is in the heavens and earth that most men pass by them and are unaware of them.",
  "verse_106": "And most of them believe not in Allah but as associators.",
  "verse_107": "Have they become fearless from this that they may be encompassed by the torment of Allah, or the sudden coming of the Hour upon them while they are unaware?",
  "verse_108": "Say you, 'This is my way; I call towards Allah. I and those who follow my footsteps have insight. And Holy is Allah; and I am not an associator.'",
  "verse_109": "And all those who were sent as Messengers before you were men, whom We revealed, and all were residents of the cities. Have they not journeyed in the land, that they may see, what became the end of those before them? And no doubt, the abode of the Hereafter is better for the duty- bound. Have you not then wisdom?",
  "verse_110": "And so much so, when the Messengers had no hope of outer causes and the people thought that the Messengers had given them wrong information at that time, Our help came, then whomsoever We willed was rescued. And Our torment cannot be averted from the sinful people.",
  "verse_111": "No doubt, the eyes of the wise men are opened by their tidings. It is not a discourse concocted, but a confirmation of what went before and a detail explanation of everything, and a guidance and a mercy for the Muslims."
},
    "count": 111
}
