{
    "name": "al-Mumtahanah",
    "index": "060",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O believers! Take not for friends My and your enemies, you deliver the news to them in friendship, while they are deniers of the truth that has come to you, and drive out the Messenger and yourselves from homes because you believe in Allah, your Lord. If you have come out in my path to struggle and to seek My pleasure, take them not for friends; you send them secret message of love, while I know well what you conceal and what you conceal and what you reveal. And whoever of you does so, has, undoubtedly, gone astray from the straight path.",
        "verse_2": "If they get hold of you, they will be your enemies and will stretch forth their hands and their tongues towards you with evil, and they desire that you should anyhow become disbelievers.",
        "verse_3": "Never will profit you, neither your kindred nor your children on the Day of Judgement. He shall separate you from them. And Allah is seeing your doings.",
        "verse_4": "Undoubtedly, there was a good example to follow for you in Ibrahim and his companions, when they said to their people, 'undoubtedly, we are quit of you and that you worship besides Allah, we deny you', and there has appeared enmity and hatred between us and you forever; until you believe in One Allah, but the saying of Ibrahim to his father, 'I will surely ask forgiveness for you, and I have no authority for your any favor against Allah.' 'O our Lord! In You do we put our trust and to You do we turn, and to You is the final return.",
        "verse_5": "'O our Lord! Put not us in a trial of those who disbelieved, and forgive us, O our Lord; undoubtedly, You are the Esteemed One, Wise.'",
        "verse_6": "Undoubtedly, there was a good example in them or you, for him who has hope in Allah and the Last Day. And whosoever turns away, then undoubtedly Allah is Self Sufficient, All- Praised.",
        "verse_7": "It is near that Allah may create friendship between you and those of them who are your enemies. And Allah is All- Powerful, and Forgiving, Merciful.",
        "verse_8": "Allah forbids you not regarding those who have not fought against you in religion and expelled you not from your homes, that you may show favor to them and act justly towards them. Undoubtedly, the just are loved by Allah.",
        "verse_9": "Allah only forbids you regarding those who have fought against you in religion or expelled you from your homes or have helped others in driving you out, that you should take them for friends, and whosoever takes them for friends, they are the oppressors.",
        "verse_10": "O believers! When Muslim women come to you from pagan territory leaving their homes, test them. Allah knows better as to their faith, then if you know them to be believing women, return them not to the infidels. Neither those women are lawful to them nor they are lawful to them. And give their unbeliever husbands what they have spent, and there is no blame on you if you marry them when you pay them their dowries. And have not firm hold to the matrimonial ties with the unbelieving women and ask back what you have spent and the infidels should ask for what they have spent. This is the order of Allah. He judges between you. And Allah is All-Knowing, Wise.",
        "verse_11": "And if some women go away from the custody of Muslims to the disbelievers, and give from the spoils to those whose women have gone away the like of that which they had spent. And fear Allah in Whom you believe.",
        "verse_12": "O Prophet! when Muslim women come to you for taking oath of allegiance at your hands, that they will not associate anything with Allah, and they will not commit theft, and will not commit adultery and nor kill their children, and nor will bring a calumny forging it between their hands and feet (regarding birth) and will not disobey you in anything good, then accept their allegiance and beg Allah to forgive them. Undoubtedly Allah is Forgiving, Merciful.",
        "verse_13": "O believers! Take not as friends those upon whom is Allah's wrath. They are indeed despaired of the Hereafter as the infidels are despaired of the inmate of the graves."
    },
    "count": 13
}
