{
    "name": "al-Mu'minun",
    "index": "023",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Undoubtedly the believers reached their goal.",
    "verse_2": "Those who beseech in their prayers.",
    "verse_3": "And those who turn away from vain talk.",
    "verse_4": "And those who are active in paying poor-due (Zakat).",
    "verse_5": "And those who guard their private parts.",
    "verse_6": "But from their wives or lawful handmaids who are the property of their hand for (in their case) they are not to be blamed.",
    "verse_7": "Then whoso desires anything more than these two, they are the transgressors.",
    "verse_8": "And those who regard their trusts and their covenant.",
    "verse_9": "And those who keep watch to their prayers.",
    "verse_10": "They are indeed the inheritors.",
    "verse_11": "Who shall inherit the Paradise, they shall abide therein.",
    "verse_12": "And assuredly, We made man from the extract of clay.",
    "verse_13": "Then We made him a drop of water and put in a strong serenity.",
    "verse_14": "Then We made the drop of water a clot, then We made the clot a piece of flesh, then We made the piece of flesh bones, then We clothed the bones with flesh, then We developed it into another shape. So Great blessed be Allah, the Best Creator.",
    "verse_15": "Then after this, necessarily you are to die.",
    "verse_16": "Then you all shall be raised up on the Day of Judgement.",
    "verse_17": "And assuredly, We made seven ways above you, and We are not heedless of creation.",
    "verse_18": "And We sent down water from the heaven according to an estimate, then caused it to stay in the earth; and undoubtedly, We are Potent to take it away.",
    "verse_19": "Then We created therewith your gardens of dates and grapes, for you therein are abundant fruits, and of them you eat.",
    "verse_20": "And created a tree that springs forth from the Mount Sinai that grows oil and a sauce for those who eat.",
    "verse_21": "And undoubtedly, in the cattle there is a lesson for you. We give you to drink of what is in their bellies, and you have in them many benefits and of them you have your food.",
    "verse_22": "And upon them and on boat you are borne.",
    "verse_23": "And undoubtedly, We sent Nuh towards his people, then he said, 'O my people, worship Allah, there is no God for you besides Him. Do you not then fear?'",
    "verse_24": "Then his people's chiefs who disbelieved said, 'He is not but a man like you, he desires to become your superior. And if Allah had willed, He would have sent down angels; we have not heard this among our forefathers.",
    "verse_25": "'He is not but a mad man, wait, therefore, concerning him for a period.'",
    "verse_26": "Nuh submitted, 'O my Lord, help me for that they belied me.'",
    "verse_27": "Then We sent revelation to him, \"Make the Ark within Our sight and by Our command, then, when Our command comes and the oven boils, take into it two of every pair and your family, but those of them against whom the word has already gone forth; and talk to Me not regarding those who are unjust; they shall be surely drowned.",
    "verse_28": "\"Then when you are firmly seated yourself and those with you in the Ark, say then, 'All praise to Allah, Who delivered us from these unjust people.'",
    "verse_29": "\"And submit, 'O my Lord, disembark me to a blessed land and You are the Best of those who disembark.''",
    "verse_30": "Undoubtedly, in this, necessarily are signs, and verily We were necessarily to test.",
    "verse_31": "Then after them We produced another generation.",
    "verse_32": "Then We sent to them a Messenger from amongst themselves (saying), 'Worship Allah, there is no God for you besides Him, Do you then not fear?'",
    "verse_33": "And his people's chiefs who disbelieved and belied the presence of the Hereafter and to whom We gave comfort in the life of the world said, 'He is not but a man like you, he eats of what you eat and drinks of what you drink.",
    "verse_34": "'And if you obey a man like you, then necessarily you are in loss.",
    "verse_35": "'Does he promise you that when you will die and will become dust and bones, after this you shall be brought forth again?",
    "verse_36": "'It is far away, it is faraway, what is promised to you.",
    "verse_37": "'That is not but our life of this world that we die and we live and we are not to fee raised up.",
    "verse_38": "'He is not but a man who forged a lie against Allah and we are not going to believe in him.'",
    "verse_39": "He submitted, 'O my Lord, help me for they have belied me!'",
    "verse_40": "Allah said, 'In a little while they will meet the morning repenting.'",
    "verse_41": "Then a true uproar overtook them, then We made them like rubbish of grass. Be away then the unjust.",
    "verse_42": "Then after them We raised other generations.",
    "verse_43": "No nation can go ahead of their period, nor they can remain behind.",
    "verse_44": "Then We sent Our Messengers one after the other. Whenever its Messenger came to any nation, they belied him, then We caused the latter to meet the former, and made them tales, then be away the people who believe not.",
    "verse_45": "Then We sent Musa and his brother Haroon with Our signs and a clear authority.",
    "verse_46": "To Firawn (Pharaoh) and his courtiers, but they boasted and they were a people already possessed with dominance.",
    "verse_47": "Then they said, 'Shall we believe in two men like ourselves while their people are serving us.'",
    "verse_48": "Then they belied both of them, they were then of those who were destroyed.",
    "verse_49": "And undoubtedly, We gave Musa the Book that they might be guided.",
    "verse_50": "And We made Maryam and her son a sign and gave them a shelter on an elevated land where was a place for abiding and running water before sight.",
    "verse_51": "O Messengers, eat pure things and do good deeds. I know your deeds.",
    "verse_52": "And assuredly, this religion of yours is one religion and I am your Lord therefore fear Me.",
    "verse_53": "Then their people cut up their affairs among themselves. Each group is happy over that what is with them.",
    "verse_54": "Therefore leave you them in their intoxication for a time.",
    "verse_55": "Are they imagining that by the wealth and children with which We are helping them.",
    "verse_56": "We hasten to give them good? Nay, but they are not aware.",
    "verse_57": "Undoubtedly, those who tremble because of the fear of their Lord.",
    "verse_58": "And those who believe in the signs of their Lord.",
    "verse_59": "And those who do not make any partner to their Lord.",
    "verse_60": "And those who give what they give and their hearts are trembling because they are to return to their Lord.",
    "verse_61": "These people hasten good, and they are first to attain them.",
    "verse_62": "And We burden not any soul but according to its capacity, and with Us is a Book that speaks the truth and they shall not be wronged.",
    "verse_63": "Nay, but their hearts are heedless of it, and their deeds are separate from those works which they are doing.",
    "verse_64": "Until, when We seized their rich people in agony then they began to cry for help.",
    "verse_65": "'Cry not this day, you shall not be helped by Us'.",
    "verse_66": "Assuredly, My signs were recited to you, then you used to turn back on your heels.",
    "verse_67": "You boast on the service of the sacred place, telling absurd stories there by night leaving the truth.",
    "verse_68": "Did they not ponder over the word? Or did there come to them what had not come to their forefathers?",
    "verse_69": "Or did they not recognize their Messenger, therefore they are taking him as stranger?",
    "verse_70": "Or do they say, there is madness in him?’ Nay, but he has brought them the truth and most of them are averse from the truth.",
    "verse_71": "And if the truth had followed their desires, then, necessarily, the heavens and earth and whosoever is in them would have been ruined. Nay, but We brought them that the thing in which there was fame for them but they have turned their faces from their own prestige.",
    "verse_72": "Do you ask of them any recompense, but recompense of your Lord is the best; and He is the Best Provider?",
    "verse_73": "And undoubtedly, you call them towards the straight path.",
    "verse_74": "And undoubtedly, who do not believe in the Hereafter, necessarily they are deviated from the straight path.",
    "verse_75": "And if We had mercy on them and relieved them of the affliction that has touched them, then necessarily, they would persist in their contumacy going astray.",
    "verse_76": "And undoubtedly, We seized them in agony, but neither they did humble before their Lord and nor they entreat.",
    "verse_77": "Until when We opened on them the door of any severe torment, now then they are lying despaired therein.",
    "verse_78": "And it is He Who made for you ears and eyes and hearts. You very little own the truth.",
    "verse_79": "And it is He Who has spread you in the earth and to Him you are to be raised.",
    "verse_80": "And it is He Who gives life and causes death and for Him the alternations of night and day. Do you not then understand?",
    "verse_81": "Nay, but they said what the former used to say.",
    "verse_82": "They said, 'What! When we are dead and become dust and bones, shall we indeed be raised up again?",
    "verse_83": "'Undoubtedly, this was promised to us and before us to our forefathers. This is not but the same former fables.'",
    "verse_84": "Say you, ‘Whose is the earth and whatever is in it if you know?'",
    "verse_85": "Now they will say, 'Allah's.' Say you, 'Why you then not ponder?'",
    "verse_86": "Say you, 'Who is the Lord of the seven heavens and the Lord of Great Throne?'",
    "verse_87": "Now they will say, 'This is the Grandeur of Allah.' Say you, 'Why do not you then fear?'",
    "verse_88": "Say you, 'in whose hand is the control of everything and .He gives refuge and none can give refuge against Him, if you have knowledge?'",
    "verse_89": "Now they will say, this is Grandeur of Allah.' Say you, 'In what delusion you are lying?'",
    "verse_90": "Nay, but We have brought them the truth, and undoubtedly, they are liars.",
    "verse_91": "Allah has not taken any child for Himself, and nor is there any other God along with Him. If it were so, each God would have taken away his creation and would have necessarily wished superiority over the other. Glorified is Allah above all that which they attribute to Him.",
    "verse_92": "Knower of the hidden and the apparent, therefore He is Exalted above what they associate.",
    "verse_93": "Say you, 'O my Lord, if you would show me what they are promised.'",
    "verse_94": "'Then O my Lord; then put me not with the unjust people!'",
    "verse_95": "And undoubtedly, We are Powerful to show you that which We are promising for them.",
    "verse_96": "Repel the evil with that which is best. We know well what they attribute.",
    "verse_97": "And say you, 'O my Lord, I seek refuge in you from the evil suggestions of the devils (Saitans)!",
    "verse_98": "'And O my Lord, I seek refuge in You lest they come to me!'",
    "verse_99": "Till when death comes to anyone of them, he says, 'O my Lord! Send me back.",
    "verse_100": "'Haply, now I may earn some good in that what I have left behind!' Never, this is only a word which he utters. And in front of them is a barrier until the Day when they shall be raised.",
    "verse_101": "Then when the Trumpet shall be blown, there shall be no relationships among them, nor will they ask after one another.",
    "verse_102": "Then those whose scales are heavy, they would reach to their goals.",
    "verse_103": "And those whose scales are light, these are they who put their souls in loss; forever they will remain in the Hell.",
    "verse_104": "The flame of fire shall smite their faces and they shall glower therein.",
    "verse_105": "'Were not My signs recited to you, you then used to belie them?'",
    "verse_106": "They will say, 'O our Lord, our misfortune overcame us and we were people misguided.",
    "verse_107": "'O our Lord, take us out of the Hell, if we do the same again, we are then unjust!'",
    "verse_108": "The Lord will say, 'Remain lying despised therein and speak not to Me.'",
    "verse_109": "Undoubtedly, a group of My bond men used to say, 'O our Lord, we believed so forgive us and have mercy upon us and You are the Best of the merciful!'",
    "verse_110": "Then you made them a laughing stock, until in making them such, you forgot My remembrance and at them you used to laugh.",
    "verse_111": "Undoubtedly, this Day I recompensed them for their patience that they alone are triumphed.",
    "verse_112": "Allah said, 'How long did you stay in the earth by number of years? '",
    "verse_113": "They said, 'We stayed for a day or part of a day, therefore ask those who count.",
    "verse_114": "Allah said, 'You stayed not but little, if you would have knowledge.'",
    "verse_115": "Do you then think that We made you in vain and you are not to return to Us?",
    "verse_116": "Then Exalted High is Allah, the True King, there is no God except He; the Lord of Honored Throne.",
    "verse_117": "And whosoever worships any other god besides Allah, for which he has no proof, then his account is with his Lord. Undoubtedly, the infidels have no rescue.",
    "verse_118": "And you submit, 'O my Lord forgive and have mercy and You are the Best of the merciful!'"
     },
    "count": 118
}
