{
    "name": "al-Ahzab",
    "index": "033",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
     "verse_1": "O Prophet! The Communicator of unseen news! Continue fearing Allah and hear not the infidels and hypocrites. Undoubtedly Allah is Knowing, Wise.",
    "verse_2": "And continue following that which is being revealed to you from your Lord. (O people!) Allah is looking your doings.",
    "verse_3": "And O beloved! Rely on Allah. And Allah is Sufficient as Accomplisher of affairs.",
    "verse_4": "Allah has not put two hearts inside a man, and nor has made your those wives whom you pronounce as equal to your mothers, your real mothers and nor has made your adopted sons your real sons. This is only your saying of your own mouth. And Allah says the truth and only He shows the way.",
    "verse_5": "Call them after their fathers this is more justified in the sight of Allah, but if you do not know their fathers, then they are your brothers in faith and as human being your cousin. And there is no blame on you regarding what has been committed by you unintentionally, yes that is a sin which you may commit with the intention of your hearts. And Allah is Forgiving, Merciful.",
    "verse_6": "This Prophet is the owner of the Muslims even more than their own selves and his wives are their mothers. And blood relations are nearer to one another in the Book of Allah than other Muslims and emigrants but that you do any favor to your friends. This is inscribed in the Book.",
    "verse_7": "And O beloved! Remember when We took covenant from the Prophets and from you, and from Nuh and Ibrahim and Musa and Isa, son of Maryam and We took from them a firm covenant.",
    "verse_8": "That He may question the truthful regarding their truth, and He has already prepared painful torment for the infidels.",
    "verse_9": "O believers! Remember Allah's favor upon you, when some hosts came against you, then We sent on them strong wind and the armies which you did not see. And Allah sees your doings.",
    "verse_10": "When the infidels came upon you from above you, and from below you and when eyes drew back in amazement and your hearts reached your throats and you began to think diverse thoughts about Allah (of hopes and despairs).",
    "verse_11": "That was the place, Muslims were tested and they were shaken with severe shaking.",
    "verse_12": "And when the hypocrites and those in whose hearts there was a disease said, 'Allah and His Messenger promised us nothing but a delusion'.",
    "verse_13": "And when a party of them said, 'O people, of Madina, here there is no place for your stay, therefore walk back to your houses,' and a party of them asked permission of the Prophet, saying our houses are unsafe, and they were not unsafe. They wished not but to flee away.",
    "verse_14": "And if the armies were entered upon them from the sides of Madina, then they would have asked sedition of them, then necessarily, they would have done so and would not have been late in it but a little.",
    "verse_15": "And undoubtedly, they had already covenanted with Allah before that, that they would not turn their backs. And the covenant with Allah shall be questioned of.",
    "verse_16": "Say you, 'Flight will never profit you, if you flee from death or slaying, and even then you shall not be allowed to enjoy the world but a little'.",
    "verse_17": "Say you, ‘who is he that may evade the command of Allah from you, if He wills evil for you or desires mercy for you?' And they shall not find for themselves besides Allah any supporter nor helper.",
    "verse_18": "Undoubtedly, Allah knows those of you who hinder others from holy war and say to their brothers, come to us, and they come not to the battle but a little.",
    "verse_19": "They are niggardly in helping you, then when the time of fear comes to them, you will see them that they are looking towards you, their eyes are rolling as the death has covered anyone, then when the time of fear has passed away, they began to taunt you with sharp tongues being greedy of the booty. These people have never believed, therefore Allah has nullified their works, and this is an easy thing for Allah.",
    "verse_20": "They are thinking that the armies of the infidels have not yet gone, and if the armies come again, they would have wished then, that anyhow being out in the village would enquire about your news. And if they would have been among you, even then they would not have fought but a little.",
    "verse_21": "Undoubtedly, you have the best in the following of the Messenger, for him who hopes for Allah and the Last Day and remembers Allah much.",
    "verse_22": "And when the Muslims saw the confederates of the infidels said, 'this is what Allah and His Messenger promised us, and Allah and His Messenger spoke the truth and it increased them nothing but faith and submission to the pleasure of Allah.",
    "verse_23": "Among Muslims are men who have made true the covenant they had made with Allah, then there are some of them who have fulfilled their vows and some who are still waiting; and they are not changed in the least.",
    "verse_24": "That Allah may recompense the truthful ones for their truth and torment the hypocrites, if He will or He may turn towards them. Undoubtedly, Allah is Forgiving, Merciful.",
    "verse_25": "And Allah turned back the infidels with their hearts burning, they gained no good, and Allah sufficed the Muslims in the fight and Allah is Powerful, Honorable.",
    "verse_26": "And brought down those of the people of the Book who had helped them from their fortresses and cast terror in their hearts. You slay a group of them and another you make captive.",
    "verse_27": "And We made you to capture their lands and their houses and their wealth and a land on which you have not set foot yet, And Allah is Potent over everything.",
    "verse_28": "O the Communicator of unseen (Prophet) say to your wives, 'If you wish the life of the world and its adornment, then come, I provide you wealth and leave you in a well manner.",
    "verse_29": "And if you wish Allah and His Messenger and the home of the Hereafter, then undoubtedly Allah has kept prepared for the well doers among you a great reward.",
    "verse_30": "O wives of the Prophet! Whosoever of you dares to do against manifest modesty shall have double torment in comparison to others. And this is easy for Allah.",
    "verse_31": "And whosoever of your remains obedient to Allah and His Messenger and does good deeds, We shall double her reward in comparison to others; and We have kept prepared for her an honorable provision.",
    "verse_32": "O wives of the Prophet! You are not like other women if you fear Allah, therefore be not so polite in your speech least one in whose heart is a disease should feel tempted, yes, speak good words.",
    "verse_33": "And remain stay in your houses and be not unveiled like that of the unveiling of the former days of ignorance, and establish prayer and pay the poor-due (Zakat) and obey the commands of Allah and His Messenger. Allah only desires, O the members of the family of the Prophet! That He may remove from you every uncleanness and purify you well after cleaning you thoroughly.",
    "verse_34": "And remember what is recited in your houses of the signs of Allah and His wisdom. Undoubtedly, Allah knows every subtlety, is Aware.",
    "verse_35": "Undoubtedly, Muslim men and women, and the believing men and women, and obedient men and women, and truthful men and women, and enduring men and women, and humble men and women, and almsgiving men and women, and fasting men and women, and men and women who guard their chastity, and men and women who remember Allah much, for all of them Allah has kept prepared forgiveness and great reward.",
    "verse_36": "And it is not befitting to a Muslim man or Muslim woman, when Allah and His Messenger have decreed something that they would have any choice in their matters, and whoever disobeys Allah and His Messenger, he, undoubtedly, has strayed away manifestly.",
    "verse_37": "And O beloved! remember when you did say to him on whom Allah bestowed a favor and you had bestowed a favor, 'keep your wife with yourself and fear Allah and you had in your heart what Allah had willed to disclose and you were afraid of people's taunting remarks; and Allah has a greater right that you should fear Him. Then when Zaid had accomplished his purpose with her, We gave her in your marriage, so that there should be no hindrance upon the Muslims in respect of the wives of their adopted sons when they have accomplished their purpose with them. And Allah's order is bound to be fulfilled.",
    "verse_38": "There is no hindrance for the Prophet regarding that which Allah has appointed for him. Such has been the practice of Allah among those who have gone before and the command of Allah is the ordained destiny.",
    "verse_39": "Those who deliver the messages of Allah and fear Him and fear none except Allah. And Allah is Sufficient as a Reckoner.",
    "verse_40": "Muhammad is not the father of any of your men, yes He is the Messenger of Allah and the last one among all the Prophets. And Allah knows all things.",
    "verse_41": "O believers! Remember Allah much.",
    "verse_42": "And glorify Him morning and evening.",
    "verse_43": "It is He Who sends blessings on you and His angels too that He may bring you forth from darkness to light. And He is Merciful to the Muslims.",
    "verse_44": "For them, the greeting at the time of their meeting is \"Peace\", and He has kept prepared for them an honorable reward.",
    "verse_45": "O Prophet (the Communicator of unseen news), no doubt, We have sent you as a present beholder and bearer of glad tidings and a warner.",
    "verse_46": "And an inviter towards Allah by His command and a brightening sun.",
    "verse_47": "And give glad tidings to the believers that for them is great bounty of Allah.",
    "verse_48": "And do not do for the pleasure of infidels and hypocrites and overlook their annoyance and put your trust in Allah. And Allah suffices as an Accomplisher.",
    "verse_49": "O believers! when you marry Muslim women, then divorce them before touching them, in that case you have no period of waiting which you may count against them, so give some benefit to them and leave them in a noble manner.",
    "verse_50": "O Prophet! the Communicator of unseen news, We have made lawful for you those of your wives when you pay dower, and the possession of your slave girls whom Allah has given you as the spoils of war, and the daughters of your paternal uncles and the daughters of your maternal uncles and aunts who have migrated with you, and the believing woman if she presents herself to the Prophet and the Prophet desires to marry her, this provision is specially for you and not for the believing men. We know what We have appointed for them concerning their wives and the possession of their hands the slave girls, this specially is of yours so that there may not be any hardship on you. And Allah is Forgiving, Merciful.",
    "verse_51": "You may put behind any of them whom you like and may give place near you any of them whom you like. And if you desire to have anyone of those whom you had put aside, there is no blame on you. This is nearer than that their eyes pay be cooled and that they may not grieve and they all may be pleased with what you have given them. And Allah knows what is in the hearts of you all. And Allah is Knowing, Forbearing.",
    "verse_52": "Thereafter other women are not allowed for you and nor you take other wives in exchange of them though their beauty pleases you but slave girl the possession of your hand. And Allah is Watchful over everything.",
    "verse_53": "O believers! enter not the houses of the Prophet unless you get permission, for instance you are invited to a meal, but not in this manner that you yourselves wait for its preparation, yes when you are invited, then enter and when you have taken your meal, then disperse, nor this that you may sit down and amuse yourselves in talks. Undoubtedly, this was causing inconvenience to the Prophet, and he had regard for you, but Allah is not shy of saying the truth. And when you ask them anything of use, ask it of them from behind a curtain. In this there is more purity of your hearts and their hearts. And it does not behave you that you should annoy the Messenger of Allah and nor you should ever marry his wives after him. Undoubtedly, this is a grievous thing in the sight of Allah.",
    "verse_54": "Whether you disclose any thing or conceal it, undoubtedly, Allah knows all things.",
    "verse_55": "There is no harm for them in respect of their fathers or their sons or their brothers, or their brothers' sons, or their sisters' sons or the women of their own faith or their maids (slave women) and remain fearing Allah. Undoubtedly, everything is in the sight of Allah.",
    "verse_56": "Undoubtedly, Allah and His angels send blessings on the Prophet, the Communicator of unseen news, O you who believe! Send upon him blessings and salute him fully well in abundance.",
    "verse_57": "Undoubtedly, those who annoy Allah and His Messenger, Allah's curse is upon them in the world and in the Hereafter and Allah has kept prepared for them a degrading torment.",
    "verse_58": "And those who hurt the believing men and believing women without doing anything, they have taken over their heads a calumny and an open sin.",
    "verse_59": "O Prophet! Tell your wives, and daughters and Muslim women, that they should keep putting a part of their wrapping covers over their faces. This is nearer than this that if they are recognized, then they should not be annoyed. And Allah is Forgiving, Merciful.",
    "verse_60": "If the hypocrites and those in whose hearts there is a disease and those who circulate lies in Madina desist not, We shall surely give you authority over them; then they will not remain with you in Madina but a little.",
    "verse_61": "Accursed they are wherever they are found they shall be seized, and be slain counting one by one.",
    "verse_62": "This has been the practice of Allah regarding those who have gone before, and you shall never find a change in the practice of Allah.",
    "verse_63": "The people ask you concerning the Hour. Say you, 'its knowledge is with Allah alone, and what you know perhaps the Hour may be near.",
    "verse_64": "Undoubtedly, Allah has cursed the infidels, and has kept prepared for them a blazing fire.",
    "verse_65": "Wherein they shall abide forever, they shall find therein no supporter nor helper.",
    "verse_66": "The day when their faces turning up and down will be fried in the Fire, they will say, 'Oh, would that we have obeyed Allah and obeyed the Messenger.",
    "verse_67": "And they will say, 'O our Lord! We obeyed our chiefs and our elders, and they led us astray from the way'.",
    "verse_68": "O our Lord! Give them double torment of Fire, and curse them with a great curse.",
    "verse_69": "O believers! be not like those who have annoyed Musa, then Allah exonerated him of what they spoke of him. And Musa is honorable in the sight of Allah.",
    "verse_70": "O believers! Fear Allah and say the right word.",
    "verse_71": "He will set right your deeds for you and will forgive you your sins, and whoso obeys Allah and His Messenger has got a great success.",
    "verse_72": "Undoubtedly, We offered the Trust to the heavens and the earth and the mountains, but they refused to bear it and were afraid of it, and man bore it. Undoubtedly, he is the bearer of hardship, ignorant.",
    "verse_73": "So that Allah may torment hypocrite’s men and women and idolatrous men and women, and that Allah may accept the repentance of Muslim men and women. And Allah is Forgiving, Merciful."
  },
    "count": 73
}
