{
    "name": "asy-Syu'ara",
    "index": "026",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Taa Seen, Meem.",
        "verse_2": "These are the signs of a Bright Book.",
        "verse_3": "Haply you will lay down your life in their grief that they believed not.",
        "verse_4": "If We willed, We could send down any sign upon them from the heavens, so that their high ones would remain bowed down before it.",
        "verse_5": "And there comes not to them any new admonition from the Most Affectionate, but they turn their faces from it.",
        "verse_6": "Therefore, undoubtedly they belied, now soon there is to come to them the tidings of their mocking at.",
        "verse_7": "Have they not seen the earth, how many noble pairs We caused to grow therein.",
        "verse_8": "Undoubtedly, therein necessarily is a sign, but most of them are not to believe.",
        "verse_9": "And undoubtedly, your Lord necessarily He is Dignified, Merciful.",
        "verse_10": "And recall when your Lord called Musa (saying,) 'Go to the people unjust.",
        "verse_11": "'The people of Pharaoh (Firawn). Will they not fear?'",
        "verse_12": "He submitted, 'O my Lord, I fear that they will belie me.",
        "verse_13": "And my breast straitens and my tongue moves not fluently, therefore make Haroon too a Messenger.",
        "verse_14": "'And they have a charge against me, so that I fear that they may kill me.'",
        "verse_15": "Allah said, 'Not so; go both of you with Our signs, We hear with you.",
        "verse_16": "'Therefore go to Pharaoh (Firawn), then say to him, \"Both of us are the Messengers of Him Who is the Lord of the worlds.",
        "verse_17": "\"That send you the children of Israel with us.\"",
        "verse_18": "Firawn said, ‘Did we not bring you up among us in your childhood, and you did pass among us many years of your life?",
        "verse_19": "'And you did your deed you did and you were ungrateful.'",
        "verse_20": "Musa said, ‘I did do it when I was unaware of the path.",
        "verse_21": "Therefore I went away from you when I was afraid of you, then my Lord bestowed wisdom on me and made me one of the Messengers.",
        "verse_22": "'And this is any grace of which you speak to me that you have enslaved the children of Israel.'",
        "verse_23": "Firawn (Pharaoh) said, 'And what is the Lord of the Worlds?'",
        "verse_24": "Musa said, 'The Lord of the heavens and the earth and of all that is between them if you would believe.'",
        "verse_25": "Firawn (the Pharaoh) said to those around him, 'Do you not hear carefully?'",
        "verse_26": "Musa told, ‘Your Lord and the Lord of your former fathers.'",
        "verse_27": "Firawn said, 'Your this Messenger who has been sent to you has necessarily no wisdom.'",
        "verse_28": "Musa said, 'The Lord of east and west and whatever is between them if you have wisdom.'",
        "verse_29": "Firawn said, 'If you will take a god other than me, then I will certainly imprison you.'",
        "verse_30": "Musa said, 'what, even though I bring you something bright?'",
        "verse_31": "Firawn said, 'Bring it then, if you are truthful?'",
        "verse_32": "Therefore Musa threw down his staff, hence it became a serpent manifest.",
        "verse_33": "And he drew forth his hand, henceforth it was shining light to the beholders.",
        "verse_34": "Firawn said to the chiefs around him, 'Undoubtedly, he is a magician learned.",
        "verse_35": "'He desires to expel you from your land by the power of his magic, then what do you advice?'",
        "verse_36": "They said, ‘Make him and his brother stay and send collectors in the cities.",
        "verse_37": "'That they may bring you every big magician learned.'",
        "verse_38": "So the magicians were assembled together at a fixed time on an appointed day.",
        "verse_39": "And it was said to the people, 'Will you assemble?",
        "verse_40": "'Haply, we may follow these magicians if they overcome.'",
        "verse_41": "Then when the magicians came, they said to Firawn, 'Will we get some wage if we overcome?'",
        "verse_42": "Firawn said, 'Yes, and at that time you will be our near ones.'",
        "verse_43": "Musa said to them, 'Cast you down what you have to cast.'",
        "verse_44": "Therefore they cast down their ropes and staffs and said, 'By Firawn's honor, undoubtedly we are the winners.'",
        "verse_45": "Then Musa cast his staff, henceforth it began to swallow their fabrications.",
        "verse_46": "Now they fell down prostrated.",
        "verse_47": "The magicians said, 'We believed in the Lord of the worlds.",
        "verse_48": "'Who is the Lord of Musa and Haroon.'",
        "verse_49": "Firawn said, 'Have you believed in him before I give you leave? Undoubtedly, he is your big one who taught you magic; now you are to know, I swear, undoubtedly I shall cut off your hands and your feet on alternate sides, and shall crucify you all.'",
        "verse_50": "They said, 'There is no harm; we are to return to our Lord.",
        "verse_51": "'We are greedy that our Lord may forgive our sins, since we have believed first.'",
        "verse_52": "And we revealed to Musa, 'Travel by night with My bondmen, undoubtedly, you are to be followed.'",
        "verse_53": "Now Firawn sent collectors in the cities.",
        "verse_54": "'That these are a small party.",
        "verse_55": "'And indeed they are enraging us.'",
        "verse_56": "'And undoubtedly, we are all vigilant.'",
        "verse_57": "Therefore We turned them out from gardens and springs.",
        "verse_58": "And treasurer and fine abodes.",
        "verse_59": "We did thus and made their heirs to the children of Israel.",
        "verse_60": "Then the people of Firawn followed them at the sunrise.",
        "verse_61": "Then when the two groups saw each other, the people of Musa said, 'They have overtaken us.'",
        "verse_62": "Musa said, 'Not so, undoubtedly my Lord is with me, He guides me just now.'",
        "verse_63": "Then We revealed to Musa 'strike the sea with your staff hence the sea was parted, and every part was like a big mountain.",
        "verse_64": "And We brought others nearer to that place.",
        "verse_65": "And We saved Musa and all those with him.",
        "verse_66": "Then We drowned the others.",
        "verse_67": "Undoubtedly in it necessarily is a sign. And most of them were not Muslims.",
        "verse_68": "And undoubtedly your Lord, He is the Mighty, Merciful.",
        "verse_69": "And recite to them the news of Ibrahim.",
        "verse_70": "When he said to his father and his people, 'What do you worship?'",
        "verse_71": "They said, 'We worship idols, then we remain sitting devoted before them.'",
        "verse_72": "He said, 'Do they hear you when you call?",
        "verse_73": "'Or do you any good or harm you?'",
        "verse_74": "They said, ‘Nay we found our fathers doing so.'",
        "verse_75": "He said, 'Do you then see what you worship?",
        "verse_76": "'You and your forefathers.",
        "verse_77": "'Undoubtedly they are all enemies to me but the Lord of the worlds.",
        "verse_78": "'He Who created me, therefore He will guide me.",
        "verse_79": "'And He Who feeds me and gives me to drink.",
        "verse_80": "'And when I am ill, it is He Who heals me.",
        "verse_81": "'And He who will cause me to die, then will make me alive.",
        "verse_82": "'And He for Whom I long will forgive my sins on the Day of Requital.",
        "verse_83": "'O my Lord! Bestow wisdom on me and join me with those who are able of your proximity!",
        "verse_84": "'And give me a true reputation among the later generations!",
        "verse_85": "'And make me among those who are the heirs of gardens of comfort!",
        "verse_86": "'And forgive my father, undoubtedly he has gone astray!",
        "verse_87": "'And disgrace me not on the day when all shall be raised.",
        "verse_88": "The day when neither wealth nor sons shall avail.",
        "verse_89": "But he who comes before Allah with a sound heart.",
        "verse_90": "And the Heaven shall be brought near to the dutiful.",
        "verse_91": "And the Hell shall be made apparent to those who have gone astray.",
        "verse_92": "And it will be said to them. 'Where are those whom you used to worship?",
        "verse_93": "'Besides Allah? Will they help you or will retrieve themselves?'",
        "verse_94": "Then they were thrown in the Hell, they and those who have gone astray.",
        "verse_95": "And the army of the devil all together.",
        "verse_96": "They shall say while they will be disputing therein among themselves:",
        "verse_97": "'By God, undoubtedly, we were in manifest error.",
        "verse_98": "'When we made you equal with the Lord of the worlds.",
        "verse_99": "'And none led us astray but the culprits.",
        "verse_100": "'Then we have no intercessor now.",
        "verse_101": "'Nor any sympathizing friend.",
        "verse_102": "'Then anyhow we might return again so that we would have been Muslims.",
        "verse_103": "Undoubtedly in it necessarily there is a sign, but most of them were not believers.",
        "verse_104": "And undoubtedly, your Lord: He is the Mighty, the Merciful.",
        "verse_105": "The people of Nuh belied the Messengers.",
        "verse_106": "When their compatriot Nuh said to them, 'Do you not fear?",
        "verse_107": "'Undoubtedly, I am a Messenger trusted for you.",
        "verse_108": "'Therefore, fear Allah and obey me.",
        "verse_109": "'And I ask of you no wage for this, my wage is only upon Him Who is the Lord of the worlds.",
        "verse_110": "'Therefore fear Allah and obey me.'",
        "verse_111": "They said, 'shall we believe you while the mean persons have followed you.'",
        "verse_112": "He said, 'What knowledge have I of what are their deeds?",
        "verse_113": "'Their account is only upon my Lord, if you have sense.",
        "verse_114": "'And I am not to drive away the Muslims.",
        "verse_115": "'I am not but a plain warner.'",
        "verse_116": "They said, 'O Nuh! If you do not desist, then, necessarily, you will be stoned.'",
        "verse_117": "He said, 'O my Lord, my people have belied me.",
        "verse_118": "'Therefore decide completely between me and them and relieve me and those of Muslims with me!'",
        "verse_119": "Then We saved him and those with him in a laden ark.",
        "verse_120": "Then afterwards We drowned the rest.",
        "verse_121": "No doubt, in it there is necessarily a sign, and most of them were not Muslims.",
        "verse_122": "And undoubtedly, your Lord only, He is the Mighty, the Merciful.",
        "verse_123": "Aad belied the Messengers.",
        "verse_124": "When their compatriot Hud said to them, 'Do you not fear?",
        "verse_125": "'Undoubtedly, I am a trusted Messenger of Allah for you.",
        "verse_126": "'Therefore fear Allah and obey me.",
        "verse_127": "'And I ask you no wage for it. My wage is only upon Him Who is the Lord of the worlds.",
        "verse_128": "'Do you build a sign on every height to laugh at the wayfarers?",
        "verse_129": "'And you erect strong palaces that perhaps you will live forever.",
        "verse_130": "'And when you lay hands on anyone you lay hands tyrannically.",
        "verse_131": "'Therefore fear Allah and obey me.",
        "verse_132": "'And fear Him Who helped you with those things which are known to you.",
        "verse_133": "'He helped you with cattle and sons.",
        "verse_134": "'And gardens and springs.",
        "verse_135": "'Undoubtedly, I am afraid of coming on you the torment of a Great Day.'",
        "verse_136": "They said, 'It is equal to us whether you admonish us or be not of the admonishers.",
        "verse_137": "'This is not but the same habits of the ancients.",
        "verse_138": "'And we are not to be tormented.'",
        "verse_139": "Then they belied him, therefore We destroyed them. Undoubtedly in it there is necessarily a sign; but most of them were not Muslims.",
        "verse_140": "And undoubtedly, your Lord 'He is the Mighty, the Merciful.",
        "verse_141": "Thamud belied the Messengers.",
        "verse_142": "When their compatriot Saalih said to them, 'Do you not fear?",
        "verse_143": "'Undoubtedly, I am a trusted Messenger of Allah for you.",
        "verse_144": "'Therefore fear Allah and obey me.",
        "verse_145": "'And I ask you no wage for it; my wage is only upon Him Who is the Lord of the worlds.",
        "verse_146": "'Will you be left secure amid the good things of here?",
        "verse_147": "'In gardens and springs.",
        "verse_148": "'And cornfields and palm trees whose blossoms are soft tender.",
        "verse_149": "'And hew out houses in the mountains skillfully.",
        "verse_150": "'Therefore fear Allah and obey me.",
        "verse_151": "'And follow not the bidding of those who exceed the limits.",
        "verse_152": "'Who spread disorder in the earth and reform not.'",
        "verse_153": "They said, 'You have indeed been bewitched.",
        "verse_154": "'You are indeed a man like us, therefore bring any sign, if you are truthful.'",
        "verse_155": "He said, 'This is a she-camel, a day of drinking is for her and a fixed day of drinking is for you.",
        "verse_156": "'And touch her not with evil, lest the torment of a great day will overtake you.'",
        "verse_157": "But they hamstrung her, then they remained repenting in the morning.",
        "verse_158": "Therefore the torment overtook them.Undoubtedly.in it there is necessarily a sign, and most of them were not Muslims.",
        "verse_159": "And undoubtedly, your Lord He is the Mighty, the Merciful.",
        "verse_160": "The people of Lut belied the Messengers.",
        "verse_161": "When their compatriot Lut said to them, 'Do you not fear?'",
        "verse_162": "'Undoubtedly, I am a trusted Messenger of Allah for you.",
        "verse_163": "'Therefore fear Allah and obey me.",
        "verse_164": "'And I ask you no wage for it; my wage is only upon Him Who is the Lord of the worlds.",
        "verse_165": "'Do you commit unnatural offence with males from among the creatures?",
        "verse_166": "'And leave your wives whom your Lord has created for you? Nay, but you are a people exceeding the limit.'",
        "verse_167": "They said, 'O Lut, if you desist not, then you shall necessarily be expelled out.'",
        "verse_168": "He said, 'I am disgusted of your doings.",
        "verse_169": "'O my Lord! Save me and my family from their doings!'",
        "verse_170": "Therefore We delivered him and all his family member.",
        "verse_171": "But an old woman who stayed behind.",
        "verse_172": "Then We destroyed the others.",
        "verse_173": "And We rained upon them a rain, therefore what an evil rain it was for those who were warned!",
        "verse_174": "Undoubtedly, in it necessarily, there is a sign. But most of them were not Muslims.",
        "verse_175": "And undoubtedly, your Lord — He is the Mighty, the Merciful.",
        "verse_176": "The people of the forest belied the Messengers.",
        "verse_177": "When Shoaib said to them, 'Do you not fear?",
        "verse_178": "'Undoubtedly, I am a trusted Messenger of Allah for you.",
        "verse_179": "'Therefore fear Allah and obey me.",
        "verse_180": "'And I ask you no wage for it; my wage is only upon Him Who is Lord of the worlds.",
        "verse_181": "'Fulfill the measure and be not of those who give less.",
        "verse_182": "'And weigh with a straight balance.",
        "verse_183": "'And give not the things of the people decreasing, and wander not in the earth spreading mischief.",
        "verse_184": "'And fear Him Who created you and the earlier people.'",
        "verse_185": "They said, 'You are being bewitched.",
        "verse_186": "'You are not but a man like us; and undoubtedly, we consider you a liar.",
        "verse_187": "'Therefore cause to fall upon us a fragment of the sky, if you are truthful.'",
        "verse_188": "He said, 'My Lord knows well what your doings are.'",
        "verse_189": "Then they belied him, therefore, the torment of the day of shadow overtook them. Undoubtedly, it was a torment of a great day.",
        "verse_190": "Undoubtedly, in it, there is necessarily a sign, and most of them were not Muslims.",
        "verse_191": "And undoubtedly, your Lord — He is the Mighty, the Merciful.",
        "verse_192": "And undoubtedly, this Quran has been sent down by the Lord of the worlds.",
        "verse_193": "The Trusted spirit has descended with it.",
        "verse_194": "On your heart that you may warn.",
        "verse_195": "In bright Arabic language.",
        "verse_196": "And undoubtedly, its discussion is on the former Books.",
        "verse_197": "And was it not a sign for them, that the learned ones of the children of Israel know this Prophet?",
        "verse_198": "And if We had sent it down to any of the non-Arabs.",
        "verse_199": "And he had recited it to them, even then they would not have believed.",
        "verse_200": "Thus We have caused it to enter into the hearts of the culprits.",
        "verse_201": "They will not believe in it until they see the painful torment.",
        "verse_202": "Then it will come to them all of a sudden and they will not know.",
        "verse_203": "Then they will say, 'Shall we be respited?'",
        "verse_204": "Do they then wish to hasten Our torment?",
        "verse_205": "Well see then, if We allow them to carry on for some years.",
        "verse_206": "Then there comes to them that with\" which they are promised.",
        "verse_207": "What they will gain only that they enjoyed.",
        "verse_208": "And We destroyed not any town but it had its warners.",
        "verse_209": "For admonition and We oppress not.",
        "verse_210": "And this Quran has not been brought down by the devils (Satan).",
        "verse_211": "And they are not worthy of it, and nor they can do so.",
        "verse_212": "They have been indeed removed very far from the place of hearing.",
        "verse_213": "Therefore worship you not another God besides Allah lest you should be tormented.",
        "verse_214": "And O beloved, warn your nearest kinsmen.",
        "verse_215": "And spread your wing of mercy for your follower Muslims.",
        "verse_216": "Then if they disobey you say then, 'I am quit of what you do.'",
        "verse_217": "And rely upon Him Who is the Mighty, the Merciful.",
        "verse_218": "Who sees you when you stand?",
        "verse_219": "And your movements among those who offer prayer.",
        "verse_220": "Undoubtedly, He is the Hearer, the Knower.",
        "verse_221": "Should I tell you on whom the devils (Satans) descend?",
        "verse_222": "They descend upon every big slanderer and sinner.",
        "verse_223": "The devils cast upon them their own hearings and most of them are liars.",
        "verse_224": "And the misguided ones follow the poets.",
        "verse_225": "Have you not seen that they wander about in every valley?",
        "verse_226": "And they say what they do not act.",
        "verse_227": "But those who believed and did good deeds and remembered Allah much and took revenge after they were oppressed. And now the unjust will soon know as to which side they shall return."
      },
    "count": 227
}
