{
    "name": "at-Takwir",
    "index": "081",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "When the sunshine is folded up.",
        "verse_2": "And when the stars fall off.",
        "verse_3": "And when the mountains are made to move.",
        "verse_4": "And when the pregnant she camels are abandoned.",
        "verse_5": "And when the beasts are gathered together.",
        "verse_6": "And when the seas are kindled,",
        "verse_7": "And when the souls are paired.",
        "verse_8": "And when the female buried alive is questioned about.",
        "verse_9": "For what crime was she killed?",
        "verse_10": "And when the sheets of actions are opened,",
        "verse_11": "And when the heaven is taken off from its place,",
        "verse_12": "And when the Hell is caused to flare up.",
        "verse_13": "And when the Paradise is brought near,",
        "verse_14": "(Then) each soul shall know what it has brought forward.",
        "verse_15": "Then I swear by those that recede.",
        "verse_16": "Walk straight and then stop.",
        "verse_17": "And by the night when it departs.",
        "verse_18": "And by the morning when it breathes.",
        "verse_19": "Undoubtedly, this is the recitation of a noble Messenger.",
        "verse_20": "Who is powerful, dignified in the presence of the Lord of the Throne.",
        "verse_21": "There He is obeyed, He is trustworthy.",
        "verse_22": "And your companion is not mad.",
        "verse_23": "And undoubtedly, he saw him on the bright horizon.",
        "verse_24": "And he is not niggardly as to the disclosing of unseen.",
        "verse_25": "And the Quran is not the recitation of saitan (Devil) the accursed.",
        "verse_26": "Whither, then, are you going?",
        "verse_27": "This is not but an admonition to the entire world.",
        "verse_28": "For him among you who desire to be straight.",
        "verse_29": "And what you desire, but only this that Allah the Lord of the world desires."
    },
    "count": 29
}
