{
    "name": "al-Ahqaf",
    "index": "046",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Ha-Mim",
    "verse_2": "This Book is the sending down from Allah, the Dignified, the Wise.",
    "verse_3": "We made not the heavens and the earth and what is in between them but with truth and for a term appointed. And the infidels turn away from that they were warned of.",
    "verse_4": "Say you, 'well, tell you, what you worship besides Allah - show me, what particle of the earth they have made, or they have any share in the heavens\"? Bring me a, Book before this or anything left over of knowledge, if you are truthful.",
    "verse_5": "And who is more misguided than he who worships besides Allah such ones who may not hear his call till the Day of Resurrection and even they are unaware of their worship.",
    "verse_6": "And when mankind shall be gathered, they shall be enemies to them and will deny their worship.",
    "verse_7": "And when Our bright signs are recited to them, the infidels say concerning the truth having come to them, 'this is a magic manifest'",
    "verse_8": "Do they say, 'he has fabricated it'? Say you, 'if I have fabricated it, you have no power for me against Allah. He knows well in what uttering you are busy. And He is Sufficient as Witness between me and you, and He is Forgiving, Merciful.",
    "verse_9": "Say you, I am not a novel Messenger and I know not, what shall be done with me and with you. I only follow what is revealed to me. And I am not but a plain warner.",
    "verse_10": "Say you, 'see to it, if that Quran is from Allah and you have disbelieved in it, while a witness from the children of Israel has already bore witness to it and he has believed, while you waxed proud'. Undoubtedly Allah guides not he unjust people.",
    "verse_11": "And the infidels said about Muslims, 'If there had been some good in it, they could not have reached to it ahead of us. And since they have not been guided there by, now, therefore, they will say, \"this is an old calumny.",
    "verse_12": "And before it there is the Book of Musa, a guide and mercy; and this is a book confirming in Arabic language that it may warn the unjust and good tidings to the righteous.",
    "verse_13": "Undoubtedly those who said, 'Our Lord is Allah, and then remained steadfast, there shall be no fear upon them nor shall they grieve.",
    "verse_14": "They are the people of Paradise, they shall abide therein a reward of their doings.",
    "verse_15": "And We commanded man to do good to his parents. His mother bore him with pain, and gave birth to him with pain, And his bearing and weaning are in thirty months, till when he reached to his strength and attained the age of forty years, he submitted, 'O my Lord, put in my heart that I may be thankful for Your blessing which You bestowed upon me and upon my parents, and that I may do such works which may please You, and make my offspring righteous for me. I turned towards you, and I am a Muslim.'",
    "verse_16": "These are they whose good works We shall accept and will overlook their evil deeds. They are among the in habitants of Paradise the true promise which was made to them.",
    "verse_17": "And he who said to his parents, 'Fie, I am fed up with you both, do you promise me that I shall be brought forth again, whilst generations have already passed before me? And they both cry unto Allah for help, Woe to you; believe you, verily the promise of Allah is true. Then he says, 'This is not but the tales of the ancients.'",
    "verse_18": "These are they against whom the sentence has already been proven amongst the people of jinn and mankind that had gone before them. Undoubtedly, they were the losers.",
    "verse_19": "And for everyone there is degree according to their own actions, and that Allah may pay them in full for their works, and they shall not be wronged.",
    "verse_20": "And the day the unbelievers shall be presented to the fire, it shall be said to them, 'you have already exhausted your pure things in your worldly life and have enjoyed them, therefore today you shall be recompensed with the degrading torment, a punishment for that you used to wax proud in the earth without right and a punishment of that you used to disobey.",
    "verse_21": "And remember the compatriot of Aad, when he warned them in the land of Ahquaf (winding sand tracts); and undoubtedly, the warners have already passed away before him and have come after him (saving) 'worship none save Allah. Undoubtedly, I fear for you the torment of a great day.'",
    "verse_22": "They said, 'Have you come for this that you may turn us away from our gods'? Bring us then that which your promise us, if you are truthful.'",
    "verse_23": "He said, 'The news thereof is only with Allah, and I only deliver to you the message of my Lord, yes, in my opinion you are totally ignorant people.'",
    "verse_24": "Then, when they saw the torment like clouds spread in the sides of the sky coming towards their Valleys, Said this is a cloud which will rain over us. Not so, rather it is that which you sought to hasten a wind storm wherein is a painful torment.",
    "verse_25": "It destroys everything by the command of its Lord. So in the morning they remained as they were not seen but their deserted dwellings. Thus We punish the culprits.",
    "verse_26": "And undoubtedly, we had given them the control that we gave not to you; and made for them ears and eyes and hearts. But their ears and eyes and hearts availed them nothing, since they used to deny the signs of Allah and they were encompassed by the torment that they used to mock at.",
    "verse_27": "And undoubtedly, We destroyed the cities round about you and brought varying signs so that they may desist.",
    "verse_28": "Why, then did not those help them whom they has taken for gods besides Allah for attaining His nearness? Bay, rather they were lost from them, and thus is their calumny and fabrication.",
    "verse_29": "And when We turned to you a number of jinn, giving ear to the Quran and when they were present there said among themselves 'be silent' then when the recitation ended, they went back to their people warning.",
    "verse_30": "They said, 'O our people! We have heard a Book that was sent down after Musa, confirming the former Books and guiding towards the truth and to the straight path.",
    "verse_31": "'O Our people! Respond to the caller of Allah and believe in Him that He may forgive some of your sins and save you from the painful torment.",
    "verse_32": "'And whoso responds no to the caller of Allah, he cannot go out of control in the earth and he has no helper against Allah. They are in manifest error.",
    "verse_33": "Have they not known that Allah, Who made the heavens and the earth and was not wearied in making them, has the power to give life to the dead? Why not, undoubtedly He can do everything.",
    "verse_34": "And the day when to infidels shall be presented before the Fire it will be said to them, 'Is not this the truth'? They will say, 'why not, by our Lord'. It will be said to them, ' taste then the torment, the recompense of your infidelity'.",
    "verse_35": "Have you patience then, as had the resolute Messengers; and be in no haste about them, as on the day when they will see that they are promised with, (it will seem to them) they had not tarried in the world but for an hour of a single day. This is to deliver. Then who shall be destroyed but the people disobedient."
  },
    "count": 35
}
