{
    "name": "al-Muzzammil",
    "index": "073",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O the enwrapped one!",
        "verse_2": "Stand praying at night except a small portion thereof.",
        "verse_3": "Half night or make it a little less than that.",
        "verse_4": "Or make it a little more than that - and recite Quran slowly and thoughtfully.",
        "verse_5": "Undoubtedly, soon We shall be casting on you a weightly word.",
        "verse_6": "Undoubtedly, getting up at night is most pressing and the word is pronounced most rightly.",
        "verse_7": "Undoubtedly, you have a chain of engagements during the day.",
        "verse_8": "Therefore remember the name of your Lord, and be of Him exclusively leaving all others.",
        "verse_9": "He is the Lord of the east and west, there is no God but He, so take Him as Disposer of affairs.",
        "verse_10": "And be patient over what the infidels say and leave them decently.",
        "verse_11": "And leave to Me those beliers the rich ones and give them a little time.",
        "verse_12": "Undoubtedly, We have heavy fetters and raging fire.",
        "verse_13": "And a choking food and a painful torment.",
        "verse_14": "On a day when the earth and the mountains shall quake, and the mountains will become heaps of sand flowing.",
        "verse_15": "Undoubtedly, We sent towards you a Messenger who is a witness over you, as We sent to Firawn a Messenger.",
        "verse_16": "But Firawn disobeyed the Messenger, then We seized him with a severe seizing.",
        "verse_17": "Then how you will save yourselves if you disbelieve against a day which will make children old.",
        "verse_18": "The sky will be split on account of its grief. The promise of Allah shall be fulfilled.",
        "verse_19": "Undoubtedly, this is an admonition, therefore, let him who please take a way unto his Lord.",
        "verse_20": "Undoubtedly, your Lord knows that you stand up for prayer sometime for nearby two third of the night, sometime half of the night, sometime a third of the night, and also a party of those who are with you. And Allah estimates the night and the day. He knows that you Muslims cannot count the night, then He turned towards you with His mercy, now recite from Quran as much as is easy for you He knows that soon some of you will fall ill and some others will travel in the earth seeking the bounty of Allah and some others will be fighting in the way of Allah, so recite Quran what you can, and continue keeping prayer and pay the poordue (Zakat) and give a goodly loan to Allah. And whatever good you will send forward for you, you will find it with Allah as better and greater reward. And beg forgiveness from Allah. Undoubtedly, Allah is Forgiving, Merciful."
     },
    "count": 20
}
