{
    "name": "ash-Shaff",
    "index": "061",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Whatever is in the heavens and whatever is in the earth glorifies Allah; and He is the Esteemed One, the Wise.",
        "verse_2": "O believers! Why do you say what you do not do?",
        "verse_3": "Most hateful is it to Allah that you say what you do not do.",
        "verse_4": "Undoubtedly, Allah loves those who fight in His way arrayed in ranks, as though they were a building cemented with molten lead.",
        "verse_5": "And remember when Musa said to his people, 'O My propel why do you annoy me, though you know that I am the Messenger of Allah to you' But when they swerved, Allah caused their hearts to swerve; and Allah guides not the disobedient people.",
        "verse_6": "And remember when Issa son of Maryam, said, 'O children of Israel, I am Allah's Messenger to you, confirming the previous Book Tourat before me and conveying the glad news of the Messenger who will come after me, his name is Ahmad!' But when Ahmed came to them with bright signs, they said, 'this is an open magic.'",
        "verse_7": "And who is more unjust than he who forges a lie against Allah despite the fact that he is being called towards Islam? And Allah guides not the unjust people.",
        "verse_8": "They desire to extinguish the light of Allah with their mouths and Allah is to accomplish His light, even though the infidels may take it bad.",
        "verse_9": "It is He Who has sent His Messenger with the guidance and the Religion of Truth that he may cause it to prevail over all religions, though the associates may take it bad.",
        "verse_10": "O believers! Shall I tell you the trade which may save you from painful torment?",
        "verse_11": "Believe you in Allah and His Messenger and struggle in the way of Allah with your wealth and persons. This is better for you, if you know.",
        "verse_12": "He will forgive your sins and will make you enter the Gardens beneath which flow streams and palaces of purity that are in the gardens of dwelling. This is the great triumph.",
        "verse_13": "And He will bestow you one more favor which you love, help from Allah and a near victory, so O beloved give glad tidings to the Muslims.",
        "verse_14": "O believers! Be helpers of the religion of Allah as Isa son of Maryam had said to his disciples, 'who are those who may help me being towards Allah? The disciples said, 'we are the helpers of the religion of Allah', then a party of the children of Israel believed and another party disbelieved. Then We helped the believers against their enemies, so they overcame."
  },
    "count": 14
}
