{
    "name": "al-Hijr",
    "index": "015",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif-Lam-Raa. These are the verses of a Book and of a Bright Quran.",
        "verse_2": "The infidels would desire ardently that they had been Muslims.",
        "verse_3": "Leave them to eat and enjoy and let the hope amuse them, now then they are about to know.",
        "verse_4": "And the town We destroyed had a writing known.",
        "verse_5": "No community can precede its promised time nor it can fall behind.",
        "verse_6": "And they said 'O you upon whom Quran has been sent down, you are certainly a madman.",
        "verse_7": "'Why don't you bring angels to us, if you are truthful?'",
        "verse_8": "We do not send down the angels without any purpose and if they come down, they would not get a time.",
        "verse_9": "No doubt, We have sent down this Quran, and We must surely are its Guardian.",
        "verse_10": "And assuredly We sent Messengers before you amongst earlier peoples.",
        "verse_11": "And not any Messenger came to them, but they mocked at him.",
        "verse_12": "In the same way, We make a way for this mockery in the hearts of the culprits.",
        "verse_13": "They believe not therein, and already the example of the ancients has gone forth.",
        "verse_14": "And if We open any door for them in the heaven that they may ascend through it in the day.",
        "verse_15": "Even then they would say, 'Our sights have been tied, rather we have been mesmerized.'",
        "verse_16": "And We have indeed made constellations in the heaven and have adorned it for the beholders.",
        "verse_17": "And We have guarded it from every accursed Satan.",
        "verse_18": "But whoever goes to hear stealthily, then he is pursued by a bright flame.",
        "verse_19": "And We have stretched the earth and put therein anchors, and caused to grow therein everything proportionately.",
        "verse_20": "And We have provided for you therein means of livelihood and also those you provide not for.",
        "verse_21": "And there is nothing of which there are not treasure with Us. And We do not send it down but with a known measure.",
        "verse_22": "And We have sent winds fecundating the clouds, then We sent down water from the heaven, then We gave it to you to drink, and you are not its treasurers.",
        "verse_23": "And verily it is We Who give life and We Who cause death and We Who are Inheritor.",
        "verse_24": "And We do know those who went ahead among you and We do know those who remained behind among you.",
        "verse_25": "And verily your Lord alone will raise them on the Day of Judgement. No doubt, He is the Wise, the Knowing.",
        "verse_26": "And verily We have made man from ringing clay which was in reality black smelling mud.",
        "verse_27": "And We have made Jinn before it from the smokeless fire.",
        "verse_28": "And recall when your Lord said to the angels, \"I am about to create human being from the ringing clay which is of the black smelling mud.\"",
        "verse_29": "Then when I had formed him and have breathed into him of My special esteemed spirit, then fall down for him prostrate.'",
        "verse_30": "Then all the angels fell down prostrate together.",
        "verse_31": "Save Iblis. He refused to be with the prostrate.",
        "verse_32": "Allah said, 'O Iblis, what happened to you that you did remain aloof from the prostrate.'",
        "verse_33": "He said, 'It is not befitting me that I should prostrate myself before a human being whom You have made from the ringing clay which was of the black smelling mud.'",
        "verse_34": "Allah said, 'Get out from the paradise, for you are rejected.",
        "verse_35": "'And verily there is curse upon you till the Day of Judgement.'",
        "verse_36": "He said, 'O my Lord, give me time till the Day when they are raised.'",
        "verse_37": "Allah said, 'You are among those who are given time.",
        "verse_38": "'Till the Day of the known time.'",
        "verse_39": "He said, 'O my Lord, I swear of that You led me astray, I will deceive them in the earth, and certainly I will mislead all of them.",
        "verse_40": "'But those of them who are Your selected bondmen.'",
        "verse_41": "Allah said, 'This path leads to Me straight.",
        "verse_42": "'Verily, over My bondmen you have no control, save those misguided ones who follow you.'",
        "verse_43": "And verily, Hell is the promised place of them all.",
        "verse_44": "It has seven entrances. For each entrance there is an appointed portion of them.",
        "verse_45": "No doubt, the God-fearing are in the gardens and fountains.",
        "verse_46": "Enter them with peace, in security.",
        "verse_47": "And We took out whatever rancor’s were there in their breasts; they are brothers among each other, sitting upon couches facing each other.",
        "verse_48": "Neither any fatigue touches them, nor shall they be driven out therefrom.",
        "verse_49": "Inform My bondmen that undoubtedly, I am the alone Forgiving, the Merciful.",
        "verse_50": "And that the torment of Mine is the torment painful.",
        "verse_51": "And tell them about Ibrahim's guests.",
        "verse_52": "When they came to him, then they said, 'peace.' He said, 'We feel afraid of you.'",
        "verse_53": "They said, 'do not fear: we give you glad tidings of a son possessing knowledge.'",
        "verse_54": "He said, 'Do you give me glad tidings in spite of the fact that old age has touched me; of what then you give me the glad tidings?'",
        "verse_55": "They said, 'We have given you the glad tidings with truth; be not disappointed.'",
        "verse_56": "He said, 'Who is disappointed of the Mercy of his Lord but those who have gone astray.'",
        "verse_57": "He said 'What now is your business, O angels?'",
        "verse_58": "They said, 'We have been sent towards a guilty people.",
        "verse_59": "'But the family of Lut, We shall save the all.",
        "verse_60": "'But his wife, We have decided that she will be among those who remain behind.'",
        "verse_61": "Then when the angels came to the household of Lut.",
        "verse_62": "He said, 'Verily, you are a people stranger.'",
        "verse_63": "They said, 'Nay, we have brought you that in which they were doubting.",
        "verse_64": "'And We have brought you the true Command and we are surely truthful.",
        "verse_65": "'Therefore go away with your family whilst a portion of night is left and you yourself follow them, and let no one of you look back and go straight whither you are commanded.'",
        "verse_66": "And We made him known the decision of the Commandment that the root of those infidels shall be cut off by morning.",
        "verse_67": "And the residents of the city came rejoicing.",
        "verse_68": "Lut said, 'These are my guests, therefore disgrace me not.",
        "verse_69": "'And fear Allah and defame me not.'",
        "verse_70": "They said, 'Had we not forbidden you against the interference in the matter of others.'",
        "verse_71": "He said, 'These women of my people are my daughters if you are to do.'",
        "verse_72": "O beloved! By your life, verily they are wandering about in their intoxication.",
        "verse_73": "Then a roaring cry overtook them at sunrise.",
        "verse_74": "Then We made the upper side of that town lower side and rained upon them stones of baked clay.",
        "verse_75": "No doubt, in that are signs for men of sagacity.",
        "verse_76": "And obviously that town is on the road that still exists.",
        "verse_77": "No doubt, in that are signs for the believers.",
        "verse_78": "And no doubt, the dwellers of the thicket were assuredly unjust.",
        "verse_79": "Then We took vengeance on them; and no doubt, both these towns lie on a manifest way.",
        "verse_80": "And no doubt, the people of Hijr belied the Messengers.",
        "verse_81": "And We gave them Our signs, but they kept their faces away from them.",
        "verse_82": "And they used to hew out houses in the mountains without fear.",
        "verse_83": "Then the roaring voice overtook them in the morning.",
        "verse_84": "Therefore their earning did not avail them.",
        "verse_85": "And We created not the heavens and earth and whatever is between them without any purpose. And no doubt, the Hour is to come therefore pardon graciously.",
        "verse_86": "Certainly, your Lord is alone the great Creator, the Knowing.",
        "verse_87": "And no doubt, We gave you seven verses which are repeated, and the Grand Quran.",
        "verse_88": "See not stretching your eyes the thing, We gave to their some pairs to enjoy and grieve not over them, and took the Muslims in your wings of mercy.",
        "verse_89": "And say: 'I am alone the plain warner.' (From the torment).",
        "verse_90": "As We have sent down on the dividers.",
        "verse_91": "Who tore the Quran into pieces?",
        "verse_92": "Then by your Lord, We shall certainly question them all.",
        "verse_93": "What they used to do.",
        "verse_94": "Therefore say them openly what you have been commanded, and turn away your face from the polytheists.",
        "verse_95": "No doubt, We suffice you against those mockers.",
        "verse_96": "Who set up another deity against Allah, then they will now know."
     },
    "count": 96
}
