{
    "name": "al-Munafiqqun",
    "index": "063",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
       "verse_1": "When the hypocrites come to you, they say, 'we bear witnesses you are undoubtedly, the Messenger of Allah, and Allah knows that you are His Messenger. But Allah bears witness that the hypocrites are most surely liars.",
        "verse_2": "They have taken their oaths as shield and they kept back from Allah's way, undoubtedly, they are doing most vile work.",
        "verse_3": "This is so because, they believed with their tongues, then disbelieved with their hearts, therefore a seal has been set over their hearts, so now they understand nothing.",
        "verse_4": "And when you see them, their bodies seem pleasing to you, and if they speak, you listen to their speech attentively. They thought they were wooden beams fixed to a wall. They take every cry over themselves. They are enemies, therefore beware of them. Kill them Allah! Whither are they perverting?",
        "verse_5": "And when it is said to them, 'come, that the Messenger of Allah may ask forgiveness for you, they turn their heads aside, and you see them that they turn aside their faces waxing proud.",
        "verse_6": "Equal it is for them whether you ask forgiveness for them or not, Allah will never forgive them. Undoubtedly, Allah guides not the disobedient.",
        "verse_7": "Those are they who say, 'spend not on those who are with the Messenger of Allah until they disperse', whereas the treasures of the heavens and the earth are only for Allah, but the hypocrites understand not.",
        "verse_8": "They say, 'if we return to Madina, the one most honor able will surely expel there from the one most mean, whereas the honor is for Allah, and His Messenger and Muslims, but the hypocrites know not.",
        "verse_9": "O believers! Let not your wealth and your children divert you from the remembrance of Allah and whoever does so, they are really in loss.",
        "verse_10": "And spend something out of Our provision in Our way before death comes upon any of you and say, O my Lord! Why did You not grant me respite for a little time, so that I might have given alms and been among the righteous.",
        "verse_11": "And Allah will never grant respite to any soul when its appointed time has come; and Allah is Aware of your doings."
   },
    "count": 11
}
