{
    "name": "al-A'raf ",
    "index": "007",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif Laam, Meem, Saad.",
        "verse_2": "A Book has been sent down to you, so let there be no impediment in your heart because of it, so that you may warn therewith and an admonition to the Muslims.",
        "verse_3": "O people! Follow what has been sent down to you from your Lord, and do not go behind other masters leaving Him. Very little you understand.",
        "verse_4": "And many a town We have destroyed, then Our torment came upon them by night or while they slept in the noon.",
        "verse_5": "Then nothing came out from their mouths when Our torment came upon them but they said, 'we were unjust people.'",
        "verse_6": "Then undoubtedly, We are necessarily to ask from those to whom Messengers were sent and undoubtedly, We are necessarily to ask from the Messengers.",
        "verse_7": "Then surely We shall tell them with Our knowledge, and We were not absent.",
        "verse_8": "And the weighing on that Day is sure, then those whose scales are heavy, they are to attain their objects.",
        "verse_9": "And those whose scales are light, then they are the persons who have put their souls in loss, the recompense of those excesses which they used to do with Our signs.",
        "verse_10": "And undoubtedly, We established you in the earth, and have made therein the means of your livelihood. How little thanks you give.",
        "verse_11": "And undoubtedly, We created you, then made your shapes, then We said to the angels, 'prostrate before Adam then all those fell prostrate, but Iblis (devil); he was not of those who prostrated.",
        "verse_12": "He said, 'What prevented you that you did not fall prostrate when I ordered you?' Said he, 'I am better than he, You created me of fire and made him of clay.'",
        "verse_13": "He said, ‘Get you down from here, it is not for you that you may behave proudly living here, get out, you are amongst the degraded ones.'",
        "verse_14": "Said he,'Give me time till the day they are raised up.'",
        "verse_15": "He said, 'You are given time.",
        "verse_16": "Said he, 'I swear that because You have seduced me, I shall necessarily sit on Your straight path in wait for them.",
        "verse_17": "'Then, surely I will come near them, from before them and from behind them, and from their right and from their left. And You will not find most of them thankful.'",
        "verse_18": "He said, \"Get out from here rejected, banished. Surely those of them who will follow you, I will fill Hell with you all.\"",
        "verse_19": "And O Adam! Dwell you and your mate in the Paradise, then eat therefrom wherever you will, and approach not this tree, otherwise you will be among transgressors.",
        "verse_20": "Then the devil (Satan) put evil suggestion in their hearts, so that he might open to them the things of their shame which were hidden from them, and said, 'Your Lord has forbidden you from this tree only because you may not become two angels or become immortals.'",
        "verse_21": "And he aware to them both that he was well-wisher of them both.",
        "verse_22": "Then he caused them to fall with delusion, then when they tasted that tree, the things of their shame became manifest to them, and they began to stick the leaves of the paradise on their bodies. And their Lord said to them, 'Did I not forbid you from that tree and tell you that the Devil (Satan) is your manifest enemy.'",
        "verse_23": "Both of them submitted, 'O Our Lord! We have wronged ourselves, if You forgive us not and have not mercy on us, the certainly we are among losers.'",
        "verse_24": "He said, 'Get down, in you one is enemy of the another and you are to stay in earth till a fixed time and there is provision for a time.'",
        "verse_25": "He said, 'you will be alive in it, and will die in it, and therefrom you will be raised.'",
        "verse_26": "O children of Adam! Undoubtedly, We have sent down towards you a dress that may cover your shameful parts and one that be an adornment to you; and the dress of righteousness, that is the best. This is one of Allah's signs, that they may be admonished.",
        "verse_27": "O children of Adam! Beware! Let not the devil (Satan) tempt you, as he brought your parents out from the paradise, stripping them of their dress that they may see their shameful parts. Undoubtedly, he and his tribe see you whence you see them not. Undoubtedly, We have made the devils friends of those who do not believe.",
        "verse_28": "And when they commit any indecency, they say, 'We found our forefathers on it and Allah commanded us so. Then say, 'Undoubtedly Allah commands not acts of indecency.' Do you allege against Allah what you know not?",
        "verse_29": "Say you, 'My Lord has commanded justice and set your faces a right at the time of each prayer, and worship Him being exclusively His bondmen. As He originated you so you will return.'",
        "verse_30": "A party He has shown path and the error of a party has been proved. They have taken the devils (Satans) as guardians leaving Allah and they think that they are guided.",
        "verse_31": "O children of Adam! Take you’re a adornment whenever you go to mosque; and eat and drink and do not cross the limit. Undoubtedly, the persons crossing the limit are not liked by Him.",
        "verse_32": "Say you, 'Who has forbidden the adornment of Allah which He brought forth for His bondmen and the pure foods?' Say you, that is for the believers in the world and is exclusively for them on the Day of Resurrection. ‘Thus We explain fully the signs for the people who have knowledge.",
        "verse_33": "Say you, 'My Lord has forbidden the indecencies which of them are open and which are hidden, and sin, and unjust excesses, and that you associate with Allah that for which He has not sent down any warrant and that you say of Allah what you know not.'",
        "verse_34": "And for every people there is a promise (term), then when their term will come, they cannot remain behind for an hour nor they get ahead of it.",
        "verse_35": "O children of Adam! if the Messengers come to you from among you, reciting to you My signs, then whoso refrains from evil and amends, then on them there is neither any fear nor any grief.",
        "verse_36": "And those who have belied Our signs and waxed proud against them, they are the people of Hell, in it they are to abide.",
        "verse_37": "Then who is more unjust than he who has forged lie against Allah or has belied His signs. They will receive what is written in their lot; till when Our Messengers came to them for taking away their souls, then they say to them, 'Where are those whom you used to worship besides Allah? They say, they are lost from us.' And they bear witness against their own souls that they were infidels.",
        "verse_38": "Allah says to them to enter the same Fire where other communities of Jinn and mankind went before you. When a community enters it, it curses the other; until when all have arrived therein, then the last will say to the first, 'O our Lord, these led us astray, and then award them double torment of the Fire.' He will say, 'All have double, but you know not.'",
        "verse_39": "And the first will say to the last, 'You have then not been anyhow better than us, taste therefore the torment the recompense of what you did.'",
        "verse_40": "Those who belied Our signs and waxed proud against them, the gates of heaven will not be opened for them, nor they will enter the paradise until the camel enters through the eye of a needle. And thus We requite the guilty.",
        "verse_41": "To them Fire will be the bed and Fire will be the covering. And thus We requite the unjust.",
        "verse_42": "And those who accepted faith and did good deeds to their strength. We put not burden on anyone beyond his strength. They are companions of Paradise, they are to abide therein.",
        "verse_43": "And We have taken out the rancours from their breasts. Beneath them will Flow Rivers, and they will say, 'All praises belong to Allah, Who has guided us to this, and we could not have found the way, if Allah had not guided us, undoubtedly, the Messengers of our Lord brought truth.' And it was proclaimed that this is the paradise you have inherited the reward of your doings.",
        "verse_44": "And the companions of the Heaven called the companions of the Hell, 'We have found what our Lord promised us to be true, then have you too found what your Lord promised you to be true?' They said, 'yes,' and in between them a caller called out: 'the curse of Allah be upon the unjust.",
        "verse_45": "Who bar from the path of Allah and desire to make it crooked and disbelieve in the Hereafter.",
        "verse_46": "And between Heaven and Hell there is a veil and on the Heights, there shall be some men who will recognize both groups by their marks, and will call the people of Heaven, '(saying) peace be upon you, 'these have not entered into the Heaven, but are greedy for it.",
        "verse_47": "And when their eyes will turn towards the people of the Hell, they will say, 'O our Lord! Keep us not with the unjust people.'",
        "verse_48": "And the people of the heights will call to certain men whom they recognize by their mark, and will say, 'what did your multitude avail you and that in which you took pride?'",
        "verse_49": "Are these the people on whom you used to swear that Allah would not amend His mercy a least to them? They were rather told, 'enter Paradise, no fear upon you nor any grief.'",
        "verse_50": "And the companions of the Fire will call the companions of the Heaven that give us some benefit of your water or of that Allah has provided for you as food. They will say, 'undoubtedly, Allah has forbidden these both to the infidels.'",
        "verse_51": "Those who made their religion as a plaything and amusement and the life of the world has deceived them. Therefore today, We shall leave them as they had left the conception of meeting of this Day and as they used to deny Our signs.",
  "verse_52": "And surely We have brought them a Book which We have detailed with great knowledge, a guidance and mercy to the people who believe.",
  "verse_53": "What they are looking for, but only this that the result of the sayings of the Book should come before. The day when the foretold result will occur, those who had forgotten it before will say, 'Undoubtedly the Messengers of our Lord had brought the truth, then, is there any intercessor for us who could intercede on our behalf? Or could we be sent back so that we might do deeds other than we did before. Surely they put their souls at a loss, and have been lost from those who used to calumniate.",
  "verse_54": "Undoubtedly, your Lord is Allah, Who created the heavens and earth in six days, then established Himself on the Throne befitting on His Dignity. He covers the night and day by each other following it swiftly, and made the sun and moon and stars all subservient to His command. Behold! His is the creation and command. Blessed is Allah, the Lord of the worlds.",
  "verse_55": "Call on your Lord humbly and secretly. Undoubtedly, He likes not those who cross the limit.",
  "verse_56": "And spread not mischief in the earth after it has been set right and call on Him fearing and longing. Surely the mercy of Allah is nigh to the good-doers.",
  "verse_57": "It is He Who sends forth winds bearing good tidings before His mercy till they have carried heavy clouds, We drive it towards any dead land, then send down water therewith, then caused to grow varied fruits therewith. Thus shall We bring forth the dead, haply you may accept admonition.",
  "verse_58": "And the land which is good, its vegetation comes forth with the command of Allah and from that which is bad comes forth nothing but very little hardly. Thus We explain signs variedly for those who are grateful.",
  "verse_59": "Undoubtedly, We sent Nuh towards his people, then he said, 'O my people! Worship Allah, you have no God other than He. Surely I fear for you the torment of the Mighty Day.'",
  "verse_60": "The leaders of his people said, 'Undoubtedly, we see you in apparent error.",
  "verse_61": "Said he, 'O my people no error is in me; but I am Messenger of the Lord of the worlds.",
  "verse_62": "'I deliver to you the messages of my Lord and wish your good and I know that from Allah which you know not.",
  "verse_63": "'And have this surprised you that an admonition has come to you from your Lord through a man from amongst you, so that he may warn you and you be God-fearing and haply you may be shown mercy?'",
  "verse_64": "Then they belied him, so We delivered him and those with him in the Ark and drowned those who belied Our signs, certainly that was a blind group.",
  "verse_65": "And to Aad sent Hud from their brethren. He said, 'O my people! Worship Allah, you have no God other than He. Then do you not fear?'",
  "verse_66": "The disbelieving leaders of his people said, 'Surely, we find you foolish and we surely think you to be one of the liars.'",
  "verse_67": "Said he, 'O my people there is no concern of foolishness with me, I am indeed a Messenger from the Lord of the worlds.",
  "verse_68": "I deliver to you the messages of my Lord and I am your trustworthy well-wisher.'",
  "verse_69": "And have this surprised you that an admonition has come to you from your Lord through a man from amongst you, so that he may warn you? And remember when He appointed you as successors of the people of Nuh and increased the stature of your body; then remember the bounties of Allah that haply you may fare well.",
  "verse_70": "They said, 'Have you come to us that we should worship Allah alone and leave what our fathers used to worship, then bring you that, you are promising for us if you are truthful.'",
  "verse_71": "He said, 'Surely there have befallen you the torment and wrath of your Lord. Are you disputing with me only about those names which you and your fathers have named for which Allah has sent down no authority? Wait then; I also wait with you.'",
  "verse_72": "Then We delivered him and those with him by showing a great mercy from Us, and cut off the roots of those who used to belie Our signs, and they were not believers.",
  "verse_73": "And to Thamud We sent Saleh from their brethren. He said, 'O my people! Worship Allah, you have no God other than He. Undoubtedly, there has come to you bright proof from your Lord, this is a she-camel of Allah a sign for you. So leave her that she may eat in Allah's earth and touch her not with evil, lest a painful torment will overtake you.",
  "verse_74": "And remember when He made you successors of Aad, and assigned you a place in the land that you build palaces in its plains, and hew out houses in its mountains. Then remember the bounties of Allah and wander not in the earth spreading mischief.",
  "verse_75": "The proud leaders of his people said to the weak Muslims, 'Do you know that Saleh is a Messenger of his Lord?' They said, 'We believe in what has been sent with him.'",
  "verse_76": "The proud ones said, ‘In that which you believed, we disbelieve.'",
  "verse_77": "Then they hamstrung the she camel and rebelled against the command of their Lord and said, 'O Salih, 'bring upon us that which you are promising for, if you are a Messenger.'",
  "verse_78": "Then the earthquake took them so in the morning they lay prostrate in their homes.",
  "verse_79": "Then Saleh turned back his face from them and said, 'O my people! Undoubtedly, I did deliver to you the messages of my Lord, and wished you good, but you do not approve the well-wishers.'",
  "verse_80": "And sent Lut, when he said to his people, 'Do you commit that indecency which was not committed by anyone in the world before you?",
  "verse_81": "'You rather approach men lustly instead of women, on the contrary you people have crossed the limit.'",
  "verse_82": "And there was no answer of his people but to say only this, Turn them out of your town, these people aspire to be pure.'",
  "verse_83": "Then We delivered him and his family save his wife, she was of those who remained behind.",
  "verse_84": "And We rained down upon them a rain, then behold! How was the end of the sinners?",
  "verse_85": "And to Madyan We sent Shuaib from their brethren. He said, 'O my people! Worship Allah, there is no God for you other than He. Undoubtedly, there has come to you a bright proof from your Lord, then fill up the measure and weight, and give not the people goods after diminishing and spread not mischief in the earth after fair ordering. This is good for you, if you believe.",
  "verse_86": "And sit not on every path threatening and barring from Allah's way to the wayfarers who have believed in Him, and desiring crookedness in it; and remember, when you were few. He multiplied you, and behold! How was the end of the mischief makers?",
  "verse_87": "And if there is a party of you who believed in that with which I have been sent and a party who believed not, then wait till Allah decides between us; and Allah's decision is the best.'",
  "verse_88": "The proud chiefs of his people said, 'O Shuaib, we swear that we will drive you out and the Muslims who are with you from our town or you come to our faith.' He said, 'What, even though we hate it?",
  "verse_89": "'Certainly we shall forge a lie against Allah, if we come to your faith after Allah has delivered us from it. And it is not for we Muslims that we should come in your faith but that Allah, Who is our Lord so willed. The knowledge of our Lord comprehends everything. We have relied on Allah. O Our Lord! Decide between us and our people with truth and Your decision is the best.'",
  "verse_90": "And the infidel chiefs of his people said, 'If you follow Shuaib, you shall certainly be the losers.'",
  "verse_91": "Then an earthquake overtook them; so in the morning they fell prostrate in their homes.",
  "verse_92": "Those who belied Shuaib as if they had never been dwelling in those homes. Those who belied Shuaib were the people who were ruined.",
  "verse_93": "Then Shuaib turned his face from them and said, 'O my people, I have already delivered to you the messages of my Lord and admonished for your good, how then should I lament over infidels.",
  "verse_94": "And We have not sent any Prophet in any town but We seized the people thereof with adversity and suffering, that anyhow they might lament.",
  "verse_95": "Then We changed the place of evil with good until they became numerous and said, \"No doubt, sufferings and comforts visited our fathers,\" then We seized them suddenly while they were unmindful.",
  "verse_96": "And if the people of the towns had believed and feared, then We would surely have opened upon them blessings from heaven and earth, but they belied, then We arrested them on account of their doings.",
  "verse_97": "Do the people of the towns not fear that Our torment might come upon them at night while they are sleeping?",
  "verse_98": "Or do the people of the towns not fear that Our torment might come upon them in day light while they are playing?",
  "verse_99": "Are they unaware of the secret devise of Allah? And none becomes fearless against the secret devise of Allah but the losers.",
  "verse_100": "And do those who inherited the land after the owners of it not get so much guidance that if We please, We would have afflicted them for their sins? And We put a seal upon their hearts so that they hear nothing.",
  "verse_101": "These are the towns the stories of which We relate to you, and undoubtedly, there came to them their Messengers with bright proofs, but they were not able to believe what they had first rejected. Thus Allah put a seal upon the hearts of the infidels.",
  "verse_102": "And We found not most of them true to their words, and necessarily, We found' most of them disobedient.",
  "verse_103": "Then, after them, We sent Moses towards Firawn (Pharaoh) and his chiefs with Our Signs, but they did injustice to those signs, see then how was the end of the mischief makers.",
  "verse_104": "And Moses said, 'O Firawn! I am a Messenger from the Lord of the worlds.",
  "verse_105": "'lt is my duty not to say anything about Allah but the truth. I have come to you all with sign from your Lord, then let the children of Israel go with me.'",
  "verse_106": "He said, 'If you have come with any Sign, then bring forth if you are truthful.'",
  "verse_107": "Then Moses cast his staff, it at once became a serpent manifest.",
  "verse_108": "And he drew forth his hand after putting it into his collar, then it began to shine before the beholders.",
  "verse_109": "The chiefs of the people of Pharaoh said, 'This is indeed a magician knowing.",
  "verse_110": "'He desires to turn you out from your land, what is your advice then?'",
  "verse_111": "They said, 'Put him off and his brother, and send into the cities men to collect.",
  "verse_112": "'That they may bring to you every magician having knowledge.'",
  "verse_113": "And the magicians came to Pharaoh (Firawn) and said, 'We shall get some reward if we win.'",
  "verse_114": "Firawn said, yes', and then you shall be near ones.'",
  "verse_115": "They said, 'O Musa, either you throw first or we be the throwers.'",
  "verse_116": "Musa said, 'you throw,' when they threw, 'they enchanted the eyes of the people and frightened them and brought forth a great magic.",
  "verse_117": "And We revealed to Musa, 'throw your staff, then suddenly it began to swallow their lying shows.",
  "verse_118": "Then the truth was established and their works proved vain.",
  "verse_119": "Then they were laid vanquished here and returned humiliated.",
  "verse_120": "And the magicians were made to prostrate.",
  "verse_121": "They said, 'We believed in the Lord of the worlds.",
  "verse_122": "'Who is the Lord of Musa and Haroon?'",
  "verse_123": "Firawn said, 'You have believed in Him before I gave you leave. This is indeed a big plot which you all have plotted in the city that you may drive forth its people therefrom; so now you shall know.",
  "verse_124": "'I shall assuredly cut off your hands and your feet on alternate sides, then I shall hang you all.'",
  "verse_125": "They said, 'We are to return towards our Lord.",
  "verse_126": "'And what looked you bad of us, save this that we have believed in the signs of our Lord, when they came to us; O our Lord! pour upon us patience and cause us to die as Muslims.'",
  "verse_127": "And the Chiefs of the people of Firawn said, 'Do you leave Musa and his people for this that they may spread mischief in the land, and leave you and your gods?' He said, 'Now we shall kill their sons and let live their daughters, and surely we are dominant over them.'",
  "verse_128": "Musa said to his people, 'Seek the help of Allah and have patience, no doubt, Allah is the Owner of the earth, makes successor whomsoever He pleases of His bondmen. And the end is in the hand of the God-fearing.'",
  "verse_129": "They said, 'We were oppressed before your coming to us and since you have come to us, He said, 'It it near that your Lord may destroy your foe and make you successors in the land to see then how you act.'",
  "verse_130": "And no doubt, We seized the people of Firawn with years of dearth and scarcity of fruits, haply they may accept admonition.",
  "verse_131": "Then whenever, they got good, they used to say, 'this is for us', and whenever evil smote them they took it as bad omen with Musa and those with him. Behold! their ill-fortune is with Allah but most of them do not know.",
  "verse_132": "And they said, 'whatever the nature of a Sign you may bring to us to enchant us therewith, we are in no way to believe you.'",
  "verse_133": "Then We sent upon them the flood, and the locusts, and the lice, and the frogs, and the blood—distinct signs, then they waxed proud and they were a sinful people.",
  "verse_134": "And whenever the torment fell upon them, they used to say, 'O Musa, pray for us to your Lord because of that covenant of His which is with you. No doubt, if you would remove from us the torment, we would certainly believe in you and will send with you the children of Israel.'",
  "verse_135": "But whenever We removed the torment from them for a term to which they were to reach, they retracted.",
  "verse_136": "We then took vengeance on them, therefore We drowned them in the river, because they belied Our Signs and were unaware of them.",
  "verse_137": "And We made a people who were already suppressed, inheritors of the eastern and western parts of that land in which We put Our blessings. And the gracious promise of your Lord was fulfilled for the children of Israel, the recompense of their patience. And We destroyed whatever Firawn and his people made and what they used to erect.",
  "verse_138": "And We brought the children of Israel across the river, then they came upon a people sitting devotedly before their idols. They said, 'O Musa, make for us a god just as they have so many gods.' He said, 'Surely you are an ignorant people.'",
  "verse_139": "This condition in which they are, is of destruction and whatever they are doing is fully void.",
  "verse_140": "He said, \"Shall I seek for you a god other than Allah whereas He has exalted you above all peoples.'",
  "verse_141": "And remember, when We delivered you from the people of Firawn who afflicted you with evil punishment, slaughtering your sons and letting your daughters live. And therein was the great bounty of your Lord.",
  "verse_142": "And We made Musa a promise of thirty nights and completed adding ten more in them, so the promise of his Lord was completed by forty nights. And Musa said to his brother, Haroon, 'be my vicegerent among my people and do right and follow not the way of mischief-makers.'",
  "verse_143": "And when Musa came to Our appointed time and his Lord spoke to him, he submitted, 'O my Lord! Show me Your sight that I may behold You., Said He, you shall never see me; but look towards this mountain, if it remains standing at its place, then soon you will see Me.' Then when his Lord made His light shine on the mountain, He broke it into pieces; and Musa fell down unconscious. Then when he came to senses, he said, 'Hallowed be You I turn towards You and I am the first of the Muslims.'",
  "verse_144": "Said Allah, 'O Musa, I have chosen you from amongst the people by My Messages and by My Word. Take then what I have given you and be of the grateful.'",
  "verse_145": "And We wrote for him on the Tablets of everything an admonition, and details of everything, and said, 'O Musa, take it with firmness and bid your people follow the best of it. Soon I shall show you the abode of the disobedient.'",
  "verse_146": "And I shall turn from My Signs those who wish greatness in the earth unjustly, And even if they see all the signs, they will not believe therein, and if they see the path of guidance, they will not like to walk in it; and if they see the path of error, they will be ready to adopt it. This is so because they belied Our Signs and posed themselves unaware.",
  "verse_147": "And those who have belied Our Signs and the meeting of the Hereafter, their all deeds are wasted. What they will get in recompense but the same which they used to do.",
  "verse_148": "And after Musa, his people made a calf out of their ornaments, a lifeless body, producing a lowing sound. Did they not see that neither it talked to them and nor guided them to anyway? They took it, and they were unjust.",
  "verse_149": "And when they regretted and understood that they had strayed, they said, 'If our Lord have not mercy upon us and forgives us not, then we are ruined.'",
  "verse_150": "And when Musa returned to his people full of anger, peeved, he said, 'How badly you acted in my place after me! Did you hasten from the Commands of your Lord? ‘And he threw down the tablets and began to pull his brother (Haroon) towards him catching hold of the hair of his brother's head. He said, 'O son of my mother, the people deemed me weak and were about to kill me, so do not make the enemies laugh over me and place me not with the unjust people.'",
  "verse_151": "He said, \"My Lord, forgive me and my brother, and admit us into Your mercy; for you are the Most Merciful of the merciful.\"",
  "verse_151": "He submitted, 'O my Lord, forgive me and my brother, and cause us to enter Your mercy and You are the most Merciful of the merciful.'",
  "verse_152": "Undoubtedly, those who had already taken the calf for themselves, soon the wrath and disgrace of their Lord are to reach them in the life of the world. And thus We recompense those who cast aspersions.",
  "verse_153": "And those who committed evils and thereafter repented and accepted faith, then after that your Lord is Forgiving, Merciful.",
  "verse_154": "And when the anger of Musa was appeased, he took up the tablets, and in their writing there is guidance and' mercy for those who fear their Lord.",
  "verse_155": "And Musa chose seventy men of his people for Our promised appointment, then when earthquake overtook them, Musa submitted, 'O my Lord, had You wished, then You would have destroyed them and me before. Will You kill us for what our foolish ones have done? That is not but Your test, whereby You cause astray whom You will, and guide whom You will. You are our Protector. You forgive us, and have mercy upon us, and You are the Best of the forgivers.",
  "verse_156": "'And prescribe for us in this world good and in the Hereafter, no doubt, we have returned to You.' He said, 'My punishment, I inflict whom I will, and My mercy encompasses all things. Then soon I shall prescribe it for those who fear God and pay the poor due and believe in Our Signs.'",
  "verse_157": "Those who will serve the Messenger, unlettered the Communicator of hidden news. When they will find with them written in the Taurat and Injeel. He will bid them to do good and will forbid them from doing evil, and will make lawful for them clean things and will forbid for them unclean things, and will take off from them that burden and shackles which were upon them. Then those who believe in him and honor him and help him and follow that light which has been sent down with him, they are the persons who attained their objects.",
  "verse_158": "Say you, 'O mankind, I am Messenger to you all from Allah to Whom belongs the kingdom of the heavens and of the earth. None is to be worshiped except He, He gives life and causes death, believe then in Allah and His Messenger, the unlettered, the Communicator of hidden news, that he believes in Allah and His words; and serve him so that you may be guided.'",
  "verse_159": "And of the people of Musa there is a community that tells the path of truth and does justice therewith.",
  "verse_160": "And We divided them in twelve tribes, various communities. And We revealed to Musa, when his people asked him for water that strike with your staff this rock, then there gushed forth from it twelve springs. Every community recognized its drinking place. And We made clouds as shades over them, and sent down Manna and Salwa upon them. Eat of the clean things We provided for you, and they harmed Us not, but they harmed their own souls.",
  "verse_161": "And remember when it was said to them, \"Dwell in this town and eat from it whatever you like, and say, 'our sins may be removed and enter the gate, prostrating, We shall forgive you yours sins. Soon We shall give more to righteous ones.\"",
  "verse_162": "Then the unjust of them changed the word contrary to that what was ordered to them, then We sent down upon them torment from the heaven, the recompense of their injustice.",
  "verse_163": "And ask them the condition of the town that was on the seashore; when they crossed the limit in the matter of Sabbath, when on the day of Sabbath their fish came swimming before them, and the day that was not of Sabbath, they did not come.Thus We used to try them on account of their disobedience.",
  "verse_164": "When a group among them said, 'Why do you admonish those whom Allah is to kill or to chastise with a severe torment?' They said, 'as an excuse before your Lord, and that haply they may fear.'",
  "verse_165": "Then when they forgot what they had been admonished, We rescued those who forbade from evil, and caught the unjust in a vile torment, the recompense of their disobedience.",
  "verse_166": "Then again when they rebelled against the command of prohibition, We said to them, 'be you apes, driven away.'",
  "verse_167": "And when your Lord proclaimed that necessarily till the Day or Resurrection, He would continue to send such against them who would make them taste evil punishment. Undoubtedly, your Lord, necessarily, is Swift in retribution; and undoubtedly, He is Forgiving, Merciful.",
  "verse_168": "And We scattered them into communities in the earth, some of them are righteous, and some of them otherwise, and We tried them with good things and evil that haply they may return.",
  "verse_169": "Then after them came such degenerate successors who inherited the Book. They take the goods of this world and say, 'Now we shall be forgiven.' And if more goods the like of them came to them, they would take them. Was not the covenant of the Book taken from them, that they should say nothing concerning Allah but the truth, and they have read that? And undoubtedly, the last abode is better for the Godfearing. Have you then no wisdom?",
  "verse_170": "And those who hold fast to the Book and established prayer, We waste not the reward of the righteous.",
  "verse_171": "And when We raised mountain over them as that is a canopy and they thought that it would fall upon them, hold fast what We have given to you and remember what is therein, that haply you may be Godfearing.",
  "verse_172": "And O beloved Prophet! remember, when your Lord brought forth from the loin of Adam's children their seed, and made themselves witnesses against own selves', 'Am not your Lord?' all said, 'Why not we all bear witness', lest you should say on the Day of Resurrection, that you were not aware of it.",
  "verse_173": "Or lest you should say, 'Polytheism was committed by our forefathers before, and we were their offspring after them. Will You then destroy us for what was done by wrongdoers?'",
  "verse_174": "And thus We explain Our signs variedly and in order that they may return.",
  "verse_175": "And O beloved Prophet! Relate to them the story of him to whom We gave Our Signs, then he stepped away clearly from them, then Satan followed him and he became of the misguided.",
  "verse_176": "And if We had willed, We would have lifted him on account of Our Signs, but he clung to the earth and followed his desires, then his condition is like a dog, if you attack him, he brings his tongue out and if you leave him, he brings his tongue out. This is the condition of those who belied Our Signs. So you recount them the admonition haply they may ponder.",
  "verse_177": "What a bad example is of those who belied Our Signs, and they did wrong their own souls.",
  "verse_178": "Whom so Allah guides, he is on the right path, and whom so Allah leads astray, those, they remained in loss.",
  "verse_179": "Undoubtedly, We have created for Hell many Jinn and men, they have hearts, but understand not therewith and the eyes, they see not therewith and the ears, they hear not herewith. They are like cattle, nay, more misguided. They are indeed lying heedless.",
  "verse_180": "And to Allah belong all the best names, so call Him by them, and leave those who go out from truth with regard to His names, they will soon get for what they have done.",
  "verse_181": "And out of Our making is a community who tells the truth and does justice therewith.",
  "verse_182": "And those who belied Our Signs, soon We shall carry them gradually towards torment whence they know not.",
  "verse_183": "And I will let loose them. Undoubtedly, My secret plan is the firmest.",
  "verse_184": "Do they not ponder that there is no relation of insanity to their companion? He is only a warner manifest.",
  "verse_185": "Did they not look into the kingdom of the heavens and the earth, and what things that Allah has made, and that perhaps their term may have come nigh? Then in what discourse they will believe thereafter?",
  "verse_186": "Whomsoever Allah leads astray none is to guide him. And He leaves them to wander in their contumacy.",
  "verse_187": "They ask you concerning the Hour that when it is to come. Say you 'The knowledge of it is only with my Lord, He alone will disclose it at its proper time.' It is lying heavy on the heavens and earth; it shall not come upon you but of a sudden. They ask you, as you have already investigated it well; say you, 'The knowledge of it is only with Allah,' but most people do not know.",
  "verse_188": "Say you, 'I am not independent for doing good and bad to my own self, but as Allah please. And if I would have known Unseen, then I would have gathered ample good, and no evil would have touched me, I am only a warner and giver of glad tidings to a people who believe.'",
  "verse_189": "lt is He Who created you from a single soul, and made therefrom his mate that he may find rest in her, then when the male covered her, she bore a light burden, then carried it about, then when she grew heavy, both prayed to their Lord, \"Necessarily if You would give us a child befitting, then undoubtedly, we shall be grateful.\"",
  "verse_190": "Then when He gave them a befitting child they ascribed His associates, in respect of His bestowal but Allah is exalted above from their polytheism.",
  "verse_191": "Do they associate those who make nothing and they are themselves created?",
  "verse_192": "And neither can they give any help to them, nor can they help themselves.",
  "verse_193": "And if you call them towards guidance, they will not follow you. It is same to you whether you call them or you remain silent.",
  "verse_194": "Undoubtedly, those whom you worship besides Allah are bondsmen like you, then call upon them, then they respond to you, if you are truthful.",
  "verse_195": "Have they feet to walk with or have they hands to hold with? Or have they eyes to see with? Or have they ears to hear with? Say you, 'Call upon your associates and then try your guile on me and give me no respite.'",
  "verse_196": "Undoubtedly, my Protector is Allah, Who sent down the Book, and He befriend the righteous.",
  "verse_197": "And those whom you worship besides Him cannot help you, nor do they help themselves.",
  "verse_198": "And if you call them towards guidance, they hear not. And you see them looking at you, and they see nothing.",
  "verse_199": "(O beloved Prophet,) Adopt forgiveness and bid to good and turn away from the ignorant.",
  "verse_200": "And (O listener!) if the Satan give you any pricking, then seek refuge of Allah. Undoubtedly, it is He Who is Hearing, Knowing.",
  "verse_201": "Undoubtedly, those who fear Allah, when a thought of Satan touches them, become careful, at the same time their eyes are opened.",
  "verse_202": "And those who are brothers of Satans, they drag them on towards error, then they relax not.",
  "verse_203": "And (O beloved Prophet!) when you bring not to them any Sign, they say, 'Why have you not made it yourself?' Say you, 'I follow only what is revealed to me from my Lord.' This is an eye opener from your Lord and guidance and mercy for the Muslims.",
  "verse_204": "And when the Quran is recited, hear it patiently and be silent so that you may have mercy.",
  "verse_205": "And remember your Lord within yourself, humbly and fearfully, and without uttering a voice from the tongue, morning and evening and be not you amongst heedless.",
  "verse_206": "Undoubtedly, those who are with your Lord wax not proud from His worship, and chant His hallowness and to Him they prostrate."
},
    "count": 206
}
