{
    "name": "al-Qiyamah",
    "index": "075",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "I call to swear by the Day of Resurrection.",
        "verse_2": "And I do swear by the self- blaming soul.",
        "verse_3": "Does man think that We shall not assemble his bones?",
        "verse_4": "Why not, We are Powerful to restore his very fingertips.",
        "verse_5": "But man desires to do wrong infront of him.",
        "verse_6": "He asks, when will be the Day of Resurrection.",
        "verse_7": "But when the eyes is dazzled.",
        "verse_8": "And the moon is eclipsed.",
        "verse_9": "And the sun and the moon will be joined together.",
        "verse_10": "On that day the man will say, where is place to run away do?",
        "verse_11": "Never, there is no refuge.",
        "verse_12": "On that day one is to take towards your Lord alone.",
        "verse_13": "That day man shall be informed as to what he has sent forward and what he left behind.",
        "verse_14": "But rather man has complete sight over his own condition.",
        "verse_15": "And if he brings all excuses he hasm, even then he will not be heard.",
        "verse_16": "Move not your tongue with Quran that you may hasten to learn it.",
        "verse_17": "Undoubtedly, it is upon Us to preserve it and to recite.",
        "verse_18": "So when We have already recited it follow then its recital.",
        "verse_19": "Then it is upon Us, to make clear its minute details.",
        "verse_20": "Nothing, rather you O infidels! Love near life.",
        "verse_21": "And you have already neglected the Hereafter.",
        "verse_22": "Some faces on that day will be fresh.",
        "verse_23": "Looking towards their Lord.",
        "verse_24": "And some faces that day will be sad and dismal.",
        "verse_25": "Thinking that back-breaking calamity will befall them.",
        "verse_26": "Yes, when it will reach to the throat.",
        "verse_27": "And it will be said, is there anyone who may exorcise?",
        "verse_28": "And he (the dying man) will think that it is the hour of parting.",
        "verse_29": "And shank will intertwined with shank.",
        "verse_30": "The drive that day is towards your Lord.",
        "verse_31": "For neither he accepted the truth nor offered prayers.",
        "verse_32": "Yes, he belied and turned his face.",
        "verse_33": "Then he departed to his home arrogantly.",
        "verse_34": "Woe is near to you, now woe is near.",
        "verse_35": "Again woe is near to you, now woe is near.",
        "verse_36": "Does man think that he will be left free?",
        "verse_37": "Was he not a sperm of emission emitted?",
        "verse_38": "Then he became a clot, then He created him and perfected him.",
        "verse_39": "And then He made of him a pair, the male and female.",
        "verse_40": "Would the One Who has done all these things be not able to give life to the dead?"
      },
    "count": 40
}
