{
    "name": "al-An'am",
    "index": "006",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "All Praise to Allah, who created the heavens and the earth and brought into being the darkness and the light, yet the infidels ascribe equals to their Lord.",
  "verse_2": "It is He Who created you from clay, then He decreed a term, and there is a determined promise with Him, thereafter you doubt.",
  "verse_3": "And He is the very Allah of heavens and earth. He knows all your secrets and what you reveal and knows your doings.",
  "verse_4": "And there comes to them no sign of the signs of their Lord, but they turn away their faces from it.",
  "verse_5": "Then undoubtedly, they belied the truth when it came to them, so now they are to be informed of that they were mocking at.",
  "verse_6": "Have they not observed how many a generation We have destroyed before them? We gave them such establishment in the earth which We gave you not, and We sent them rain in torrents and caused rivers flow beneath them, then We destroyed them on account of their sins, and after them raised up another generation.",
  "verse_7": "And if We had sent down on you something written on paper so that they would have touched it with their hands, even then the infidels would have said, 'this is nothing but manifest magic'.",
  "verse_8": "And they said, 'Why not any angel has been sent on him? And if We would have sent an angel, the affair would have been finished, and they would not have been given time.",
  "verse_9": "And if We had made the Prophet an angel, even then We would have made him a man, and they would have the same doubt in him as they have now.",
  "verse_10": "And assuredly, O beloved Prophet! Messengers before you were mocked at; then those who were mocking at them, their mockery surrounded themselves.",
  "verse_11": "Say you, 'Go about in the land, and then see how has been the end of beliers'.",
  "verse_12": "Say you, 'To whom belongs whatever is in the heavens and the earth? Say you, To Allah, 'He has written mercy upon His generosity. Undoubtedly, He will surely gather you on the Day of Judgement. There is no doubt in it. Those who have put their souls in loss, would not believe.",
  "verse_13": "And to Him belongs whatever dwells in the night and day. And He is the Hearer, the Knower.",
  "verse_14": "Say you, 'Shall I take for protector any other than Allah that Allah Who has created heavens and earth and He feeds and is not fed?' Say you, 'I have been commanded to submit first; and never be of polytheists.'",
  "verse_15": "Say you, 'If I disobey my Lord, then I fear the torment of a Mighty Day.'",
  "verse_16": "On that Day, from whomsoever the torment is averted, Allah indeed has had mercy on him. And this is the manifest triumph.",
  "verse_17": "And if Allah causes any evil to you, then there is none to remove it but He. And if He brings you good, then He can do everything.",
  "verse_18": "And He is all dominant over His bondmen. And He is the very Wise, the Aware.",
  "verse_19": "Say you, ‘Whose evidence is the greatest?' Say you, 'Allah is Witness between me and you. This Quran has been revealed to me so that with it I may warn you and whomsoever it reaches. ‘Then do you give this evidence that besides Allah there are other gods? Say you 'I do not give this evidence. 'Say you, 'He is the only One to be worshiped and I am quit of all those you associate with Him.'",
  "verse_20": "Those whom We gave the Book recognize this Prophet as they recognize their sons. Those who have put their souls in loss would not believe.",
  "verse_21": "And who is more unjust than he who forges a lie against Allah or belies His signs. Undoubtedly, the unjust will never get prosperity.",
  "verse_22": "And the Day when, We shall raise them altogether, then will say to the polytheists, 'where are those your associates whom you used to assert.'",
  "verse_23": "Then there remained not any fabrication for them but to say, 'by Allah, Our Lord, We were not polytheists.'",
  "verse_24": "See! How they lied against themselves and were lost from them the things which they had been concocting.",
  "verse_25": "And among them is someone who gives ear to you, and We have put veils over their hearts so that they understand it not and in their ears is heaviness. And if they may see all signs, even then they will not believe in them. In as much as when they come to you disputing with you, then infidels say, 'this is not but the stories of the ancients. '",
  "verse_26": "And they forbid from it and keep a far from it, and they ruin not but their own souls and they perceive not.",
  "verse_27": "And if you could see when they will be made to stand before the fire, then they will say, 'would that we might be returned and belie not, the signs of our Lord and might become Muslims.",
  "verse_28": "But it has become manifest to them what they used to conceal before. And if they were sent back, they would do the same from which they were forbidden and, undoubtedly, they are surely liars.",
  "verse_29": "And they said, 'this is the only our life of the world, and we are not to be raised.'",
  "verse_30": "And if you could see when they shall be made to stand before their Lord. He will say, is not this truth? 'They will say, 'why not by our Lord' He will say, 'then now taste the torment, the reward of your infidelity.'",
  "verse_31": "Undoubtedly, they remained losers who denied the meeting with their Lord, so much so that when the Hour came to them suddenly, they said, 'Oh, alas for us, that we committed mistake in accepting it and that they bear their burden on their backs. Oh, what an evil burden they are bearing!",
  "verse_32": "And worldly life is nothing but a play and amusement. And undoubtedly, the last abode is better for those who fear. Do you not then understand?",
  "verse_33": "We know that what they say grieves you, they belie you not, but the evildoers deny the signs of Allah.",
  "verse_34": "And the Messengers were belied before you, but they endured patiently when they were belied and were persecuted, until Our help came to them. And there is none to change the words of Allah; and the news of the Messengers has already come to you.",
  "verse_35": "And if their turning away of faces has grieved you, then if you can do, seek any tunnel in the ground or a ladder unto heaven, and bring a sign for them. And if Allah had willed, then He would have gathered them on the guidance, so O listener! be never you an innocent.",
  "verse_36": "Those very accept who listen, and Allah will raise those of dead hearts, then towards Him they will be driven.",
  "verse_37": "And they said, 'why has not a sign been sent down to him from his Lord?' Say you, 'Allah has power to send down a sign, but most of them are fully ignorant.'",
  "verse_38": "And there is no one crawling on earth nor any bird that flies on its wings but are the communities like you. We have left out nothing in the Book. Then to their Lord they shall be raised.",
  "verse_39": "And those who belied Our signs are deaf and dumb in utter darkness. Allah sends astray whom He will, and places on the straight path whom He will.",
  "verse_40": "Say you, 'tell you then if the torment of Allah comes to you or the Hour is established, will you call upon any other than Allah, if you are truthful?",
  "verse_41": "But you will call Him alone, so if He please He would remove that for which you call for Him, and you would forget the associates.",
  "verse_42": "And undoubtedly, We sent Messengers towards communities before you, then seized them with adversity and distress so that they might beseech.",
  "verse_43": "Why did it not happen that when Our torment came upon them, they would have beseeched? But their hearts were hardened and the devil (Satan) made fair-seeming to them their deeds in their eyes.",
  "verse_44": "Then when they forgot that with which they were admonished, We opened unto them the gates of all things, until when they became delighted at what they were given, then We seized them suddenly, now they were left in despair.",
  "verse_45": "Then the unjust were uprooted completely; and all praises belong to Allah, the Lord of all the worlds.",
  "verse_46": "Say you, 'look you, if Allah should take away your ears and eyes and seal up your hearts, then who is the God other than Allah Who could bring these things back to you?' See how in different manners We explain the signs, but they turn away their faces.",
  "verse_47": "Say you, 'look you, if the torment of Allah comes upon you suddenly or openly, then who will be destroyed save the unjust people.'",
  "verse_48": "We do not send the Messengers but to give glad tidings and to warn, then those who believed and amended themselves, then to them there is no fear nor any grief.",
  "verse_49": "And those who belied Our signs, torment shall reach them because of their disobedience.",
  "verse_50": "Say you, ‘I do not say to you, I possess the treasures of Allah', and nor I say, 'I know the unseen myself, and nor do I say to you, 'I am an angel.' I follow only that which is revealed to me.' Say you, shall the blind and the seeing become equal? Do you then not ponder?",
  "verse_51": "And with this Quran warn those who fear that they shall be raised towards their Lord in a manner that there shall be no supporter nor any intercessor for then besides Allah in the hope that they may become God-fearing.",
  "verse_52": "And drive not away those who call upon their Lord Morning and evening seeking His pleasure. Nothing on you from their account, and nothing on them from your account, then if you drive them away, this thing is far from justice.",
  "verse_53": "And thus We made one of them a trial for the other on that the wealthy infidels may say seeing the needy Muslims, 'Are these people whom Allah has favored among us? Does not Allah know well the grateful?",
  "verse_54": "And when those who believe in Our signs come to you, then say to them, 'Peace be upon you,' your Lord has prescribed mercy on Himself, that whoso of you does some evil ignorantly and repents thereafter and amends, then undoubtedly, Allah is Forgiving, Merciful.",
  "verse_55": "And in this way We explain fully Our signs, and in order that the way of the guilty may become evident.",
  "verse_56": "Say you 'I have been for bidden to worship those whom you worship besides Allah: 'Say you, 'I follow not your vain desires, if it be so, then I would go astray and would not remain on the path.'",
  "verse_57": "Say you, 'I am on a shining proof from my Lord, and you belie it; I have not that with me for which you are hastening.' There is no order but of Allah. He explains the truth and He is the Best of judges.",
  "verse_58": "Say you 'If I had that thing for which you are hastening, then the affair would have been already ended between me and you. And Allah knows well the oppressors.",
  "verse_59": "And with Him are the keys of unseen, He only knows them And He knows whatever is in the land and in the sea. And the leaf that falls He knows it. And there is not any grain in the darkness of the earth, and nor anything wet and nor dry which is not written in a luminous Book.",
  "verse_60": "And He is the very Who takes hold of your souls by night and knows whatever you earn by day, then He raises you in the day so that the appointed term may be completed, then you have to return towards Him, then He will tell you what you used to do.",
  "verse_61": "And He is the Dominant over His bondmen, and He sends guardians over you; until when death comes to any of you, Our angels take his soul; and they do not fail.",
  "verse_62": "Then they are turned back towards their True Lord Allah. Do you hear? His is the order and He is the Quickest in taking account.",
  "verse_63": "Say you, 'Who is that Who delivers you from the calamities of the forest and sea, Whom you call upon in humility and secretly that if He saves us from this, then we shall certainly be grateful.",
  "verse_64": "Say you, 'Allah delivers you from this and from every distress, yet you associate partners with Him.",
  "verse_65": "Say you, 'He is Powerful to send torment on you from above you or from beneath your feet or He may make you to encounter by making different groups and to make you taste the severity of one another,' see, 'How We explain the signs in various ways haply they may understand.",
  "verse_66": "And your people belied it, and it is the truth. Say you, 'I am not an advocate over you.'",
  "verse_67": "For everything, there is a time fixed and soon you will come to know.",
  "verse_68": "And O listener! When you see those who plunge into Our signs, then turn away your face from them until they plunge into some other discourse and whenever the devil (Satan) may make you forget, then sit not you after recollection with the unjust people.",
  "verse_69": "And there is nothing on the righteous from their account, yes, but to admonish them, haply they may abstain.",
  "verse_70": "And leave those alone who have made their religion a mockery and plaything and the worldly life has deceived them and admonish with Quran, so that a soul may not be caught on account of its doings. It shall have no helper nor intercessor besides Allah. And if it gives every compensation for itself it shall not be accepted from it. These are they who have been caught on their doings. For them is a drink of boiling water and painful torment the recompense of their infidelity.",
  "verse_71": "Say you, 'shall we worship besides Allah that which neither does us any good nor does any harm, and shall we be turned back on our heels, after that Allah has shown us the way, like one whom the devil has made to forget his way in the earth, he is bewildered, (while) his companions are calling him towards the way that come to us? Say you, the guidance of only Allah is the guidance, and we are commanded to submit to Him only, Who is the Lord of all worlds.",
  "verse_72": "And this that establish prayer and fear Him and it is He towards Whom you are to rise.",
  "verse_73": "And it is He Who has made the heavens and earth rightly. And the Day when the destruction will occur, He will say to everything, 'Be' then it will become at once. His word is the truth. And His is the kingdom on the Day when the trumpet will be blown. He is the Knower of every secret and open and He is the Wise, the Aware.",
  "verse_74": "And remember when Abraham said to his father (i.e., father's brother), Azar, 'Do you take the idols for gods? Undoubtedly, I find you and your people in manifest error.'",
  "verse_75": "And thus We show Abraham all the kingdom of heavens and earth and in order that he might become of the convinced at sight.",
  "verse_76": "When the darkness of night came on him, he saw a star, said he, 'you take this as my Lord!' then when it set, said he, 'I do not like the setting ones.'",
  "verse_77": "Then when he saw the moon shining, said he, 'you tell this my Lord, then when it set, said he, 'If my Lord would not have guided me, I would also have been of the same who have gone astray.'",
  "verse_78": "Then when he saw the sun shining, said he, 'You say this my Lord! This is biggest of all, then when it set, said he, 'O people, 'I am quit of all those things which you associate with God.",
  "verse_79": "I diverted my face towards Him who have made the heavens and earth, being of Him only and I am not of the polytheists.'",
  "verse_80": "And his people began to dispute with him, said he, 'Do you dispute with me in respect of Allah? Then He has already told me the way, and I do not fear those that you tell as His associates, but yes if my Lord wishes anything. My Lord comprehends everything in His knowledge. Then, do you not accept the admonition?",
  "verse_81": "'And how should I fear those you associate and while you do not fear that you associated with Allah that for which He has not sent down to you any certificate: Then which of the two groups is more entitled for security, if you know?",
  "verse_82": "Those who have believed and mixed not any injustice with their faith, these are the people for whom there is security and they are the very who are guided.",
  "verse_83": "And this is Our argument that We gave to Ibrahim against his people, We raise in degrees Whom We please. Undoubtedly, your Lord is Wise, Knowing.",
  "verse_84": "And We gave him Ishaque and Yaqub, We showed the path to all of them and showed the path to Nuh before them, and of his progeny, to Daud and Sulaiman and Ayub and Yusuf and Musa and Haroorn, and thus We recompense the righteous.",
  "verse_85": "And to Zakaria (Zacharia) and Yahya (John) and Isa (Jesus) and llyas. These are all entitled to be Our near ones (righteous).",
  "verse_86": "And to Ismail and Yasa (Elisha) ane Yunus (Jonah) and Lot, and to each one We preferred above all in his time.",
  "verse_87": "And also to some of their fathers and their progeny and some of their brothers, and We chose them and showed them the straight path.",
  "verse_88": "This is the guidance of Allah. He gives whom He will of His bondmen, and if they would have committed polytheism, then surely all that they had already done would have been destroyed.",
  "verse_89": "These are they to whom We gave the Book and order and Prophet hood, then if these people reject it, then We have appointed for it such a people who is not the rejecters.",
  "verse_90": "These are they whom Allah has guided, then follow you their path. Say you, 'I ask you no wage for Quran, that is not but an admonition to the entire world.'",
  "verse_91": "And the Jews did not know the estimation of Allah as was necessary for. Him, when they said, 'Allah has not sent down anything on any man.' Say you, 'Who has sent down that Book which was brought by Moses, a light and a guidance for the people, of which you have made separate papers to show and much of it you conceal; and you are taught that which you knew not neither you nor your fathers. Say, 'Allah.' Then leave them playing in their absurdity.",
  "verse_92": "And this is a blessed Book that We have sent down confirming those Books which were before it and in order that you may warn the chief of all cities (Makkah) and to all those around it in the entire world. And those who believe in the Hereafter believe in this Book and guard their prayer.",
  "verse_93": "And who is more unjust than one who fabricates a lie against Allah or says, 'I have received a revelation', and nothing has been revealed to him and says, 'just now I send down the like of what Allah has sent down. And if you could see the unjust when they are in the agonies of death and the angels have stretched their hands; (saying) 'Yield up your souls', this day you will be awarded the punishment of disgrace for you used to forge lie against Allah and because you were big with pride against His signs.",
  "verse_94": "And undoubtedly, you have come to Us alone as We created you for the first time, and you have left behind your backs whatever wealth and effects We had given you; and We see not with you your intercessors of whom you asserted as your partners in your affairs, undoubtedly, the ties between you are cut off and gone is that from you who used to assert.",
  "verse_95": "Undoubtedly. Allah is the Cleaver of seed grain and date stone. He brings forth the living from the dead and is the Bringer forth of the dead from the living. This is Allah, where are you going back?",
  "verse_96": "He brings forth the dawn after cleaving the darkness and He has made the night for rest and the sun and moon as reckoning. This is the measurement of the Mighty, the Knowing.",
  "verse_97": "And it is He who has made the stars for you that you may get the way in the darkness of the Land and the sea. We have explained the signs in detail for people who know.",
  "verse_98": "And it is He who has produced you from a single soul, then you have to stay somewhere and to remain as repository at some other place. Undoubtedly, We have explained the signs in detail for a people of understanding.",
  "verse_99": "And it is He Who has sent down water from the heaven, then We brought forth everything of growth and out of it We brought forth the green (foliage) from which We bring forth clustered grains and out of the sheaths of palms the bunches close to one another, and gardens of grapes and olives and pomegranates, similar in some respect and dissimilar in some other respect. Look at its fruit when it bears fruit and its ripening. Undoubtedly, there is signs in it for the persons believing.",
  "verse_100": "And they have made jinns as associates of Allah whereas He created them and they devised for Him sons and daughters without any knowledge. Holy is He and exalted far above from their affairs.",
  "verse_101": "The Originator of the heavens and earth, from where He have a son whereas there is no woman for Him and He has created everything and He knows all things.",
  "verse_102": "This is Allah, your Lord, none is to be worshipped except Him, the Maker of everything, then worship Him, He is Guardian over everything.",
  "verse_103": "Eyes comprehend Him not and all eyes are under His comprehension and it is He Who is the Innermost, All-Knowing.",
  "verse_104": "There have come to you the eye opener arguments from your Lord, then whosoever saw it, then it is for his own good and whosoever became blind, then it is for his own bad; and I am not a guardian over you.",
  "verse_105": "And thus We variously explain the signs and because the infidels may say, 'you have studied' and that We may make it clear over the people who know.",
  "verse_106": "Follow you what has been revealed from your Lord to you, none is to be worshipped except He and turn your face from the polytheists.",
  "verse_107": "And had Allah willed, they would not have committed poly theism, and We made not you watcher over them, nor are you an advocate over them.",
  "verse_108": "And abuse not those whom they worship besides Allah because they will commit rudeness in respect of Allah through their excessiveness and ignorance. Thus We have made fair the deeds of every nation in their eyes, then they have to return back towards their Lord and He will tell them what they used to do.",
  "verse_109": "And they swore by Allah in their oath with utmost earnest that if there came to them any sign then they would surely believe therein. Say you, the signs are with Allah and what you know, that when they would come, then they will not believe therein.'",
  "verse_110": "And We turn about their hearts and their eyes, as they believed not therein at the first time and We leave them to wander about in their contumacy.",
  "verse_111": "And if we had sent down angels towards them and the dead had spoken to them and We had brought together all things before them, even then they would not believe but if Allah would have willed, but most of them are totally ignorant.",
  "verse_112": "And in like manner We have made for every Prophet an enemy, devils from among men and jinn, that in them one inspires the other secretly with fabricated discourse in order to deceive; and had your Lord wished, they would not have done so, then leave them on their fabrications.",
  "verse_113": "And because that the hearts of those who do not believe in the Hereafter may incline towards it, and that they may like it, and may earn sin what they are to earn.",
  "verse_114": "Then shall I seek the judgement of someone other than Allah, when it is He Who has sent down towards you the detailed Book? And those whom We have given the Book know that it is sent down by your Lord in truth; so O listener, be never then of the doubters.",
  "verse_115": "And complete is the Word of your Lord in veracity and justice. There is no one to change His words: and He is the Hearer, the Knower.",
  "verse_116": "And O listener! There are majority of those on earth that if you follow their saying, then they would mislead you from the way of Allah. They are only behind their imaginations and they are in mere conjecture.",
  "verse_117": "Your Lord knows well who has gone astray from His way, and He knows well the guided ones.",
  "verse_118": "Then eat of that on which the name of Allah has been pronounced, if you believe in His signs.",
  "verse_119": "And what happened to you that you should not eat out of that on which the name of Allah has been pronounced. He has explained to you in detail what is forbidden to you, but when you be compelled to it? And undoubtedly, many mislead by their own desires without knowing. Undoubtedly, your Lord knows well the transgressors.",
  "verse_120": "And leave the apparent and secret sins. Those who earn sin, soon they will get punishment of their earning.",
  "verse_121": "And eat not that over which the name of Allah has not been pronounced for undoubtedly that is disobedience. And surely the devils inspire their friends that they may quarrel with you, and if you obey them, then at that time you are polytheists.",
  "verse_122": "And will he who was dead, then We gave him life, and made for him a light by which he walks among mankind, become like that who is in darkness from which he is not to come out? Thus, in the eyes of infidels their deeds have been made fair-looking.",
  "verse_123": "And thus We made in each town the leaders of the guilty, so that they may plot therein. And they plot not but against their own souls, and they perceive not.",
  "verse_124": "And when any sign comes to them, then they say, 'We shall never believe unless 'we receive the like of what has been given to the Messengers of Allah. Allah knows well where to place His Messenger ship. Soon the guilty people will receive humiliation before Allah and severe torment for their plotting.",
  "verse_125": "And whomsoever Allah wishes to show the way, He opens his breast for Islam, and whosoever wishes to lose his way, He makes his breast narrow, straitened well as if he is climbing up into the sky forced by someone else. And thus Allah inflicts punishment on those who believe not.",
  "verse_126": "And this is the straight path of your Lord. We have explained the signs in detail for the people accepting admonition.",
  "verse_127": "For them is the home of safety with their Lord, and He is their Protector, this is the fruit of their doings.",
  "verse_128": "And the Day He will raise all of them and will say, \"O company of Jinn! You have gathered many men,\" and their allies among men will say. 'O our Lord! We made use of one another and we have reached the term You had determined for us.' He will say, 'Fire is your abode, abide therein forever but as Allah will.' O beloved Prophet! Undoubtedly your Lord is Wise, Knowing.",
  "verse_129": "And thus We set over one against the other among the unjust for what they have done.",
  "verse_130": "O company of Jinn and men! Did not Messengers come to you from amongst yourselves reciting My signs to you, and warning you of seeing this day of yours. They will say, 'We bore witness against our souls.' and the worldly life deceived them and will themselves bear witness against their souls that they were infidels.",
  "verse_131": "This is so because your Lord destroys not the towns unjustly while their people are unaware.",
  "verse_132": "And for every one there are degrees in accordance with their deeds. And your Lord is not unaware of their actions.",
  "verse_133": "And O beloved Prophet! Your Lord is Self Sufficient, Merciful. O mankind! If He please, He may take you away, and bring some other whom He will in your place, just as He created you from the offspring’s of other people.",
  "verse_134": "Undoubtedly, what is promised to you is sure to come and you cannot get it tired.",
  "verse_135": "Say you. 'O my people! Go on acting in your places. I do my work, then now you wish to know for whom remains the ultimate abode. Undoubtedly, the unjust get not the welfare.",
  "verse_136": "And whatever tilth and cattle Allah has produced they made Him a sharer in them, then said, 'this is for Allah according to their fancies, and this is for our associates. ‘Then that which is of their associates does not reach God and that which is for God reaches their associates. What an evil judgement they assign?",
  "verse_137": "And thus their associates have made fair-seeming the killing of offspring in the eyes of many polytheists, so that they may ruin them and may confuse them in their religion. And had Allah willed, they would not have done so, then you leave them, they are with their fabrications.",
  "verse_138": "And they said, 'this cattle and tilth are taboo, only those can eat them whom We please with their false notions, and there are some cattle over which riding is forbidden, and some cattle over which they do not pronounce the name of Allah at the time of slaughtering, this all is to assert lie against Allah. Soon He shall recompense them for their fabrications.",
  "verse_139": "And they said, 'what is within the bellies of those cattle solely belongs to our males and is forbidden to our women, and if it be born dead, then they all are partners therein. Soon Allah will recompense them for their such actions. Undoubtedly He is Wise, Knowing.",
  "verse_140": "Undoubtedly, those who kill their offspring by their foolish ignorance and make unlawful what Allah has provided for them, forging a lie against Allah are ruined. Undoubtedly, they have strayed and have not got the way.",
  "verse_141": "And it is He Who has produced gardens, trellised and some un-trellised, and date palms and tilth in which are various kinds of food and olives and pomegranates similar in some respect and dissimilar in some other respects. Eat of their fruits when bear fruits and pay due thereof on the day of harvesting, and spend not wastefully. Undoubtedly, those who spend wastefully are not liked by Him.",
  "verse_142": "And of the cattle some are for carrying burden and some lying on earth. Eat of what Allah has provided for you and do not follow the foot-steps of the devil (Satan). Undoubtedly, he is your open enemy.",
  "verse_143": "Eight males and females, one pair of sheep and one pair of goat; say you, 'has He made both males unlawful and both females or that which the wombs of two females contain? Inform by any knowledge, if you are truthful.",
  "verse_144": "And a pair of camel and a pair of cow; say you, “has He made both males unlawful or both females or that which the wombs of both females contain?\" Were you present when Allah gave you this order, then who is more unjust than one who forges lie against Allah, that he may misguide the people with his ignorance. Undoubtedly, Allah does not show the path to the unjust.",
  "verse_145": "Say you, 'I find not in what has been revealed to me any meal forbidden to any eater, but that it be a dead body, or flowing blood of veins or the flesh of a vile animal (swine) for that is foul or an animal of disobedience in slaughtering of which the name other than God has been pronounced, then whoso is driven by necessity neither willing himself nor exceeding beyond the necessity, then undoubtedly. Allah is Forgiving, Merciful.",
  "verse_146": "And to the Jews We forbade every animal having hoofs, and the fat of cow and goat We forbade them but what is carried by their backs or intestines or what is attached to their bones. We recompensed them for their contumacy, and undoubtedly, We are surely the Truthful.",
  "verse_147": "Again if they belie you say you, 'your Lord is of extensive mercy and His torment is not turned aside from the guilty people.'",
  "verse_148": "Now the polytheists will say, 'if Allah has willed, we would not have committed polytheism neither our forefathers, nor had We forbidden anything.' In the same manner belied those who were before them until they tasted our torment. Say you, 'Have you any knowledge that you bring it forth to us? You are only behind your conjecture and for nothing you estimate.",
  "verse_149": "Say you, 'Then the argument of Allah is conclusive, so if He had wished, then. He would have guided you all.'",
  "verse_150": "Say you, 'Bring your those witnesses who testify that Allah has forbidden this', 'then if they testify, then you O listener! Bear not witness with them, and follow not the desires of those who belie Our signs, and who believe not in the Hereafter, and they ascribe equals to their Lord.",
  "verse_151": "Say you, 'Come I will rehearse to you what your Lord has forbidden to you, 'that you associate not anyone with Him, and that you do good to parents, and that you kill not your children because of poverty. We shall provide for you and for them, and that you approach not shameful deeds whichever in them is open and whichever is hidden; and slay not unjustly the life which Allah has made sacred. This He has ordered you that you may understand.",
  "verse_152": "And do not approach the property of the orphans but in the best way, until he reaches the maturity and fill up the measure and weight with justice. We burden no soul but to its capacity, and when you speak, then say just, even though it be a matter of your relative, and fulfil the covenant of Allah. This He has enjoined you strictly that haply you may accept admonition.",
  "verse_153": "And that, this is My straight path, then follow it and follow no other paths for they will deviate you from His path. This He has ordered you that haply you may be self-restrained.",
  "verse_154": "Again We gave the Book to Moses for doing full favor upon him who is righteous, and the details of everything, and a guidance and mercy that haply they may believe in the meeting of their Lord.",
  "verse_155": "And this blessed Book We have sent down, follow it then and be self-restrained, so that you may receive mercy.",
  "verse_156": "Lest you should say, the book was sent down to the two peoples before us, and we were unaware of their reading and teaching.'",
  "verse_157": "Or lest you should say, 'If the Book had been sent down to us, then we would have been better guided than they.' So there has come to you a luminous argument from your Lord, and a guidance, and a mercy. Who is then more unjust than he who belies the signs of Allah and turns his face from them. Soon We shall punish those with great torment who turn away their faces from Our signs, the recompense of turning away their faces.",
  "verse_158": "What they are waiting for, but for this that the angels should come to them, or that the torment of your Lord should come, or that a sign of your Lord will come? The day when that one sign of your Lord will come, believing will not profit any soul that did not believe before or had not earned any good in its belief. Then say you, 'wait, we also wait.'",
  "verse_159": "Those who have created separate paths in their religion and have become many sects, O beloved Prophet! You have no concern at all with them. Their affair is with Allah only, then He will inform them what they used to do.",
  "verse_160": "Whoso brings one good, then for him there are ten like thereof, and whoso brings an evil, shall not be recompensed but to its equal and they shall not be wronged.",
  "verse_161": "Say you, 'Undoubtedly, my Lord has shown me the straight path, a right religion, the creed of Ibrahim who was aloof from every falsehood and was not a polytheist.'",
  "verse_162": "Say you, 'Undoubtedly, my prayer, and my sacrifices, and my living and my dying are all for Allah, Who is the Lord of all the worlds.'",
  "verse_163": "No one is associated to Him, so I have been commanded, and I am the first Muslim.",
  "verse_164": "Say you, 'Shall I seek a Lord other than Allah, while He is the Lord of everything.' And whatever one earns it is on his own account. And no bearer of burden will bear the burden of another. Then you have to return towards your Lord, He will inform you of that in which you used to differ.",
  "verse_165": "And He it is Who has made you vicegerents in the earth and has raised one over the other in degrees among you that He may try you in what He has given you. Undoubtedly, your Lord is not late in tormenting, and undoubtedly, He is necessarily Forgiving, Merciful."  },
    "count": 165
}
