{
    "name": "al-Jumu'ah",
    "index": "062",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Whatever is in the heavens and whatever is in the earth glorifies Allah, the Sovereign, the Most Holy, the Esteemed One, the Wise.",
        "verse_2": "It is He Who sent among the unlettered people a Messenger from among themselves, who recites to them His signs and purifies them and bestows them the knowledge of the Book and wisdom, although they had been necessarily in manifest error before that.",
        "verse_3": "And purifies and teaches others among them who have not met to those formers. And He is the Esteemed One, the Wise.",
        "verse_4": "This is the grace of Allah; He bestows it to whomsoever He pleases. And Allah is the Owner of immense grace.",
        "verse_5": "The example of those who were put up with Tourat, then they did not follow its mandate is like an ass carrying books on back. What an evil example is of those who belied the signs of Allah. And Allah guides not the people unjust.",
        "verse_6": "Say you, 'O Jews! If you imagine that you are the friends of Allah to the exclusion of others, then long for death, if you are truthful'?",
        "verse_7": "But they will never long for it, because of the deeds which their hands have already sent forward. And Allah know the unjust people.",
        "verse_8": "Say you, 'the death from which you flee is certainly going to meet you, then will you be returned to Him Who knows everything hidden and open and He will inform you as to what you had done.",
        "verse_9": "O believers! When the call is made for the prayer on Friday, hasten towards the remembrance of Allah and leave business. This is better for you if you know.",
        "verse_10": "Then, when the prayer is finished, disperse in the land and seek grace of Allah and remember Allah much; haply you may prosper.",
        "verse_11": "And when they saw any trade or sports, they dispersed towards it and left you standing while addressing. Say, you, 'that which is with Allah is better than sport and trade. And the provision of Allah is Best."
    },
    "count": 11
}
