{
    "name": "al-Mu'min",
    "index": "040",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
       "verse_1": "HA—MIM.",
  "verse_2": "The sending down of this Book is from Allah, the Honorable, the Knowing.",
  "verse_3": "The Forgiver of sins, Accepter of penitence, Severe in torment, Possessor of plenty rewards. There is no God besides Him. Towards Him is the return.",
  "verse_4": "None disputes about the signs of Allah but the infidels. Let not then, O listener, their swaggering about in the cities deceive you.",
  "verse_5": "Before them, the people of Nuh and other groups after them belied, and every nation aimed that they may seize their Messenger, and disputed with false arguments that they may relent the truth, so I seized them. How then was My torment?",
  "verse_6": "And thus the Word of your Lord has been proved against the infidels that they are the inmates of the Fire.",
  "verse_7": "Those who bear the Throne and those around it sanctify their Lord with praise and believe in Him and beg forgiveness for the Muslims, 'O our Lord! You comprehend everything in mercy and knowledge, so forgive those who repented and followed Your way and save them from the torment of Hell!",
  "verse_8": "'O our Lord! And admit them into gardens of habitation which you have promised them, as well as those who are righteous of their fathers and wives and children. Undoubtedly, You are the Honorable, the Wise.'",
  "verse_9": "'And save them from the adversity of sins, and whomsoever You save from the adversity of sins that day, then no doubt, You have shown mercy upon him. And this is the great triumph!'",
  "verse_10": "Undoubtedly, those who dis-believed shall be informed that of course the aversion of Allah to you is greater than your own aversion to yourselves today, when you were called towards the faith then you disbelieved.",
  "verse_11": "They shall say, 'O our Lord, You have caused us to die twice and have given us life twice, now we confess our sins. Is there than any way of getting out of the Fire?'",
  "verse_12": "This happened because when only one Allah was proclaimed, you disbelieved, but when partners were associated to Him, you believed. Therefore the command is for Allah, Who is the Highest, the Greatest.",
  "verse_13": "It is He Who shows you His signs and sends down for you provision from the sky. And none receives admonition but he who repents.",
  "verse_14": "Therefore serve only Allah devoted purely to Him even though the infidels may take it as bad.",
  "verse_15": "The Bestower of high remarks; Possessor of the Throne, He casts the spirit of faith (the revelation) by His Command upon whomsoever He will of His bondmen, that he may warn of the Day of meeting.",
  "verse_16": "The day when they will fully appear; nothing of theirs shall be hidden from Allah. Whose is the Kingdom today? Of One Allah, All- Dominant.",
  "verse_17": "Today, every soul shall be recompensed of its earnings, there is no injustice to anyone today. Undoubtedly Allah is Swift in reckoning.",
  "verse_18": "And warn them of that Approaching Day of Calamity when the hearts will reach the throats full of grief. The unjust shall have no friend nor any intercessor whose request may be acceded to.",
  "verse_19": "Allah knows the treacherous eyes and what is concealed in the breasts.",
  "verse_20": "And Allah decides with truth. But those whom they worship besides Him decide nothing. Undoubtedly Allah is All-Hearing, the All-Seeing.",
  "verse_21": "Have they not travelled in the earth, so that they may see how has been the end of those before them? They were greater than them in strength and in marks they left in the earth; Yet Allah seized them for their sins. And there was none to save them from Allah.",
  "verse_22": "This because their Messengers came to them with bright signs, but they disbelieved, so Allah seized them. Undoubtedly Allah is Mighty, Severe in punishment.",
  "verse_23": "And undoubtedly, We sent Musa with Our signs and a clear testimony.",
  "verse_24": "To Firawn (Pharaoh) and Haman and Qaroon (Korah) but they said, 'He is a magician, a great liar'.",
  "verse_25": "Then when he brought to them the truth from Us, they said, 'slay the sons of those who believed with him and let their women alive'. And the plot of the infidels is nothing but going astray.",
  "verse_26": "And Firawn said, 'leave me that I may kill Musa and let him call his Lord. I fear lest he should change your religion or he may cause to appear disorder in the earth'.",
  "verse_27": "And Musa said, ‘I take refuge with my Lord and your Lord from every arrogant who believes not in the Day of Reckoning.",
  "verse_28": "And a Muslim from amongst the people of Firawn who used to hide his faith said, 'Do you slay a man because he says, 'my Lord is Allah', and undoubtedly he has brought you bright signs from your Lord?' And if he says wrong, then the curse of his lie is upon him; but if he is truthful, then some of that which he promises you with shall befall you. Undoubtedly Allah gives not the way to him who is transgressor and a big liar.",
  "verse_29": "'O my people, 'yours is the kingdom today, you have dominance in this land. But who will save us from the torment of Allah if it comes upon us?' Firawn said, 'I show you only that which I see and I tell you only that which is the way of goodness'.",
  "verse_30": "And the believer said, 'O my people, I fear for you a day like the day of former groups.",
  "verse_31": "As had to face the people of Nooh and Aad and Samud and those after them. And Allah wishes not injustice for His bondmen.",
  "verse_32": "'And O my people', I fear for you the Day of Calling and Crying.",
  "verse_33": "'A day when you shall flee turning your backs, there shall be none to save you from Allah; and he whom Allah sends astray, for him there is no guide.'",
  "verse_34": "And undoubtedly Yusuf came to you before this with bright signs, but you remained in doubt about that which he brought to you, until he died, and you said, 'never shall Allah send any Messenger after him. Thus Allah sends astray him who is extravagant, and a doubter.",
  "verse_35": "Those who dispute concerning the signs of Allah without any authority having come to them. It is greatly hateful in the sight of Allah and in the sight of the believers. Thus Allah seals up the heart of every proud and contumacious person.",
  "verse_36": "And Firawn said, 'O Hamman', build for me a lofty palace that I may reach the ways.",
  "verse_37": "(Which ways) the ways of the heavens, so that I may peep at the God of Musa and undoubtedly, I think that he is a liar. And thus his evil deed made to look fair in the eyes of Firawn and he was barred from the way. And the plot of Firawn was to be ruined only.",
  "verse_38": "And the man who believed said, 'O my people', follow me, I will guide you to the good way.",
  "verse_39": "'O my people, the life of this world is only a temporary enjoyment, and the Hereafter is certainly the home for permanent residence.",
  "verse_40": "'Whoso does an evil deed, shall be recompensed only with the like of it and whoso does good work whether male or female and be a Muslim, then they shall enter the Paradise and they shall be provided therein without count.",
  "verse_41": "'And O my people, what happened to me that I call you towards deliverance while you call me towards the Fire.",
  "verse_42": "'You call me towards this that I should disbelieve in Allah and associate with Him that of which I have no knowledge, while I invite you towards the Honorable, the Great Forgiver.",
  "verse_43": "'It is proved itself that to which you call me, is of no use anywhere neither in the world nor in the Hereafter; and that our return is towards Allah and that the transgressors, they are the inmates of the Fire.",
  "verse_44": "So soon the time comes that you shall remember what I am saying to you. And I entrust my affairs to Allah. Undoubtedly Allah sees all His bondmen.",
  "verse_45": "Then Allah saved him from the evils of their plot and an evil torment surrounded the people of Firawn.",
  "verse_46": "The Fire, they are exposed thereto morning and evening, and the day when the Hour shall come, it shall be ordered, cause the people of Firawn to enter the most grievous torment.",
  "verse_47": "And when they will dispute with one another in the Fire, then the weak shall say to those who waxed proud, 'We were your followers, will you then get any portion of the Fire curtailed from.",
  "verse_48": "Those who waxed proud said, 'we are all in the Fire. Undoubtedly, Allah has already judged between His bondmen.'",
  "verse_49": "And those in the Fire shall say to the guards of the Hell, 'Pray to your Lord that He may lighten for us a day of torment.'",
  "verse_50": "They said, 'Did not your Messengers use to bring you bright signs?' They said, 'why not', they said, 'then you yourselves pray'. And the praying of the infidels is not but in wandering.",
  "verse_51": "No doubt, We shall certainly help Our Messengers and the believers in the life of the world and on the day witnesses shall stand forth.",
  "verse_52": "The day when to the unjust people their excuses will not profit, and for them is the curse and for them is the evil abode.",
  "verse_53": "And undoubtedly, We bestowed guidance to Musa and made the children of Israel the inheritors of the Book.",
  "verse_54": "A guidance and admonition for the men of understanding.",
  "verse_55": "Therefore O beloved, 'be patient, no doubt, the promise of Allah is true and beg forgiveness for the sins of your owns, and celebrate Sanctity of your Lord praising Him morning and evening.",
  "verse_56": "Those who dispute concerning the signs of Allah without any authority they may have got, there is nothing in their hearts but an ambition of greatness which they shall not reach, so seek you refuge in Allah. Undoubtedly, He sees, hears.",
  "verse_57": "Of course the creation of the heavens and the earth is greater than the creation of mankind, but most of the people know not.",
  "verse_58": "And the blind and the seeing are not equal, and neither those who have believed and have done good equal to the evil doers. How little do you reflect?",
  "verse_59": "Undoubtedly, the Hour is certainly to come, there is no doubt in it, but most people believe not.",
  "verse_60": "And your Lord said, 'Pray to Me, I shall acknowledge your call. Undoubtedly, those who are too proud to worship Me, soon will enter the Hell despised.",
  "verse_61": "Allah is He Who made for you night that you may get rest in it and made the day enabling you to see; undoubtedly, Allah is Gracious to mankind but most men are ungrateful.",
  "verse_62": "That is Allah, your Lord the Creator of everything. None is to be worshipped save He. So whither are you straying away?",
  "verse_63": "Thus stray away those who reject the signs of Allah.",
  "verse_64": "Allah is He Who made the earth for you a resting place and the heaven as a roof and shaped you, then made your shapes nice and provided you with good things. This is Allah your Lord. So Blessed is Allah, the Lord of the entire world.",
  "verse_65": "He is Ever-Living none is to be worshipped save He, so worship Him being devoted purely to Him. All praise is to Allah, the Lord of the worlds.",
  "verse_66": "Say you, 'I have been forbidden to worship those whom you worship besides Allah since clear signs have come to me from my Lord and I have been commanded to submit myself to the Lord of the worlds.",
  "verse_67": "He it is Who made you from dust, then from sperm drop, then from a clot of blood, then He brings you forth as an infant, then He causes you to live so that you may attain to your maturity, then that you may become old; and some of you are caused to die before and that you may reach to an appointed promise and that you may learn.",
  "verse_68": "It is He Who gives life and causes death; and when He decrees a thing, He says to it only, 'Be', hence it becomes.",
  "verse_69": "Have you not seen those who dispute in the signs of Allah? Whither are they turned away?",
  "verse_70": "Those who belied the Book and that with which We sent Our Messengers; soon they shall know.",
  "verse_71": "When the iron collars shall be around their necks and chains too, they shall be dragged;",
  "verse_72": "Into the boiling water, then they shall be burnt in the Fire.",
  "verse_73": "Then it will be said to them, 'where went those whom you used to associate.",
  "verse_74": "'Against Allah.' They will say, 'they are lost away from us, but rather we never worshipped anything before. Thus Allah leads astray the infidels.",
  "verse_75": "This is because you rejoiced in the earth without right and because you behaved boastfully.",
  "verse_76": "Enter the gates of Hell to remain therein forever, and what an evil abode of the proud!",
  "verse_77": "So be you patient, no doubt, the promise of Allah is true, then whether We let you see something of what We promise them or We cause you to die before, in any case they are to return to Us.",
  "verse_78": "And undoubtedly, We sent many Messengers before you, of them, there are some whose story We have narrated to you, and there are some whose story We have not narrated to you, and it is not for any Messenger that he should bring any sign without Allah's permission, but when the command of Allah will come, the matter shall be decided with truth, and then the men of falsehood shall lose there.",
  "verse_79": "Allah is He Who made for you the cattle that you may ride on some of them and some of them you may eat.",
  "verse_80": "And there are many benefits for you in them and that you may attain to the desires of your hearts on their backs; and on them and on boats you ride.",
  "verse_81": "And He shows you His signs, then which of the signs of Allah will you deny?",
  "verse_82": "Have they not travelled in the earth that they may behold how has been the end of those before them? They were more numerous than these and stronger in might and the traces in the earth, but what did they avail of that which they earned.",
  "verse_83": "So when their Messengers brought then them clear arguments, then they remained joyous in the worldly knowledge which they had and what they mocked at recoiled on them.",
  "verse_84": "Then when they saw Our torment said, 'We believe in only one Allah and we deny all that which we used to associate with Him.'",
  "verse_85": "But their belief was of no use to them when they had seen Our torment. This is Allah's law which has been in regard to His bondmen. And the infidels remained in loss there."
 },
    "count": 85
}
