{
    "name": "az-Zumar",
    "index": "039",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
      "verse_1": "The sending down of the Book is from Allah, the Dignified, the Wise.",
    "verse_2": "Undoubtedly, We have sent down this Book to you with truth, therefore worship Allah being purely His devotee.",
    "verse_3": "Yes, the sincere exclusive devotion is to Allah only. And those who have taken for protectors other than Allah say, 'we worship them only so that they may bring us nearer to Allah'. Allah will decide among them concerning that wherein they are differing. Undoubtedly, Allah guides not him who is a great ungrateful liar.",
    "verse_4": "If Allah had willed to take a son for Himself, He would have chosen whom He had pleased out of His creation, Sanctity is to Him. He is Allah, the One, the All Dominant.",
    "verse_5": "He made the heavens and the earth with truth. He rolls the night around the day and He rolls the day around the night and He has employed the sun and the moon into service. Each moves to an appointed term. Do you hear? He is the Dignified, the Forgiving.",
    "verse_6": "He has made you of a single soul, then He made its mate from that and sent down for you eight pairs of cattle. He makes you in the wombs of your mothers, first in one pattern then in another, in three fold darkness. This is Allah your Lord, His is the kingdom. None is to be worshipped besides Him, then where are you turning away?",
    "verse_7": "If you be ungrateful, then undoubtedly, Allah is Independent of you, and He likes not the ungratefulness of His bondmen; but if you be thankful, then He likes it for you. And no soul bearing burden will bear the burden of another. Then you are to return to your Lord, and He shall inform you of what you used to do. Surely He knows the secrets of the hearts.",
    "verse_8": "And when any trouble touches man, he calls upon his Lord leaning towards Him, then when Allah grants him any favor from Himself, he forgets what he called for before and begins to assign peers to Allah so that he may lead astray from His way. Say you, 'carry on a little with your infidelity, undoubtedly, you are among the men of the Hell.'",
    "verse_9": "Will he who passes the hours of the night in devoted obedience, prostrating and standing fearing the Hereafter and hoping for the mercy of His Lord (be like disobedient)? Say you, 'Are those who know equal to those who know not'? Only those who are endued with understanding receive admonition.",
    "verse_10": "Say, 'O My Bondmen who believed, fear your Lord. There is good, in this world, for those who have done good. And Allah's earth is spacious. The steadfast shall only be fully rewarded without measure.'",
    "verse_11": "Say you, 'I have been commanded to worship Allah being purely His devotee.",
    "verse_12": "And I have been commanded to submit first'.",
    "verse_13": "Say you, 'suppose if I may commit disobedience, then I too fear the torment of a great day from my Lord.'",
    "verse_14": "Say you, ‘I worship Allah only being purely His devotee.",
    "verse_15": "'Worship you what you like besides Him'. Say you, 'complete loss is for those who have lost their own souls and their households on the Day of Judgement. Yes, that is indeed an evident loss'.",
    "verse_16": "There are mountains of fire over them and beneath them mountains. With this Allah warns His bondmen? O My bondmen! Fear you Me'.",
    "verse_17": "And those who saved themselves from worshipping idols and turned towards Allah in repentance, for them are glad tidings. So give glad tidings to My those bondmen.",
    "verse_18": "Who listen to the word attentively and follow the best thereof. It is they whom Allah has guided and it is they who possess wisdom.",
    "verse_19": "Will he then against whom the sentence of torment is decreed be equal to those who are delivered? Will you then rescue one deserving fire from your guidance?",
    "verse_20": "But those who fear their Lord, for them are lofty chambers, built over them lofty chambers, beneath which rivers flow. The promise of Allah, Allah breaks not His promise.",
    "verse_21": "Have you not seen that Allah has sent down water from the sky and then made springs in the earth thereof, then He causes to grow therewith crops of diverse colours, thereafter it dries up and see you that it turns yellow, then He breaks it into small pieces? Undoubtedly, in it is a reminder for men of understanding.",
    "verse_22": "Will he whose heart Allah has opened for Islam so that he is upon a light from his Lord be like him who is hard-hearted? Woe, then, is to those whose hearts are hardened from the remembrance of Allah. They are in evident error.",
    "verse_23": "Allah has sent the best Book that from beginning to the end is alike (in beauty and fairness), having twofold descriptions (promise of reward and threat of punishment) at which do shudder the skins of those who fear their Lord, then their skins and hearts soften inclining towards the remembrance of God. This is the guidance of Allah. He guides there with whom He pleases. And he whom Allah causes to go astray, there is none to guide him.",
    "verse_24": "Will he, then, who will make his face a shield for the great torment on the Day of Resurrection be like him who has been delivered? And it will be said to the oppressors,' taste your earnings.'",
    "verse_25": "Those before them belied, so torment came upon them whence they knew not.",
    "verse_26": "Therefore Allah made them taste humiliation in the life of the world and the torment of the Hereafter is the greatest. What a good thing it would have been if they knew.",
    "verse_27": "And undoubtedly, We have narrated in this Quran all types of examples for the people in order that they may take heed.",
    "verse_28": "The Quran in Arabic language wherein there is no crookedness in order that they may fear.",
    "verse_29": "Allah sets an example, a servant belonging to several rude masters and one belonging solely to one master. Are they both equal in condition? All praise to Allah, but most of them know not.",
    "verse_30": "Undoubtedly, you are to depart, and they are too to die.",
    "verse_31": "Then on the Day of Resurrection you will dispute before your Lord.",
    "verse_32": "Who is then more unjust than he who fabricates a lie against Allah and belies the truth when it comes to him? Is there not an abode in the Hell for the infidels?",
    "verse_33": "And he who has come with truth and those who confirmed it, they are the God-fearing.",
    "verse_34": "For them is what they desire with their Lord. This is the reward of the righteous.",
    "verse_35": "So that Allah may remove from them the worst that they did and recompense them with their reward for the best of their actions that they used to do.",
    "verse_36": "Is Allah not Sufficient for His bondmen? And they frighten you with those besides Him. And whom Allah lets astray, for him there is no guide.",
    "verse_37": "And whom Allah guides, for him there is none to mislead. Is not Allah the Honorable, the Master of Retribution?",
    "verse_38": "And if you ask them who created the heavens and the earth, they will then necessarily say, 'Allah'. Say you, 'tell me then that those whom you worship besides Allah, if Allah desired any affliction for me shall they then remove His affliction? Or if he desires mercy for me, could they with-hold His mercy? Say you, 'Allah is enough for me', in Him the trusting one put their trust.'",
    "verse_39": "Say you, 'O my people', continue acting in your own way, I do my work, soon you will come to know.",
    "verse_40": "On whom comes a torment that will humiliate him and on whom descends a torment that will abide?",
    "verse_41": "Undoubtedly, We have sent down upon you the Book for the guidance of mankind with truth. Then whosoever got the way that is for his own good and whoso went astray, he went astray for his own loss. And you are not responsible for them.",
    "verse_42": "Allah takes away the souls at the time of their death and of those who die not, during their sleep, then He withholds that against which He has decreed death and sends back the other till and appointed time. Undoubtedly in it are signs for those who reflect.",
    "verse_43": "Have they taken some intercessors besi6des Allah? Say you, what! 'Even though they own nothing, nor they do understand'.",
    "verse_44": "Say you, 'all intercession belongs to Allah'. 'For Him is the Kingdom of the heavens and the earth, then you are to return to Him'.",
    "verse_45": "And when Allah alone is mentioned, the hearts of those who believe not in the Hereafter shrink, and when those besides Him are mentioned, henceforth they rejoice.",
    "verse_46": "Submit you, 'O Allah, the Creator of the heavens and the earth, Knower of the hidden and the open, You alone will decide between Your bondmen concerning that in which they used to differ.'",
    "verse_47": "If the wrongdoers had all that is in the earth and the like thereof in addition to it, they would have offered all of it as ransom from the evil torment on the Day of Judgement. But there appeared to them from Allah that which they never thought of.",
    "verse_48": "And their own earned evils became apparent to them and they were encircled by that which they used to mock at.",
    "verse_49": "And when any trouble touches man, he calls on Us, then when We grant him any favor from Us, he says, 'I have got it because of a certain knowledge.' Nay! it is only a trial, but most of them know not.",
    "verse_50": "So have said those who were before them, but all that they had earned did not avail them.",
    "verse_51": "So the evils of their earnings overtook them, and those who are unjust among them, they too shall be overtaken by the evils of their earnings and they cannot go out of control.",
    "verse_52": "Do they not know that Allah enlarges the provision for whomsoever He likes and restricts it for whomsoever He likes? Undoubtedly, in it are signs for the believers.",
    "verse_53": "Say you, 'O My bondmen who have committed excesses against their own souls! Despair not of the mercy of Allah. Undoubtedly, Allah forgives all sins, Verily He is the Forgiving, the Merciful.",
    "verse_54": "And turn towards your Lord and submit yourselves to Him, before there comes to you the torment and then you may not be helped.",
    "verse_55": "And follow the best which has been sent to you from your Lord, before the torment overtakes you suddenly when you know not.",
    "verse_56": "Lest a soul should say, 'Ah,alas on the errors which I committed regarding Allah, and undoubtedly I used to scoff.'",
    "verse_57": "Or it should say, 'Had Allah guided me I would have been among those who are fearful.'",
    "verse_58": "Or it should say, 'when it sees the torment, had there been a return for me that I would have been doing good'.",
    "verse_59": "Yes, why not, undoubtedly, My signs came to you but you belied them and waxed proud and you were infidel.",
    "verse_60": "And on the Day of Judgement, you will see those who fabricated lie against Allah that their faces are black. Is there not in Hell an abode for the proud?",
    "verse_61": "And Allah will save them who fear Him to their place of deliverance. Torment shall not touch them nor shall they grieve.",
    "verse_62": "Allah is the Creator of everything and He has authority over everything.",
    "verse_63": "For Him are the keys of the heavens and the earth. And those who rejected the signs of Allah, they are the people who are in loss.",
    "verse_64": "Say, you, 'Do you then say to me to worship other than Allah, O you ignorants.'",
    "verse_65": "And undoubtedly, it has been revealed to you, and to those before you that O listener! if you associate other gods with Allah, then surely, your all actions shall go vain and you shall necessarily remain in loss.",
    "verse_66": "Nay, but worship Allah and be among the grateful.",
    "verse_67": "And they esteemed not Allah as was due to Him and He will roll up the entire earth on the Day of Judgement and all the heavens shall be rolled up by His Authority. And He is Sanctified and Exalted from their association.",
    "verse_68": "And the Trumpet shall be blown, then whoever is in the heavens and whoever is in the earth will swoon but whom Allah wills, then it shall be blown for the second time, henceforth they shall stand looking on.",
    "verse_69": "And the earth shall glitter with the light of her Lord and the Book will be laid and the Prophets shall be brought and witnesses too (this Prophet and his followers will be witnesses against them), and true judgement will be given between them and they shall not be treated unjustly.",
    "verse_70": "And every soul shall be paid in full for their doings and He knows well what they used to do.",
    "verse_71": "And the infidels shall be driven towards Hell in troops. Until when they shall reach it, its gates will be opened and its warders will say to them, 'Did not come to you from amongst you the Messengers who recited to you verses of your Lord and warned you of the meeting of this Day of yours?' They will say, 'Why not', but the word of torment has been justified on the infidels.",
    "verse_72": "It shall be said to them, ‘Enter the gates of Hell to abide therein; then what an evil destination of the proud.",
    "verse_73": "And those who feared their Lord, their carriages shall be escorted to Heaven in troops. Until when they shall reach there, and its gates shall be opened and its warders will say to them, 'peace be upon you, excellent were you, so enter the paradise to abide forever'.",
    "verse_74": "And they will say, 'all praise to Allah, Who has made good His promise to us, and made us inherit this land, so that we may dwell in the paradise wherever we please; then what an excellent reward of the workers.",
    "verse_75": "And you will see the angels surrounding the Throne on all sides sanctifying their Lord with His praise; and true judgement will be pronounced between them and it will be said, 'All praise to Allah, the Lord of the entire world.'"
   },
    "count": 75
}
