{
    "name": "al-Jinn",
    "index": "072",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Say you, 'it has been revealed to me that some of Jinn listened to my recitation attentively and said, 'we have heard a wonderful Quran.",
        "verse_2": "'That guides towards righteousness, so we have believed in it, and we shall never association anyone with our Lord.",
        "verse_3": "'And that the majesty of our Lord is exalted high. He has neither taken a woman nor a child.",
        "verse_4": "'And that the fool among us used to utter extravagant words against Allah.",
        "verse_5": "And that we thought that neither men nor Jinn would ever fabricate a lie against Allah.",
        "verse_6": "And that some individuals from among the men used to seek protection of some men from among the Jinn and they thus increased them in their pride.",
        "verse_7": "And that they imagined just as you have imagined, that Allah would never raise any Messenger.",
        "verse_8": "And that we touched the heaven then we found it filled with strong guards and sparks of fire.",
        "verse_9": "And that we used to sit on some seats to listen in the first heaven, but whoso now listens finds a flame of fire in wait for him.",
        "verse_10": "And that we know not whether any evil has been intended for those living on earth or their Lord has desired any good for them.",
        "verse_11": "And that there are some amongst us righteous and some of us are otherwise. We are divided into different ways.",
        "verse_12": "And that we are convinced that in no case we can ever go out of the control of Allah in the earth not we can go out of His control by flying.",
        "verse_13": "And that when we heard the guidance, we believed in it. And whoso believes in his Lord, has no fear of any loss or highhandedness.",
        "verse_14": "And that there are some Muslims and some unjust persons amongst us. So those who embraced Islam, it is they who sought the right course.",
        "verse_15": "And as to the unjust, they became the fuel of Hell.",
        "verse_16": "And say you, 'I have been revealed that if they would have been on the right path, we would have certainly provided them with abundant water.",
        "verse_17": "In order that we may test them therewith, and whoever turns away from the remembrance of his Lord, He will make him join a rising torment.",
        "verse_18": "And that the mosques are only for Allah, so worship none with Allah.",
        "verse_19": "And that when the bondman of Allah stood up praying Him, it was nigh that those jinn may crowd upon him.",
        "verse_20": "Say you, 'I pray to my Lord only, and I associate none with Him'.",
        "verse_21": "Say you, I am not owner of either bad or good for you.'",
        "verse_22": "Say you, 'None will save me from Allah, nor I shall find any place of refuge besides Him'.",
        "verse_23": "(To me is), but to convey the orders of Allah and His Messages and whoso disobeys Allah and His Messenger, then surely for him there is the fire of Hell, wherein they shall abide for ever.",
        "verse_24": "Until when they will see that which they are promised, then they will now know, who is weaker in helpers and fewer in numbers.",
        "verse_25": "Say you, I know not whether that which you are promised is nigh, or my Lord will give it some time.",
        "verse_26": "The Knower of Unseen reveals not His secret to anyone.",
        "verse_27": "Except to His chosen Messengers, and appoints guards before them and behind them.",
        "verse_28": "So that He may see that they have delivered the Messages of their Lord. And that He knows all that is with them, and He has already counted everything in numbers."
    },
    "count": 28
}
