{
    "name": "al-Fajr",
    "index": "089",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By the Dawn.",
        "verse_2": "And by the ten nights.",
        "verse_3": "And by the even and the odd.",
        "verse_4": "And by the night when it departs,",
        "verse_5": "Is there not in it an oath for man of understanding?",
        "verse_6": "Have you not seen, what did your Lord with Aad?",
        "verse_7": "The people of Iram, excessively tall.",
        "verse_8": "The like of whom has not been created in cities.",
        "verse_9": "And withThamud who hewed out rocks in the valley.",
        "verse_10": "And with Firawn (Pharaoh) who pilloried.",
        "verse_11": "Those who transgressed in the cities.",
        "verse_12": "And spread mischief therein.",
        "verse_13": "Therefore your Lord let down upon them the whip of torment with force.",
        "verse_14": "Undoubtedly, nothing is absent from the sight of Your Lord.",
        "verse_15": "But man, when his Lord tries him and honours him and bestows favour on him, he says, 'My Lord has honoured me.'",
        "verse_16": "But when He tries him and straitens his livelihood, he says, 'my Lord has disgraced me.'",
        "verse_17": "Not so, but you do not honour the orphan.",
        "verse_18": "And you urge not one another to feed the poor.",
        "verse_19": "And devour the heritage of others greedily.",
        "verse_20": "And you love wealth exceedingly.",
        "verse_21": "Yes, when the earth is completely broken into pieces.",
        "verse_22": "And the Command of your Lord comes and also the angels in rows after rows.",
        "verse_23": "And Hell is brought that day, on that day man will think, but not where is the time for thinking?",
        "verse_24": "He will say, O would that I had sent forward some good works in my life.",
        "verse_25": "So on that day none torments any like His torment.",
        "verse_26": "And nor anyone binds like His binding.",
        "verse_27": "O you peaceful soul!",
        "verse_28": "Return to your Lord well pleased with Him, and He well pleased with you.",
        "verse_29": "So enter you among My chosen bondmen.",
        "verse_30": "'And come to My Garden.'"
    },
    "count": 30
}
