{
    "name": "as-Shaffat",
    "index": "037",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
       "verse_1": "By those who range themselves in ranks properly.",
    "verse_2": "Then by those who drive by chiding.",
    "verse_3": "Then by those groups that recite Quran.",
    "verse_4": "Undoubtedly, your God is necessarily One.",
    "verse_5": "The Lord of the heavens and the earth and what is in between them and the Lord of the easts.",
    "verse_6": "Undoubtedly, We adorned the lower heaven with the adornment of the stars.",
    "verse_7": "And a safeguard from every contumacious devil (saitan).",
    "verse_8": "They cannot give ear towards heavenly world and they are pelted from every side.",
    "verse_9": "To drive them away and for them is the perpetual torment.",
    "verse_10": "But he who carries away by swooping once or twice, then is at once followed by a bright burning flame.",
    "verse_11": "Therefore ask them, is their creation stronger or Our other creations heavens and angels etc.? Undoubtedly We have made them of sticking clay.",
    "verse_12": "But you do wonder and they ridicule it.",
    "verse_13": "And when they are made to understand, they understand not.",
    "verse_14": "And when they see any sign, they ridicule it.",
    "verse_15": "And they say, 'this is not but an open magic.",
    "verse_16": "'What! When we become dust and bones after death, shall we necessarily be raised?",
    "verse_17": "And our former forefathers too?'",
    "verse_18": "Say you, 'yes, and you shall be disgraced ones'.",
    "verse_19": "Then it will be only a single horrible shout, henceforth they will begin to see.",
    "verse_20": "And they will say, 'alas! Woe to us,' it will be said to them, 'This is the Day of Requital.",
    "verse_21": "'This is the Day of Judgement which you used to belie.'",
    "verse_22": "Drive and bring together the oppressors and their companions, and what they used to worship.",
    "verse_23": "Besides Allah, and drive them all to the path of the Fire.",
    "verse_24": "And stop them, they are to be questioned.",
    "verse_25": "What happened to you, why you do not help each other?",
    "verse_26": "Nay, today they have surrendered themselves.",
    "verse_27": "And of them one faced the other mutually questioning.",
    "verse_28": "They said, 'you used to approach us for misleading from right side.",
    "verse_29": "They will reply, 'you yourselves were not believing.",
    "verse_30": "And We had no control over you, but rather you were a people contumacious.",
    "verse_31": "Therefore the sentence of our Lord has been proved against us that we are necessarily to taste.",
    "verse_32": "And we misled you for we ourselves had gone astray.",
    "verse_33": "Therefore that day they are all shares in the torment.",
    "verse_34": "Thus We do with the culprits.",
    "verse_35": "Undoubtedly, when it was said to them, 'None is to be worshipped besides Allah', they then swelled with pride.",
    "verse_36": "And they used to say, 'shall we indeed leave our gods, because of the saying of a mad poet?'",
    "verse_37": "No indeed, rather he has brought the truth and he has confirmed the Messengers.",
    "verse_38": "Undoubtedly, you are to taste a painful agony.",
    "verse_39": "And you shall not be recompensed but of your own doings.",
    "verse_40": "But those who are the chosen bond men of Allah.",
    "verse_41": "For them is that provision which is in Our knowledge.",
    "verse_42": "Fruits, and they shall be honoured.",
    "verse_43": "In the Gardens of comfort.",
    "verse_44": "They will be on thrones face to face.",
    "verse_45": "There will be a round of a flowing drink cup before their eyes.",
    "verse_46": "White coloured, delicious to those who drink.",
    "verse_47": "Wherein neither there in intoxication and nor their heads will become giddy wherewith.",
    "verse_48": "And they have those who will not look towards anyone else other than their husbands, having large eyes.",
    "verse_49": "As they are eggs preserved.",
    "verse_50": "Then of them one faced the other questioning.",
    "verse_51": "A speaker from among them said, 'I had a mate of mine.'",
    "verse_52": "'Who used to say, \"Do you take it to be true'?",
    "verse_53": "\"What! When we are rotten and will become dust and bones, shall we then be requited?\"",
    "verse_54": "He will say, ‘will you peep and see?'",
    "verse_55": "Then he peeped and saw him in the midst of Flaming Fire.",
    "verse_56": "He said, By God, it was near that you would cause me to perish.'",
    "verse_57": "And had it not been for the favor of my Lord, I would surely have been seized and presented'.",
    "verse_58": "Is it not then we are to die?",
    "verse_59": "But our first death and that we are not to be punished.",
    "verse_60": "No doubt, this is the supreme triumph.",
    "verse_61": "Therefore, let the workers work the like of this.",
    "verse_62": "Is this entertainment better or the tree of Zaqqum? (Bearing bitter, un-tasty and sour fruits).",
    "verse_63": "Undoubtedly, We have made it a test for the unjust.",
    "verse_64": "Verily, it is a tree which grows in the bottom of Hell.",
    "verse_65": "Its spike is like the heads of monsters.",
    "verse_66": "And verily they shall eat of it, and fill their bellies with it.",
    "verse_67": "Then undoubtedly, for them there is in addition to it a mixture of boiling water.",
    "verse_68": "Then their return is necessarily towards a Flaming Fire.",
    "verse_69": "Undoubtedly, they found their fathers erring.",
    "verse_70": "So they are rushing in their footsteps.",
    "verse_71": "And undoubtedly, most of the ancient went astray before them.",
    "verse_72": "And undoubtedly, We sent warners in them.",
    "verse_73": "Then look as to how was the end of those who were warned.",
    "verse_74": "Save the chosen devotes of Allah.",
    "verse_75": "And undoubtedly, Nuh called Us, and what Excellent Respondent are, We.",
    "verse_76": "And We delivered him and his family from the great distress.",
    "verse_77": "And We made his offspring the only survivors.",
    "verse_78": "And We left for him a good name among later generations.",
    "verse_79": "Peace be upon Nuh among the people of the world.",
    "verse_80": "Undoubtedly, thus We recompense the righteous.",
    "verse_81": "Undoubtedly, he is among Our most dignified fully believing devotees.",
    "verse_82": "Then We drowned the others.",
    "verse_83": "And undoubtedly, Ibrahim belongs to his same group.",
    "verse_84": "When he came to his Lord with a pure heart.",
    "verse_85": "When he said to his father and his people, 'what do you worship'?",
    "verse_86": "Do you desire other gods besides Allah through false accusation?",
    "verse_87": "'Then what do you think about the Lord of the worlds?'",
    "verse_88": "Then he cast a glance at the stars.",
    "verse_89": "Then he said, 'I am about to be sick.'",
    "verse_90": "Then they turned back from him.",
    "verse_91": "Then he walked towards their gods secretly and said, 'do you not eat'?",
    "verse_92": "'What happened to you that you speak not?'",
    "verse_93": "Then avoiding sight of the people, he began to strike them with his right hand.",
    "verse_94": "Then the infidels rushed towards him.",
    "verse_95": "He said, 'do you worship. What your hand carved out.'",
    "verse_96": "And Allah has created you and your deeds?",
    "verse_97": "They said, 'build for him a building, then cast him in the flaming fire.",
    "verse_98": "Then they intended to design a plan against him, but We brought them low.",
    "verse_99": "And he said, 'I am to go to my Lord, now He shall guide me.",
    "verse_100": "'My Lord, bestow me a righteous son.'",
    "verse_101": "Then We gave him a glad tidings of a prudent son.",
    "verse_102": "Then when he became able to work with him, he said, 'O my son, I have dreamt that I am slaughtering you, now look you, what is your opinion'. He said, 'O my father, do as you are commanded, Allah willing, it is near that you will find me patient.'",
    "verse_103": "Then when they both submitted to My command and the father laid down his son on forehead.",
    "verse_104": "We called to him, O Ibrahim.",
    "verse_105": "Undoubtedly, you have fulfilled the vision, thus We recompense the righteous.",
    "verse_106": "No doubt, it was a bright test.",
    "verse_107": "And We ransomed him with a great sacrifice.",
    "verse_108": "And We left a good name for him in later generations.",
    "verse_109": "Peace be upon Ibrahim.",
    "verse_110": "And thus We recompense the righteous.",
    "verse_111": "Undoubtedly, He is among Our most dignified fully believing devotees.",
    "verse_112": "And We gave him the glad tidings of Ishaque, a Prophet the Communicator of unseen, one of the deserving men of our proximity.",
    "verse_113": "And We blessed him and Ishaque. And among their progeny some are good-doers, and are some who clearly wrong themselves.",
    "verse_114": "And undoubtedly, We bestowed favors on Musa and Haroon.",
    "verse_115": "And We delivered them and their people from the great distress.",
    "verse_116": "And We helped them, so they became dominant.",
    "verse_117": "And We bestowed a luminous Book on both.",
    "verse_118": "And We showed them straight path.",
    "verse_119": "And left their good names in later generations.",
    "verse_120": "Peace be upon Musa and Haroon.",
    "verse_121": "Undoubtedly, thus We recompense the righteous.",
    "verse_122": "Undoubtedly, they are among Our most dignified, fully believing devotes.",
    "verse_123": "And undoubtedly, llyas is among Messengers.",
    "verse_124": "When he said to his people, 'do you not fear?",
    "verse_125": "'Do you worship Baal and leave the Best Creator?",
    "verse_126": "'Allah, Who is your Lord and the Lord of your forefathers?'",
    "verse_127": "Then they belied him, so necessarily, they will come arrested.",
    "verse_128": "But the chosen devotees of Allah.",
    "verse_129": "And We left his good name in later generation",
    "verse_130": "Peace be upon llyas.",
    "verse_131": "Undoubtedly, thus We recompense the righteous.",
    "verse_132": "Verily, he is among Our most dignified fully believing devotees.",
    "verse_133": "And verily Lut is among Our Messengers.",
    "verse_134": "When We delivered him and his all family members.",
    "verse_135": "But an old woman who was among those who remained behind.",
    "verse_136": "Then We destroyed the others.",
    "verse_137": "And undoubtedly, you pass by them in the morning.",
    "verse_138": "And at night. Do you them have no wisdom?",
    "verse_139": "And verily, Yoonus is among Messengers.",
    "verse_140": "When he went away towards a laden boat.",
    "verse_141": "And cast lots and was of the pushed ones.",
    "verse_142": "Then the fish swallowed him and he was blaming himself.",
    "verse_143": "And had he not been of those who glorify Allah.",
    "verse_144": "He would have necessarily remained in its belly until the day when the people shall be raised.",
    "verse_145": "Then We cast him on a bare place and he was sick.",
    "verse_146": "And We caused to grow over him a tree of gourd.",
    "verse_147": "And We sent him towards a hundred thousand, rather more.",
    "verse_148": "Then they believed, then We allowed them to enjoy for a time.",
    "verse_149": "Now ask them, 'Are the daughters for your Lord and for them sons?",
    "verse_150": "'Or did We create the angels females, while they were present?",
    "verse_151": "Do you hear? Undoubtedly they say of their own calumny.",
    "verse_152": "'Allah has begotten', and undoubtedly, they are necessarily liars.",
    "verse_153": "Has He chosen daughters leaving sons?",
    "verse_154": "What is the matter with you? How you order?",
    "verse_155": "Do you then not reflect?",
    "verse_156": "Or have you any clear authority?",
    "verse_157": "Then bring your Book, if you are truthful.",
    "verse_158": "And they have set up a relationship between Him and the Jinn. And undoubtedly, Jinn know that they shall be necessarily presented.",
    "verse_159": "Sanctified is Allah from what they describe.",
    "verse_160": "But the chosen bondmen of Allah.",
    "verse_161": "Then neither you nor what you worship (besides Allah).",
    "verse_162": "You are not to mislead anyone against Him.",
    "verse_163": "But to him who is to go into the Flaming Fire.",
    "verse_164": "And the angels say, 'every one of us has a known station.",
    "verse_165": "'And undoubtedly, we wait for the command spreading our wings.",
    "verse_166": "And undoubtedly, we glorify Him.'",
    "verse_167": "And undoubtedly, they used to say.",
    "verse_168": "'If we had any admonition from the ancients.",
    "verse_169": "'Then we would necessarily have been the chosen bondmen of Allah'.",
    "verse_170": "But they denied it, then soon they will know.",
    "verse_171": "And undoubtedly, Our Word has already passed to Our sent bondmen.",
    "verse_172": "That undoubtedly they shall be helped.",
    "verse_173": "And undoubtedly, Our army would be dominant.",
    "verse_174": "So turn your face from them for a while.",
    "verse_175": "And watch them that soon they will see.",
    "verse_176": "Do they then seek our torment to hasten on?",
    "verse_177": "Then when it will descend into their courtyard, then what an evil morning will be of those who were warned!",
    "verse_178": "So turn your face from them for a while.",
    "verse_179": "And wait that they will soon see.",
    "verse_180": "Sanctity is to your Lord, the Lord of Dignity from what they describe.",
    "verse_181": "And peace be upon the Messengers.",
    "verse_182": "And all praise be to Allah, the Lord of the worlds."
   },
    "count": 182
}
