{
    "name": "an-Najm",
    "index": "053",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By the lovely shining star Muhammad, when he descended from the Ascension (Meraj).",
        "verse_2": "Your companion neither went astray nor misled.",
        "verse_3": "And he speaks not of his own desire.",
        "verse_4": "That is not but the revelation that is revealed to him.",
        "verse_5": "He was taught by one possessing mighty powers.",
        "verse_6": "Possessor of strength. Then that splendid sight proceeded.",
        "verse_7": "And he was on the highest horizon.",
        "verse_8": "Then that splendid sight drew nearer, then he came close well.",
        "verse_9": "So there was a distance of two hands between the splendid sight and the beloved (Prophet) but rather less than that.",
        "verse_10": "Now He revealed to His bondman whatever He revealed.",
        "verse_11": "The heart lied not in what he saw.",
        "verse_12": "Do you then dispute with him concerning what he has seen?",
        "verse_13": "And indeed he saw that Splendid Sight twice.",
        "verse_14": "Near the farthest Lote-Tree.",
        "verse_15": "Near which is the Garden of Eternity.",
        "verse_16": "When that was covering the Lote-Tree which was covering.",
        "verse_17": "The eye deviated not, nor crossed the limit.",
        "verse_18": "Certainly, he saw very big signs of his Lord.",
        "verse_19": "Have you then seen Lat and Uzza?",
        "verse_20": "And the third Manat?",
        "verse_21": "What! For you the males and for Him the females.",
        "verse_22": "Then this is an unfair division.",
        "verse_23": "That is not, but some names, you and your fathers have named; Allah has not sent down any authority for them. They follow mere conjecture and desire of souls, whereas there has already come to them guidance from their Lord.",
        "verse_24": "Will the man have whatsoever he fancies?",
        "verse_25": "But Allah is the Owner of the Hereafter and the world all.",
        "verse_26": "And how many an angel is there in the heavens that their intercession availed nothing but when Allah permits to whomsoever He desires and please.",
        "verse_27": "Undoubtedly, those who do not believe in the Hereafter, name the angels with the names of females.",
        "verse_28": "And they have no knowledge thereof. They follow mere conjecture and verily the conjecture avails nothing against the conviction.",
        "verse_29": "Thereof turn your face from them who turned back from Our remembrance and who desired not but the life of the world.",
        "verse_30": "That is the utmost limit of their knowledge. Undoubtedly, your Lord knows well who strayed from His way, and He knows well him who was guided.",
        "verse_31": "And for Allah is whatever is in the heavens and whatever is in the earth so that He may recompense the evildoers for their doings and reward with best those who do good.",
        "verse_32": "Those who save themselves from grave sins and indecencies but to this extent that they approached sins and kept themselves aloof. Verily, the forgiving of your Lord is vast. He knows you well, He created you from the earth and when you were embryos in the bellies of your mothers. Therefore tell not your souls as pure. He knows well who are pious.",
        "verse_33": "Did you observe him who turned away?",
        "verse_34": "And gave a little and then stopped?",
        "verse_35": "Has he the knowledge of the unseen, so he is seeing?",
        "verse_36": "Has he not been told of what is in the scriptures of Musa?",
        "verse_37": "And of Ibrahim, who fulfilled the Commandments.",
        "verse_38": "That no soul bearing burden bears the burden of another.",
        "verse_39": "And that the man will not get but what he endeavors.",
        "verse_40": "And that his endeavor shall soon be seen.",
        "verse_41": "Then he shall be recompensed for it fully.",
        "verse_42": "And that verily, towards your Lord is the end.",
        "verse_43": "And that it is He Who made one to laugh and made one to weep.",
        "verse_44": "And that it is He Who caused death and caused life.",
        "verse_45": "And that it is He who made pairs male and female.",
        "verse_46": "From the sperm when it is poured forth.",
        "verse_47": "And that it is for Him the second raising.",
        "verse_48": "And that it is He Who enriched and gave satisfaction.",
        "verse_49": "And that it is He Who is the Lord of the star Sirius.",
        "verse_50": "And that it is He Who destroyed the first Aad.",
        "verse_51": "And Thamud, then left none.",
        "verse_52": "And before this the people of Nuh verily, they were more unjust and contumacious than them.",
        "verse_53": "And He demolished the city to be overturned.",
        "verse_54": "Then covered them what covered them.",
        "verse_55": "Therefore O listener, which of your Lord's favors would you doubt?",
        "verse_56": "This is a warner like the former warners.",
        "verse_57": "It came near that was to come near.",
        "verse_58": "There is none to open it save Allah.",
        "verse_59": "Do you then wonder at this discourse?",
        "verse_60": "And do you laugh, and weep not.",
        "verse_61": "And you are sporting.",
        "verse_62": "Therefore prostrate yourselves for Allah and worship Him."
  },
    "count": 62
}
