{
    "name": "at-Taubah",
    "index": "009",
    "verse": {
       "verse_1": "This is declaration of disassociation from Allah and His Messenger to those idolaters with whom you had entered into a contract and they did not keep it.",
    "verse_2": "Then go about in the land for four months and know that you cannot tire Allah and Allah is to humiliate the infidels.",
    "verse_3": "And there is proclamation from Allah and His Messenger to all People on the day of Great Pilgrimage that Allah is rid of the polytheists and so His Messenger, if you then repent it is then good for you, and if you turn your face then know that you cannot tire Allah. And give good tidings to infidels of a painful torment.",
    "verse_4": "But those associators with whom you had covenanted then they did not detract anything in your contract, and did not help anyone against you, then fulfil their covenant till the promised day. Undoubtedly Allah loves the pious ones.",
    "verse_5": "Then when the sacred months have passed, slay the associators wherever you find them and catch them, and confine them and sit in wait for them at every place; again if they repent and establish prayer and give the poor-due, then leave their way. Verily Allah is Forgiving, Merciful.",
    "verse_6": "And O beloved Prophet! if any of the associators ask your protection, then give him protection that he may hear, the Word of Allah then convey him to his place of security. This is because they are the people ignorant.",
    "verse_7": "How there shall be any covenant for the associators with Allah and His Messenger but those with whom you covenanted near the Sacred Mosque! Then as long as they keep their covenant for you, you should also stand for them. Undoubtedly, Allah loves the pious ones.",
    "verse_8": "How (Can it be) their condition is this that if they prevail against you, then neither they would care for relationship nor for agreement. They please you with their mouths, and their hearts refuse, and most of them are disobedient.",
    "verse_9": "They have sold the Signs of Allah for a meagre price, then they barred from His path. Undoubtedly, they do most evil deeds.",
    "verse_10": "They neither have regard of relationship or agreement in any Muslim. And they are the transgressors.",
    "verse_11": "Again if they repent and establish prayer and pay the poor- due (Zakat), then they are your brothers, in faith. And We explain the signs in detail for a people who know.",
    "verse_12": "If they break their oaths after their covenant, and taunt at your religion, then, fight with the leaders of infidelity, undoubtedly, their oaths are nothing. Haply they may desist.",
    "verse_13": "Will you not fight with a people who have broken their oaths and resolved to turn out the Messenger, although the beginning is from them? Do you fear them? Then Allah is Most worthily that you should fear Him if you believe (Him).",
    "verse_14": "Then fight them, Allah will torment them at your hands and will humiliate them and will help you against them, and will heal the breasts of the believers.",
    "verse_15": "And will remove the anger of their hearts, and Allah relent of whomsoever He pleases, and Allah is Knowing, Wise.",
    "verse_16": "Are you in this conception that you would be left alone, and Allah has not yet made known those of you who will struggle and will not take anyone as a confident except Allah and His Messenger and the Muslims; And Allah is Aware of What you do.",
    "verse_17": "It is not for the associators that they should inhabit the mosques of Allah, bearing witness of infidelity against themselves. Their entire work is destroyed and they shall abide in the Fire.",
    "verse_18": "They only inhabit the mosques of Allah who believe in Allah and the Last Day and establish prayer and pay the poor- due (Zakat) and fear none but Allah, therefore it is near that these people may be among the guided ones.",
    "verse_19": "Then do you hold the offering of water to the pilgrims and service of the sacred Mosque equal to one who believed in Allah and the Last Day and struggled in the path of Allah? They are not equal in the sight of Allah. And Allah guides not the unjust people.",
    "verse_20": "Those who believed and emigrated and fought with their wealth and lives in the path of Allah have the highest rank near Allah. And they are they who reached to their goal.",
    "verse_21": "Their Lord does give them glad tidings of His mercy and of His pleasure and of those gardens wherein there is lasting bliss for them.",
    "verse_22": "They will abide there in forever. Undoubtedly, there is great reward with Allah.",
    "verse_23": "O believers! Take not your fathers and brothers for friends, if they prefer infidelity over faith. And whoso of you will befriend them, then they are they who are unjust.",
    "verse_24": "Say you, 'If your fathers, and your sons and your brothers and your wives and your clan and the wealth of your earning and the trade of which you fear loss and the houses of your choice, these things are dearer to you than Allah and His Messenger and the struggling in His path, then wait till Allah brings His Command.' And Allah guides not the disobedient.",
    "verse_25": "Undoubtedly, Allah did help you at many places and on the day of Hunain when you had boasted on your multitude, it availed you nothing, and the land being so vast became straitened to you; then you turned your backs retreating.",
    "verse_26": "Then Allah sent down His calm upon His Messenger and upon Muslims, and He sent down the hosts that you did not see and chastised the infidels. And this is the punishment of the rejecters.",
    "verse_27": "Thereafter Allah will relent whom He pleases. And Allah is Forgiving, Merciful.",
    "verse_28": "O believers! The associators are altogether unclean, then let them not approach the sacred Mosque after this year. And if you fear poverty, then soon Allah shall enrich you of His bounty if He pleases. Verily, Allah is Knowing, Wise.",
    "verse_29": "Fight those who believe not in Allah and in the Last Day, and accept not as unlawful what Allah and His Messenger made unlawful, and follow not the true faith that is to say those who were given the Book until they pay the required tax with their own hands being brought low.",
    "verse_30": "And the Jews said, \"Uzair is the son of Allah\" and the Christians said 'Masih (Christ) is the son of Allah.' These things, they utter with their mouths. They imitate the sayings of the infidels before them. Allah assail them, whither they are perverting?",
    "verse_31": "They have taken their priests and monks as gods besides Allah and also Masih son of Maryam; and they were commanded not but this that they worship only one Allah; none is to be worshipped except He. Hallowed be He from their polytheism.",
    "verse_32": "They wish to put off the light of Allah with their mouths and Allah will not agree but to perfect His light, though the infidels may dislike it.",
    "verse_33": "It is He Who has sent His Messenger with guidance and true religion that He may make it prevail over all religions, though the infidels may dislike it.",
    "verse_34": "O believers! Verily many of the priests and monks devour the wealth of the people wrongfully and bar from the path of Allah. And those who hoard up gold and silver and spend not them in the path of Allah, give them the good tidings of a painful torment.",
    "verse_35": "The day when they shall be heated in the fire of the Hell, then their foreheads and sides and backs shall be branded therewith. This is what you had hoarded for yourselves, now taste the hoarding.",
    "verse_36": "Undoubtedly, the number of months with Allah is twelve in the Book of Allah since the day He made the Heavens and Earth, four of them are sacred. This is the right religion, then wrong not yourselves in these months, and fight the infidels at all times, as they fight with you, all times. And know that Allah is with the pious ones.",
    "verse_37": "Their postponement of the months are not but an increase in infidelity, with which the infidels are misguided, they make it lawful one year and hold it unlawful another year, that they may make up the number which Allah has sanctified, and make lawful what Allah has forbidden. Their vile deeds seem fair in their eyes. And Allah guides not the infidels.",
    "verse_38": "O believers! What happened to you that when it is said to you, 'Go forth in the way of Allah' you sit down on the earth heavily'? Have you chosen the life of this world in preference to the Hereafter? And the goods of the living world, in comparison with that of the Hereafter is nothing but little.",
    "verse_39": "If you will not march forth, He will punish you with a severe punishment and will replace you by another people, and you can do no harm to Him. And Allah can do everything.",
    "verse_40": "if you help him (the beloved Prophet) not, then no doubt, Allah helped him, when on account of the mischief of the infidels, he was to go out with only two souls, when they both were in the Cave, and when he said to his companion 'Grieve not, no doubt Allah is with us', then Allah sent His satisfaction on him, and helped him with armies which you did not see, and put down the word of the infidels, it is the word of Allah alone which is supreme, and Allah is Dominant, Wise.",
    "verse_41": "March forth with light soul, or with heavy heart and struggle in the way of Allah with your wealth and lives. It is better for you, if you know.",
    "verse_42": "If there had been any near gain, or an average journey, then they would have certainly gone with you, but the hard journey seemed too long to them, and now they will swear by Allah, that if we had been able, then we would have surely gone with you. They ruin their souls, and Allah knows that undoubtedly, they are necessarily liars.",
    "verse_43": "Allah forgive you, why did you then permit them, till the true one had not become manifest to you and the liars had not become clear?",
    "verse_44": "And those who would believe in Allah and the Last Day would not ask leave of you from struggling with their wealth and their lives. And Allah knows well the duty-bound.",
    "verse_45": "Those only ask you this leave who do not believe in Allah and the Last Day and their hearts are in doubt, then in their doubt they waver.",
    "verse_46": "Had they willed to go forth, they would have made some preparation for it; but God disliked their rousing, so He made them lethargic, and it was said to them 'remain sitting with those who sit.'",
    "verse_47": "If they would have come out among you, they would have added you nothing except trouble and would have run to and fro in your midst seeking to cause sedition among you, and there are among you, their spies: And Allah knows well the unjust.",
    "verse_48": "No doubt, they already sought to create disorder before, and turned the plans upside down for you O beloved! till the truth came, and Allah's command appeared; and it was unpleasant to them.",
    "verse_49": "And anyone among them submits before you like this, 'Give me leave, and put me not in trial.' Listen, they have already fallen into trial. And undoubtedly, the hell has surrounded the infidels.",
    "verse_50": "If good befalls you, then it hurts them, and if any misfortune comes to you, then they say, 'We had already set right our work before.' And turn back rejoicing.",
    "verse_51": "Say you 'nothing shall reach us, but what Allah has ordained for us. He is our Protector, and the Muslims should keep trust in Allah only.'",
    "verse_52": "Say you, 'What you are waiting for us but one of the two good?' And we are waiting for you that Allah shall afflict you with a torment from Himself, or with our hands. Now wait then, we are also waiting with you.'",
    "verse_53": "Say you, 'Spend willingly or unwillingly, it shall not be accepted from you. No doubt, you are a people disobedient.",
    "verse_54": "And what they spend, its acceptance was not barred, but because they rejected Allah and His Messenger and come not to prayers but lazily, and spend not but unwillingly.",
    "verse_55": "Then let not their wealth and their children astonish you. Allah only intends to punish them with these things in the life of the world and that their souls may depart while they are infidels.",
    "verse_56": "And they swear by Allah that they are from amongst you. And they are not from amongst you, yes they are afraid.",
    "verse_57": "If they find a place of refuge, or cave or a place to creep into, they will turn there to rushing head-long.",
    "verse_58": "And of them someone is he who blames you with regard to the distribution of charities, then if they get something of these, they are pleased, and if they get not, then they are angry.",
    "verse_59": "And what a good it had been, if they would have been pleased with what Allah and His Messenger had given them and would have said, 'Sufficient for us is Allah. Now Allah is to give us of His Bounty, and so the Messenger of Allah. To Allah only we lean.'",
    "verse_60": "The poor-due (Zakat) is only for those who are poor and needy and those who collect it, and for those whose hearts are to be conciliated for Islam, and for the freeing of slaves, and for debtors, and for spending in the way of Allah and for the traveler. This has been ordained by Allah. And Allah is Knowing, Wise.",
    "verse_61": "And of them some are those who hurt the Communicator of the hidden news (the Prophet) and say 'he is an ear'; say, 'He is an ear for good of you, believes in Allah and believes the words of Muslims, and is a mercy for those who are Muslims among you.' And those who hurt the Messenger of Allah, for them is the painful torment.",
    "verse_62": "They swear by Allah before you so that you may be pleased and Allah and His Messenger had greater right, that they should please him, if they had faith.",
    "verse_63": "Are they not aware that whoso opposes Allah and His Messenger, then for him is the fire of the Hell in which he will abide forever? This is the great humiliation.",
    "verse_64": "The hypocrites fear lest a Surah (Chapter) should be sent down to them informing them what is in their hearts. Say you 'Mock on, truly Allah is about to reveal what you fear.'",
    "verse_65": "And O beloved Prophet! If you ask them, they will say 'We were only jesting and playing.' Say you, 'Do you mock at Allah and His signs and His Messengers?'",
    "verse_66": "Make no excuses, you have already become disbelievers after being Muslims. If We forgive someone of you, then We shall chastise others because they were guilty.",
    "verse_67": "The hypocrite's men and women are the birds of the same feather; they bid evil and forbid from doing good, and (they) keep their hands closed. They have left Allah then Allah has left them. No doubt, the hypocrites are the confirmed disobedient.",
    "verse_68": "Allah has promised the hypocrites men and hypocrites' women and infidels, the fire of the Hell; wherein they will abide forever. That is sufficient for them, and the curse of Allah is upon them, and for them is the lasting torment.",
    "verse_69": "As those before you, they were mightier than you in strength, and more abundant in wealth and children. Then they enjoyed their share, then you enjoyed your share just as those before you enjoyed their share, and you indulged in jesting just as they indulged. Their work is wasted in the world and the Hereafter, and they are the people who are losers.",
    "verse_70": "Have they not received the news of those before them the people of Nooh, and Aad and Thamud, and the people of Ibrahim, and the men of Madian and the overthrown towns? Their Messengers had brought to them bright evidences; then it was not befitting to Allah that He might have wronged them, but they were themselves unjust to their souls.",
    "verse_71": "And the Muslim men and women are friends to one another, bid for good and forbid evil and establish prayer and pay the poor-due (Zakat) and obey Allah and His Messenger. These are they on whom soon Allah will have mercy. Undoubtedly Allah is Dominant, Wise.",
    "verse_72": "Allah has promised to Muslim men and Muslim women Gardens under which rivers flow, wherein they shall reside for ever and clean houses in the inhabitable gardens. And the pleasure of Allah is the greatest. This is the achievement of the greater Goal.",
    "verse_73": "O Communicator of the hidden news (Prophet)! Fight against the infidels and the hypocrites and be strict to them. And their destination is Hell and what an evil place of return!",
    "verse_74": "They swear by Allah that they said it not, and no doubt, necessarily they uttered the word of infidelity and became infidels after accepting Islam and they had desired that which they could not get; and what they felt bad, only this that Allah and His Messenger has enriched them out of His grace; then if they repent, it is good for them, and if they turn their faces, then Allah will chastise them with a severe torment in the world and the Hereafter and on the earth they shall have neither any supporter nor any helper.",
    "verse_75": "And of them there are some who had covenanted with Allah that if He will give us out of His grace, then we shall surely give in charity and we shall surely become good men.",
    "verse_76": "Then when Allah gave them out of His grace, they became niggardly of it and turned away turning their faces.",
    "verse_77": "Therefore after it Allah put hypocrisy in their hearts, until the Day they meet Him the recompense of that they acted against what they had promised Allah and the recompense of that they used to lie.",
    "verse_78": "Are they not aware that Allah knows the secrets of their hearts and their whisper and that Allah is the Well-Knower of all hidden things?",
    "verse_79": "Those who blame those Muslims who give charity willingly and those who get not but with their hard labor, so they laugh at them. Allah will punish them for their laughing and for them is the painful torment.",
    "verse_80": "Ask you forgiveness for them or ask not. If you will ask forgiveness for them seventy times, Allah will never forgive them. This is because that they have rejected Allah and His Messenger. And Allah guides not the disobedient.",
    "verse_81": "Those who were left behind delighted at this that they remained sitting behind the Messenger and they did not like that they may fight in the way of Allah with their wealth and lives and said 'Come not out in this heat say you 'the fire of the Hell is the hottest' in any manner they would have understood!",
    "verse_82": "Let them laugh little and weep much, in recompense what they used to earn.",
    "verse_83": "Then if O beloved Prophet! Allah returns you to a party of them, and they ask you leave to go forth to fight, then say you\" 'Never shall you march forth with me, nor ever fight with any enemy of me. You chose to sit at home the first time, then remain sitting with those who remained behind.'",
    "verse_84": "And pray you never over any of their dead, and not stand over his grave. No doubt, they rejected Allah and His Messenger and died while they were disobedient.",
    "verse_85": "Be not astonished over their wealth and children; Allah only intends to punish them therewith in this world, and that they part with their souls while they are infidels.",
    "verse_86": "And when any Sura (Chapter) is sent down, that believe in Allah and fight with His Messenger, then the men of capability among them ask leave of you and say Leave us to remain with those who sit behind.'",
    "verse_87": "They liked that they should remain with the women left behind, and their hearts are sealed up, so they understand nothing.",
    "verse_88": "But the Messenger and those who believed with him fought with their wealth and lives. And it is they for whom are good, and it is they who reached to their goal.",
    "verse_89": "Allah has prepared for them Gardens under which rivers flow; they shall abide forever therein. This is the attainment of supreme object.",
    "verse_90": "And there came excuse seekers from the villagers in order that leave may be given to them, and those who lied to Allah and His Messenger sat behind. Soon a painful torment shall befall to the infidels of them.",
    "verse_91": "There is not any fault on the weak, and on the sick and nor on those who are not capable to spend, when they are sincere to Allah and His Messenger. There is no way against the good-doers. And Allah is Forgiving, Merciful.",
    "verse_92": "Nor on those who came to you that you may provide carriage to them, you said 'I have nothing whereon to mount you' so they return back and their eyes overflow with tears because of this grief that they could not find the ability to spend.",
    "verse_93": "The accountability is only of those who ask leave of you and they are rich. They liked to sit behind with the women and Allah has sealed up their hearts; so they know nothing.",
    "verse_94": "They will make excuses to you when you will return to them. Say you, \"Make no excuses, we will never believe you, Allah has already given your news to us. And now Allah and His Messenger will see your works, then you will be returned to Him Who knows all unseen and visible, He will tell you what you used to do.\"",
    "verse_95": "Now they will swear by Allah before you, when you will return back to them in order that you may not mind of them, then yes, mind them not. They are wholly filthy and their destination is Hell a recompense what they used to earn.",
    "verse_96": "They swear before you that you may be pleased with them. But if you are pleased with them, then no doubt, Allah will not be pleased with a people disobedient.",
    "verse_97": "The villagers are more stubborn in infidelity and hypocrisy and they are only worthy of this that they remain ignorant of the commands which Allah has sent down upon His Messenger. And Allah is Knowing, Wise.",
    "verse_98": "And among the villagers some are those who regard what they spend in the way of Allah as fine, and remain waiting of misfortunes coming to you. On them is the evil turn. And Allah hears, knows.",
    "verse_99": "And among the villagers some are those who believe in Allah and the Last Day, and regard what they spend as approaches to Allah and means of taking blessings of the Messenger. Yes, that is the means of nearness for them. Allah shall soon make them enter into His mercy. Undoubtedly, Allah is Forgiving, Merciful.",
    "verse_100": "And the first and foremost emigrants and helpers and those who followed them with good, Allah is Pleased with them and they are pleased with Allah and for them He has prepared gardens under which rivers flow; they will dwell therein forever. This is the great success.",
    "verse_101": "And some villagers around you are hypocrites and some of the dwellers of Madinah too; hypocrisy has become their habit. You know them not, We know them. We will soon torment them twice, then they will be returned to a great torment.",
    "verse_102": "And there are some others who acknowledged their sins and mixed up a good deed with another evil. It is near that Allah may accept their repentance. No doubt. Allah is Forgiving, Merciful.",
    "verse_103": "O beloved Prophet! Realize the poor-due (Zakat) out of their wealth, to purify them and cleanse them therewith and pray good for them. No doubt, your prayer is solace for their hearts. And Allah hears knows.",
    "verse_104": "Are they not aware that only Allah accepts the repentance of His bondmen and takes the charities in His authoritative Hand Himself, and that it is Allah Who is the Relenting, the Merciful.",
    "verse_105": "And say you, \"Work on, now Allah will behold your work and so His Messenger and the Muslims. And you will soon be returned to Him Who knows all unseen and visible. Then He will inform you what you used to do.\"",
    "verse_106": "And some other have been deferred to Allah's commandment, whether He may torment them or may accept their repentance. And Allah is Knowing, Wise.",
    "verse_107": "And those who have built a mosque in order to injure and because of infidelity and to cause dissension among Muslims and as an ambush for him who is already against Allah and His Messenger from before. And they will surely swear that we desired only good. And Allah bears witness that they are certainly liars.",
    "verse_108": "You, stand never in that mosque. No doubt, the mosque whose foundation has been laid on righteousness from the very first day is worthy that you may stand therein. Therein are those who desire to be well purified and Allah loves the pure.",
    "verse_109": "Then is he who laid his foundation upon the fear of Allah and His pleasure better or he who laid his foundation on the brink of a falling pit, then he fell with it in the fire of the Hell? And Allah does not give way to the people unjust.",
    "verse_110": "The building which they have built will continue to waver in their hearts unless their hearts may cut into pieces. And Allah is Knowing, Wise.",
    "verse_111": "No doubt, Allah has purchased from the Muslims their lives and their belongings against this return that for them is Paradise, they fight in the way of Allah, and then they kill and are killed; true promise on His generous responsibility in the Taurah and the Injeel and the Quran. And who is true to his words than Allah? Rejoice then in your trade which you have done with Him. And it is this which is the great triumph.",
    "verse_112": "Those who repent, those who worship, those who praise, those who fast, those who bow, those who prostrate, those who tell good and forbid evil and those who watch the limits of Allah. And give you glad tidings to Muslims.",
    "verse_113": "It is not worthy for the Prophet and the believers to ask forgiveness for the associators, even though they be relatives, after it has been made clear to them that they are men of Hell.",
    "verse_114": "And Abraham's asking forgiveness for his father was not but on account of a promise, he had made to Him. But when it was made clear to him that he is an enemy of Allah, he dis-associated himself from him. No doubt, Abraham is most lament, clement.",
    "verse_115": "And it is not the attribute of Allah that He should lead astray any people after He has guided them, until He makes clear to them as to what they have, to guard against. Undoubtedly, Allah knows everything.",
    "verse_116": "Assuredly, it is Allah for Whom is the Kingdom of heavens and earth, He gives life and causes death. And you had no protector nor helper besides Allah.",
    "verse_117": "No doubt, blessings of Allah turned towards the Communicator of the hidden news (Prophet) and those emigrants and helpers who sided with him in the hour of hardship, after it that the hearts of some of them were nearly to be swerved aside, then He turned towards them with blessing. Undoubtedly, to them He is the Most Kind, Merciful.",
    "verse_118": "And to the three who were left behind, so much so that the earth being so vast became strait to them, and they became tired of their own lives, and they believed that there is no refuge from Allah but with Him. Then, He accepted their repentance that they might remain repenting. Undoubtedly, it is Allah Who is Relenting, the Merciful.",
    "verse_119": "O believers! Fear Allah-and be with the truthful.",
    "verse_120": "lt was not proper for the inhabitants of Madinah and the villagers around them to remain sitting behind the Messenger of Allah, nor that they should consider their own lives more dear than his life. This is so because whatever they face as thirst or distress or hunger in the way of Allah, and wherever they tread a place which enrages the infidels, and whatsoever injury they cause against any enemy, for all these things, good deed is written for them. Assuredly Allah wastes not the reward of those who do good.",
    "verse_121": "And whatever they spend, small or great and the valley they cross, all is written for them, so that Allah may recompense them for their best deeds.",
    "verse_122": "And it is not possible for Muslims that ail should come out. Then why should not a party from each group come out that they may gain understanding of religion and warn their people after coming back to them, haply they may guard themselves.",
    "verse_123": "O believers! Fight the infidels who are close to you, and let them find in you a harshness, and know that Allah is with the duty bound.",
    "verse_124": "Whenever a Sura is sent down, then anyone of them begins to say, 'Which of you has this increased in faith? Then as for those who believed, it has increased them in faith, and they are rejoicing.",
    "verse_125": "And as for those in whose hearts there is a disease, it has increased them in filthiness upon filthiness and they died while they are infidels.",
    "verse_126": "Do they not observe that they are being tried every year once or twice? Even then neither they repent nor accept admonition.",
    "verse_127": "And whenever any Sura is sent down, they begin to look at each other. Whether anyone watches you? Then they turn away. Allah has turned away their hearts, because they are a people who do not understand.",
    "verse_128": "Assuredly there has come to you a Messenger from among yourselves, heavy upon him is your suffering; ardently desirous of your welfare, to Muslims is most Kind and Merciful.",
     "verse_129": "If then they turn their faces, then say you, \"Allah is Sufficient for me; none is to be worshipped except He; I put my trust in Him, and He is the Lord of Supreme Throne\""
    },
    "count": 129
}
