{
    "name": "Nuh",
    "index": "071",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Undoubtedly, We sent Nuh towards his people saying warn them before a painful torment comes to them.",
        "verse_2": "'He said, O my people, I am to you a manifest warner.",
        "verse_3": "That worship Allah, and fear Him, and obey Me.",
        "verse_4": "'He will forgive some of your sins and grant you respite till an appointed time. Undoubtedly, the promise of Allah cannot be deferred when it comes. Anyhow you would have known!",
        "verse_5": "He submitted,'O my Lord, I have called my people night and day.",
        "verse_6": "'But my calling has only increased them in fleeing away.",
        "verse_7": "And every time I called them that You may forgive them, they put their fingers into their ears, covered themselves with their garments, and persisted and waxed great proud.",
        "verse_8": "Then I called them openly.",
        "verse_9": "Then I spoke to them publicly and spoke to them in secret too.",
        "verse_10": "'And I said, 'beg forgiveness of your Lord, He is Most Forgiving.",
        "verse_11": "'He will send down upon you rain in torrents.",
        "verse_12": "'And He will help you with wealth and children and will make for you gardens and will make for you streams.",
        "verse_13": "'What happened to you? That you hope not to achieve honour from Allah.",
        "verse_14": "While He has made you in diverse stages.",
        "verse_15": "'Do you not see that Allah has made seven heavens one upon another?",
        "verse_16": "'And He illuminated therein the moon and has made the sun as a lamp.",
        "verse_17": "'And Allah has caused you to grow from the earth like vegetation.",
        "verse_18": "Then He will cause you to return there to and will bring you forth for the next time.",
        "verse_19": "And Allah has made the earth for you as a bed spreading.",
        "verse_20": "That you may walk through its wide ways.",
        "verse_21": "Nuh said, 'O my Lord! They disobeyed me and followed such one whose wealth and children have only added to his loss.",
        "verse_22": "'And they have plotted a tremendous plot.'",
        "verse_23": "And they said, 'never leave your gods and leave not Wadd nor Suwa nor Yaghuth and Yauq and Nasr'. (Idols of pagan Arabs).",
        "verse_24": "And undoubtedly, they have led many astray; so increase You not the unjust but in error.",
        "verse_25": "And because of their wrong doings, they were drowned, then made to enter the Fire. Then they found not for themselves any helpers against Allah.",
        "verse_26": "And Nuh submitted, 'O my Lord leave not of the infidels any inhabitant upon the earth.",
        "verse_27": "'Undoubtedly, If You would allow them to live, they will lead astray Your bondmen and they will beget none but an evil doer, an ungrateful.",
        "verse_28": "'O my Lord! Forgive me and my parents and him who is in my house as a believer and all believing men and all believing women. And increase not the infidels in aught save destruction.'"
    },
    "count": 28
}
