{
    "name": "al-Waqi'ah",
    "index": "056",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "When the Event inevitable shall come to pass.",
        "verse_2": "Then there shall be no room for anyone to deny its happening.",
        "verse_3": "Bringing low to someone and exalting to some.",
        "verse_4": "When the earth shall tremble with severe shaking.",
        "verse_5": "And the mountains shall be broken to pieces completely smashed.",
        "verse_6": "And will become like thin particles of dust scattered in the sunshine of the ventilator.",
        "verse_7": "And you shall become three kinds.",
        "verse_8": "Then those on the right side, how are those on the right side?",
        "verse_9": "And those on the left side how are those on the left side?",
        "verse_10": "And those who took the lead they have already taken the lead.",
        "verse_11": "They are the favorite trusted persons.",
        "verse_12": "In the gardens of comfort.",
        "verse_13": "A group from among the former ones.",
        "verse_14": "And a few from among the later ones.",
        "verse_15": "They shall be on thrones studded with diamonds and pearls.",
        "verse_16": "Reclining on them facing each other.",
        "verse_17": "Abiding youths shall go round them carrying.",
        "verse_18": "Goblets and ewers and cups with flowing drink before sight.",
        "verse_19": "Where from they will have no headache nor any unconsciousness.",
        "verse_20": "And fruits that they like.",
        "verse_21": "And the flesh of birds as they desire.",
        "verse_22": "And fair maidens with wide eyes.",
        "verse_23": "Like preserved, hidden pearls.",
        "verse_24": "The recompense for their doings.",
        "verse_25": "They shall not hear therein any vain or any sinful talk.",
        "verse_26": "Yes, this will be their saying peace, peace.",
        "verse_27": "And those on the right side, how are those on the right side?",
        "verse_28": "In the midst of thorn less berry trees.",
        "verse_29": "And clusters of bananas.",
        "verse_30": "And abiding shade.",
        "verse_31": "And ever-flowing water.",
        "verse_32": "And fruits abundants.",
        "verse_33": "Neither ending, nor forbidden.",
        "verse_34": "And raised couches.",
        "verse_35": "Undoubtedly, We made those women grow with good growth.",
        "verse_36": "And made them virgins.",
        "verse_37": "Loving to their husbands, attracting them, of equal age.",
        "verse_38": "For those on the right side.",
        "verse_39": "A group from amongst the former ones.",
        "verse_40": "And a group from amongst the later ones.",
        "verse_41": "And those on the left side, how are those on the left side?",
        "verse_42": "In the midst of scorching winds and boiling waters.",
        "verse_43": "And the shadow of burning smoke.",
        "verse_44": "Which is neither cool nor honorable.",
        "verse_45": "Verily before this they were at ease.",
        "verse_46": "And they used to persist in that extreme sin.",
        "verse_47": "And used to say, what! When we are dead and become dust and bones, shall we necessarily be raised up?",
        "verse_48": "And what! Our former fathers too?",
        "verse_49": "Say, 'surely, all former ones and later ones.",
        "verse_50": "'Shall necessarily be gathered to the appointed time of a known Day.",
        "verse_51": "Then, verily, O you the misguided ones, the beliers;",
        "verse_52": "Shall surely eat of the tree of Zaqqum (Cactus).",
        "verse_53": "And fill your bellies therewith.",
        "verse_54": "And again you will drink thereon of boiling water.",
        "verse_55": "Then you will drink as thirsty camels drink.",
        "verse_56": "This is their entertainment on the Day of Judgement.",
        "verse_57": "We have created you, why then, you do not accept the truth?",
        "verse_58": "So look you, the sperm drop that you emit.",
        "verse_59": "Do you make human being of it or We are the Maker?",
        "verse_60": "We have fixed death among you and We are not to be outstripped by this.",
        "verse_61": "That We may exchange the likes of you, and may fashion your faces in a manner which you know not.",
        "verse_62": "And undoubtedly, you have already known the first growth, why then, do you not reflect?",
        "verse_63": "Tell you then, what you sow?",
        "verse_64": "Do you make crop of it or We are the Grower?",
        "verse_65": "If We willed, We might trample it into pieces, then you would remain lamenting.",
        "verse_66": "That we are indebted.",
        "verse_67": "Rather we remained deprived altogether.",
        "verse_68": "Tell you then, the water you drink.",
        "verse_69": "Did you send it down from the clouds, or We are the Sender?",
        "verse_70": "If We willed, We might make it bitter, what! Then, are you not grateful?",
        "verse_71": "Tell you then, the fire you kindle.",
        "verse_72": "Did you produce the tree thereof or We are the Producer?",
        "verse_73": "We made it a reminder of the Hell and a benefit for the wayfarers in the forest.",
        "verse_74": "Therefore O beloved! Glorify the name of your Lord the Magnificent.",
        "verse_75": "Then I swear by the places where the stars set.",
        "verse_76": "And if you know that is mighty oath.",
        "verse_77": "Undoubtedly, this is an honorable Quran.",
        "verse_78": "In a well-preserved Book.",
        "verse_79": "None shall touch it but the purified ones.",
        "verse_80": "It is a sending down from the Lord of all Beings.",
        "verse_81": "Do you then, show idleness in this statement?",
        "verse_82": "And do you keep for you this share that you belie?",
        "verse_83": "Why then it was not when the soul reaches to the throat.",
        "verse_84": "And you are at that time looking on.",
        "verse_85": "And We are Near to it than you, but you have no sight.",
        "verse_86": "Why then it was not, if you are not to be requited,",
        "verse_87": "That you may send it back if you are truthful?",
        "verse_88": "Then if the person dying is of the near ones.",
        "verse_89": "For him is the comfort and flowers and a garden of delight.",
        "verse_90": "And if he be of those on the right side.",
        "verse_91": "Then O beloved; peace is upon you from those on the right side.",
        "verse_92": "And if he be of the beliers, the misguided.",
        "verse_93": "Then his entertainment is the boiling water.",
        "verse_94": "And the thrusting into the blazing fire.",
        "verse_95": "Undoubtedly, this is the truth of certainty.",
        "verse_96": "Therefore O beloved! Glorify the name of your Lord, the Magnificent."
     },
    "count": 96
}
