{
    "name": "al-Furqan",
    "index": "025",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Immensely blessed is He Who has sent down the Quran to His Bondman that he may be a warner to the entire world.",
    "verse_2": "He for Whom is the kingdom of heavens and earth and He has not taken a son for Himself and He has no partner in His Kingdom, and after creating everything, He has ordained it on a right estimate.",
    "verse_3": "And the people have taken other gods besides Him, that they create nothing and they themselves have been created, and they themselves are not owners of their own souls either for bad or for good, and neither they have power to die nor to be alive nor to rise up.",
    "verse_4": "And the infidels said, 'This is not but a calumny which he has fabricated and some other people have helped him in it.' Undoubtedly, those unjust people have brought more falsehood.",
    "verse_5": "And they said, ‘These are the fables of the ancients which he has written, so that they are read to him morning and evening.'",
    "verse_6": "Say you, 'It has been sent down by Him Who knows every secret thing of the heavens and the earth. Undoubtedly, He is Forgiving, Merciful.'",
    "verse_7": "And they said, 'What happened to this Messenger; he eats food, and walks about in the market, why not an angel was sent down to him that he might be a warner with him.",
    "verse_8": "'Or he would have got a treasure from the hidden place or he would have any garden that he may eat therefrom?' And the unjust people said, 'You follow not but a man who has been bewitched.'",
    "verse_9": "O beloved, see what kind of similitudes they are coining for you, therefore, they have gone astray, now they cannot find anyway.",
    "verse_10": "Blessed is He Who, if He please, will do better for you than that; Gardens beneath which flow streams and He will make high palaces for you.",
    "verse_11": "Nay, they belie the Hour, and for him who belies the Hour, We have prepared a blazing fire.",
    "verse_12": "When it will see them from a far place, they will hear its bubbling and shrieking.",
    "verse_13": "And when they will be thrown into any narrow place thereof tied with chains, they will there request for death.",
    "verse_14": "It will be said, 'Request not today one death but request for many deaths.'",
    "verse_15": "Say you, 'is this better or the abiding garden which is promised to those who fear. That is their reward and end.",
    "verse_16": "For them is therein all that they desire, they will abide therein forever. This is promise made by your Lord as prayed for.",
    "verse_17": "And the day He will assemble them and those they worship besides Allah, then He will say to those gods, 'Have you led these My bondmen astray or they themselves strayed away from the path?'",
    "verse_18": "They will say, ‘Glory is to you, it was not befitting for us that we should take besides You any other patron, but You did allow them and their forefathers to carry on until they forgot Your remembrance and these were the people to be ruined.'",
    "verse_19": "Now therefore the gods have belied your saying, then now you can neither avert the torment nor can help yourselves. And whoso among you is a wrong-doer, We shall make him taste a big torment.",
    "verse_20": "And as many Messengers We sent before you, they were all the same, they ate food and walked about in the markets. And We have made one of you a test for the other, and O people! Will you have patience? And O beloved! Your Lord is seeing.",
    "verse_21": "And said those who do not expect meeting Us, \"Why not angels are sent to us, or we see our Lord?' Undoubtedly they have become proud of themselves and they have become greatly contumacious.",
    "verse_22": "The Day they will see the angels that will not be a happy Day for the guilty, and will say, 'O Allah, set a barrier forbidden between us and them.'",
    "verse_23": "And whatever work they had done, We have purposely made them minute particles or dust scattered that are seen in the sunshine of the ventilator.",
    "verse_24": "Fellows of the Paradise on that Day will have a good destination and after the noon of reckoning a good place for rest.",
    "verse_25": "And on the Day the sky shall be split asunder with the clouds and the angels shall be sent down fully in large number.",
    "verse_26": "The true kingdom that Day is of the Most Affectionate. And it is a hard Day on the infidels.",
    "verse_27": "And on that Day the wrongdoer will bite his hands (saying,) 'O would that I had taken away with the Messenger!",
    "verse_28": "'Ah, woe to me, would that anyhow I had not taken such a one for a friend!",
    "verse_29": "'Undoubtedly, he led me astray from the admonition after it had come to me. And the devil (Satan) leaves the man deserted.'",
    "verse_30": "And the Messenger said, 'O my Lord, my people took this Quran as a thing abandoned.'",
    "verse_31": "And thus We did make for every Prophet enemy from among the culprits. And your Lord is Sufficient to guide and to help.",
    "verse_32": "And the infidels said, 'Why the Quran was not sent down on them all at once? ‘We have thus sent it down gradually that We may strengthen your heart therewith and We recited it with gradual recitation.",
    "verse_33": "And they will not bring you any saying but We shall bring you the truth and better explanation.",
    "verse_34": "Those who shall be driven upon their faces towards the Hell, their destination is worst and worst misguided from the path.",
    "verse_35": "And undoubtedly, We gave Musa the Book and appointed his brother Haroon as Minister.",
    "verse_36": "Then We said, 'Go both of you towards the people who have belied Our Signs. Then We perished them after wrecking.",
    "verse_37": "And as to the people of Nuh, when they belied the Messengers. We drowned them and made them a sign for the people. And We have already prepared painful torment for the oppressors.",
    "verse_38": "And the 'Aad and the Thamud and the people of the well and many a generation in between.",
    "verse_39": "And We narrated examples to all and We obliterated all after complete annihilation.",
    "verse_40": "And necessarily, they have already visited the town whereon was rained an evil rain. Had they not seen it? Nay, but they had no hope to be raised up alive.",
    "verse_41": "And when they see you, they take you not but in mockery, 'Is this the one whom Allah had sent as Messenger?",
    "verse_42": "'It was near that he would have made us astray from our gods if we had not persevered towards them.' Now they wish to know, the day when they will see the torment that who was astray from the path.",
    "verse_43": "Have you seen him who has taken as his god his own desire? Will you then take the responsibility of being a guardian over him?",
    "verse_44": "Or do you think that most of them hear and understand? They are not but like cattle; nay, but they are worst astray from the path.",
    "verse_45": "O beloved! Have you not seen your Lord how He has spread the shadow? And if He had willed, He would have made it stationary, then We have made the sun guide over it.",
    "verse_46": "Then We rolled it up towards Us slowly, slowly.",
    "verse_47": "And it is He Who has made for you the night a covering and the sleep a rest and made the day to rise up.",
    "verse_48": "And it is He Who has sent winds bearing glad tidings before His Mercy, and We sent down water from the sky purifying.",
    "verse_49": "So that We may thereby give life to a dead city, and give it for drink to Our created many cattle and men.",
    "verse_50": "And undoubtedly, We have fixed turns of water amongst them that they may take heed, but most of the people accepted not but being ungrateful.",
    "verse_51": "And if We had willed, We would have sent a warner in every town.",
    "verse_52": "Obey then not the infidels and wage war against them with this Quran a mighty war.",
    "verse_53": "And it is He Who caused to flow two seas together, this one is sweet, very palatable and this one is saltish, extreme bitter in taste, and placed a barrier in between them and a forbidden ban.",
    "verse_54": "And it is He Who created man from water then appointed for him relationship by blood and relationship by marriage. And your Lord is Powerful.",
    "verse_55": "And they worship besides Allah that which can neither do good to them nor can harm them and the infidel helps the devil (Satan) against his Lord.",
    "verse_56": "And We have not sent you but as a bearer of glad tidings and a warner.",
    "verse_57": "Say you, 'I ask of you no wage for this but whosoever wills may take a way towards his Lord;",
    "verse_58": "And rely you upon the Living One Who will never die and glorify Him admiring. And Sufficient is He, Aware of the sins of His bondmen.",
    "verse_59": "Who made heavens and earth and whatever is between them in six days, then He settled Himself on the throne befitting His Dignity. The Most Affectionate -- Ask you then concerning Him anyone who knows.",
    "verse_60": "And when it is said to them, prostrate yourselves before the Most Affectionate, they say, 'What is the Most Affectionate? Shall we prostrate to such whom you bid to us?' And this order increased their aversion.",
    "verse_61": "Most blessed is Hs Who made constellations in the sky and placed therein a lamp and a shining moon.",
    "verse_62": "And it is He Who has made the night and day changing one after the other, for him who wishes to pay attention or intends to be grateful.",
    "verse_63": "And the bond-men of the Most Affectionate are those who walk on the earth modestly and when the ignorant address them, they say, 'peace'.",
    "verse_64": "And those who pass the night for their Lord in prostration and standing.",
    "verse_65": "And those who request, 'O Our Lord, avert from us the torment of the Hell; undoubtedly, its torment is inseparable!",
    "verse_66": "'Undoubtedly, that is a vile place of abode!'",
    "verse_67": "And those who when they expend neither exceed the limit nor they are straitened and remain in between the two on the middle path.",
    "verse_68": "And those who worship not any other god along with Allah, and kill not unjustly such soul which Allah has forbidden and do not commit adultery; and whosoever does this shall get the punishment.",
    "verse_69": "The torment shall be multiplied to him on the Day of Resurrection, and he shall abide therein forever disgraced.",
    "verse_70": "But he who repents and believes and does good deeds, then Allah will change the vices of such persons with virtues. And Allah is Forgiving, Merciful.",
    "verse_71": "And whosoever repents and does good deeds, then he turned towards Allah in a manner as it was necessary.",
    "verse_72": "And those who do not give false evidence and when they pass by anything vain, pass on keeping their dignity.",
    "verse_73": "And those who when they are reminded of the signs of their Lord fall not thereat deaf and blind.",
    "verse_74": "And those who submit, 'O Our Lord, grant us from our wives and offspring the coolness of eyes and make us the leader of those who guard themselves against evil!'",
    "verse_75": "Those shall be rewarded with the highest upper apartment of the paradise, the recompense of their patience, and they will be received therein with greetings and peace.",
    "verse_76": "They shall abide therein forever, what a decent place of abode and habitation.",
    "verse_77": "Say you, ‘You are of no value to my Lord, if you do not worship Him. Then indeed you belied, therefore now there will be a cleaving torment?"
   },
    "count": 77
}
