{
    "name": "al-Isra'",
    "index": "017",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Holy is He Who carried His bondman by night from the sacred Mosque to the Aqsa Mosque around which We have put blessings that We might show him Our grand signs. No doubt, He is the Hearing, the Seeing.",
    "verse_2": "And We gave Musa the Book and made it a guidance to the children of Israel that take not any other as Disposer of affairs besides Me.",
    "verse_3": "O You the offspring of those whom We bore with Nuh (Noah)! No doubt, he was a great thankful bondsman.",
    "verse_4": "And We revealed to the children of Israel in the Book that certainly you shall create mischief in the earth twice, and necessarily you shall be proud excessively.",
    "verse_5": "Then when the promise of first time came to them, We sent against you Our bondmen as the strong warriors, then they entered into the cities for your search, and it was a promise to be fulfilled.",
    "verse_6": "Then We made your attack turned over them, and helped you with wealth and sons and increased your band in number.",
    "verse_7": "If you will do good, will do for yourself and if you will do bad, it will be for you. Then when the promise of the second time came that the enemies might deface your faces, and enter into the Mosque as they had entered it first time and may destroy utterly whatsoever may fall under their power.",
    "verse_8": "It is near that your Lord may show His Mercy over you, and if you again create mischief, then We shall again turn towards Our torment. And We have made the Hell a prison for the infidels.",
    "verse_9": "No doubt, this Quran shows that path which is straightest and gives good tidings to the believers who do good deeds that they shall have a great reward.",
    "verse_10": "And that those who do not believe in the Hereafter, We have prepared for them a painful torment.",
    "verse_11": "And the man prays for bad as he prays for good. And the man is very hasty.",
    "verse_12": "And We made night and day as two signs, then put the sign of the night blotted and the sign of the day shining, that you may seek grace of your Lord (Allah) and that you may know the numbering of years, and the reckoning. And We have explained well everything separately.",
    "verse_13": "And We have tied to his neck the destiny of every man. And We shall bring out for him on the Day of Judgement a writing which he will find wide open.",
    "verse_14": "It will be said to him, 'Read your book. Today you yourself is good for your reckoning.'",
    "verse_15": "Whosoever came to guidance, he came to guidance for his own good, and whosoever strayed, he strayed for his own evil. And no soul bearing burden will bear the burden of another. And We are not to torment until We have sent a Messenger.",
    "verse_16": "And when We intend to destroy any town, We send Our Commands to its well-to-do people, then they disobey therein, then the word is fulfilled on it, then We destroy it with complete ruination.",
    "verse_17": "And many a generation We have destroyed after Nuh. And your Lord is Sufficient as being Aware and Seer of the sins of His bondmen.",
    "verse_18": "Whosoever desires this hastily world, We soon give him in it whatever We please to whom We intend; then We assign to him the hell, wherein he will enter despised, being kicked.",
    "verse_19": "And whosoever intends here after and strives therefor as it should be striven for and he is a believer, then their striving succeeded.",
    "verse_20": "We do extend Our help to all these as well as those out of the bestowing’s of your Lord. And there is no check on the bestowing of your Lord.",
    "verse_21": "See you how We have preferred one over the other? And without doubt the Hereafter is greatest in degrees and greatest in preferment.",
    "verse_22": "O listener! Set up not another god with Allah lest you will remain sitting down despised and helpless.",
    "verse_23": "And your Lord commanded to worship not any else except Him and do good to parents. If either or both of them reach old age before you, utter not even a faint cry to them and chide them not and speak to them the word of respect.",
    "verse_24": "And spread for them the arm of humility with tender heart and say, 'O my Lord! Have mercy on these both as they both brought me up in my childhood.'",
    "verse_25": "Your Lord knows well what is in your hearts, if you be righteous, then no doubt, He is forgiving to those who repent.",
    "verse_26": "And give kinsmen their right and to the needy and the traveler and spend not extravagantly.",
    "verse_27": "No doubt, the extravagant are the brothers of the Devils (Satans). And the devil is very ungrateful to his Lord.",
    "verse_28": "And if you turn your face from them in seeking the mercy of your Lord for which you have hope, then speak to them a gentle word.",
    "verse_29": "And keep not your hand tied with your neck, nor open it completely lest you sit down, blamed, tired.",
    "verse_30": "No doubt your Lord extends the provision for whom He pleases and He straitens. No doubt He knows well, sees His bondmen.",
    "verse_31": "And kill not your children for fear of poverty; We shall provide them and you too. No doubt their murder is a great error.",
    "verse_32": "And approach not adultery, undoubtedly that is immodesty and a very vile path.",
    "verse_33": "And kill not any soul, which Allah has forbidden, without right. And whoso is killed without right, then undoubtedly We have given authority to his heirs, but he should not exceed the limit in killing. Necessarily he is to be helped.",
    "verse_34": "And approach not the property of the orphan, but by a way which is best, until he reaches his maturity and fulfil the promise, undoubtedly the promise is to be questioned of.",
    "verse_35": "And measure full when you measure, and weigh with an even balance. This is better and its end is good.",
    "verse_36": "And go not after that thing of which you know not. No doubt the ear and the eye and the heart all are to be questioned of.",
    "verse_37": "And walk not in the earth boastfully, undoubtedly, you shall never cleave the earth, and shall never reach to the mountains in the height.",
    "verse_38": "The evil thing of all these is not liked by your Lord.",
    "verse_39": "This is of those revelations which your Lord has sent to you of wisdom. And O listener! Set not another god with Allah lest you be thrown in the hell, taunted, being kicked.",
    "verse_40": "Has your Lord picked you for sons and made for Himself daughters from the angels? No doubt, you speak boastfully!",
    "verse_41": "And no doubt, We explained in this Quran variedly that they may understand. And nothing is increased in them by it but hatred.",
    "verse_42": "Say you, 'If there had been other gods with Him as they say, then they would have sought out any way towards the Owner of the Throne.",
    "verse_43": "Holy and High, most High is He above of what they say.",
    "verse_44": "The' seven heavens and earth and whoever is in them speak of His Glory. And there is nothing which might not speak of His Glory praising Him, yes you understand not their glorification. No doubt, He is Forbearing, Forgiving.",
    "verse_45": "And 'O beloved! When you recited Quran, We placed between you and those who do not believe in the Hereafter a hidden veil.",
    "verse_46": "And We have put coverings over their hearts lest they should understand it and in their ears a heaviness. And when you remember in Quran your Lord alone, they run away turning their back hatefully.",
    "verse_47": "We know well for what they hear, when they put their ears towards you and when they counsel together, when the unjust say, 'You follow not but such a man who has been enchanted.'",
    "verse_48": "See how they have propounded similitudes for you, then they have gone astray that they cannot get a way.",
    "verse_49": "And said, 'What! when we shall become bones and broken particles, shall we be raised really as new creation?'",
    "verse_50": "Say you, 'Be stones or iron.",
    "verse_51": "'Or any other creation which may be bigger in your thinking,' then now they will say, 'Who will create us again.' Say you, 'He Who created you for the first time,' now then they will say shaking their heads, jesting towards you, 'When is it?' Say you. 'Perhaps it may be near.'",
    "verse_52": "The day when He will call you, then you will come praising Him and will think that you tarried not but little.",
    "verse_53": "And say to My bondmen that they should speak that which is best. No doubt the devil (Satan) provokes strife among them. Verily the devil is an open enemy to man.",
    "verse_54": "Your Lord knows you well, He will have mercy upon you if He please, or He will torment you if He please. And We have not sent you as guardian over them.",
    "verse_55": "And your Lord knows well those that are in the heavens and in the earth. And undoubtedly, We preferred one over the other in Prophets and gave Daud (David) Zaboor (a Scripture, that is the book of Psalms).",
    "verse_56": "Say you, 'call them whom you think besides Allah,' then they have no authority to remove affliction from you nor to avert it.",
    "verse_57": "Those chosen bondmen whom these infidels worship, they themselves seek access towards their Lord that who is nearer to Him in them, they hope for His mercy and fear His torment. No doubt, the torment of your Lord is a thing to be feared.",
    "verse_58": "And there is no town but that We shall destroy it before the Day of Judgement or will torment it severely. This is written down in the Book.",
    "verse_59": "And We abstained from sending such signs because the former people belied them. And We gave Thamud a she-camel as an eye-opener, then they wronged her. And We send not such signs but to frighten.",
    "verse_60": "And when We said to you, 'All are under the control of your Lord.' And We made not the vision which We had showed you but as a test for the people and also the tree upon which there is a curse in Quran. And We frighten them; then nothing increases them but a great contumacy.",
    "verse_61": "And when We commanded angels to prostrate before Adam, then they all prostrated except the Iblis. He said, 'Shall I prostrate before him whom you have made of clay?'",
    "verse_62": "He said, 'See You, this whom You have honored above me; if You will grant me time till the Day of Judgement, then I shall assuredly crush his children but a few.",
    "verse_63": "He said, 'Get away, therefore whoso of them will follow you, then the recompense of you all is Hell, a full punishment.",
    "verse_64": "'And stagger whosoever of them you can with your voice and mobilize against them your horsemen and your footmen and share with them in their wealth and their children and promise them.' And the Devil (Satan) promises them not but with delusion.",
    "verse_65": "'No doubt those who are My bondmen, you have no control over them. And your Lord suffices as Guardian.'",
    "verse_66": "Your Lord is He who speeds for you the ship in the sea, so that you may seek His grace. No doubt He is Merciful to you.",
    "verse_67": "And when any trouble approaches you in the sea, then all whom you worship except He are lost. Then when He delivers you towards land, then you turn away your faces. And the man is very ungrateful.",
    "verse_68": "Have you then become fearless of that He may cause to sink the shore of the land with you or send you stone-storm; then you will find no supporter for your selves?",
    "verse_69": "Or have you become fearless of that He may carry you back in the sea for the second time, then send you a ship breaking storm-blast, then He may cause you to drown because of your infidelity, then you will not find for yourselves anyone who may pursue against Us?",
    "verse_70": "And no doubt, We honored the children of Adam and got them ride in the land and sea and provided them with clean things and preferred them over many of Our creations.",
    "verse_71": "The Day when We shall call every people with their leaders, then whosoever is given his record in his right hand, they shall read their records and their rights shall not be suppressed a single thread.",
    "verse_72": "And whosoever be blind in this world, he is blind in the Hereafter, and even more astray from the way.",
       "verse_73": "And indeed it was near that they would have seduced you from Our revelation sent to you, that you might relate something other than that towards Us, and if it would have been so, then they would have certainly you as their fast friend.",
    "verse_74": "And if We had not kept you firm, then it was near that you would have inclined towards them a little.",
    "verse_75": "And if it would have been so, then We would have let you taste the double life and double death, then you would not have found any helper against Us.",
    "verse_76": "And undoubtedly, it was near that they might startle you from this land so that they might oust you therefrom and if it would have been so, then they would not have stayed after you but a little.",
    "verse_77": "The tradition of those whom We sent before you as Messengers and you would not find Our law changing.",
    "verse_78": "Establish prayer from declining of the sun till the darkening of the night, and the Quran of the dawn. No doubt angels are present in the Quran of the dawn.",
    "verse_79": "And offer Tahajjud (a prayer preferably in the later part of the night after waking up from sleep) in some portion of the night, this is especially for you in addition. It is near that your Lord may make you stand at a place where all should praise you.",
    "verse_80": "And submit like this, 'O my Lord, make me enter with a just entering and make me go forth with a just going and grant me from Yourself a helping control.'",
    "verse_81": "And say, 'The truth has come, and falsehood vanished. Undoubtedly the falsehood was certain to vanish.'",
    "verse_82": "And We send down in Quran that which is a healing and a mercy to the believers; and it adds only loss to the unjust.",
    "verse_83": "And when We bestow favour on man, he turns away his face and moves far away towards himself, and when evil touches him, then he becomes disappointed.",
    "verse_84": "Say, 'All act in their own manner. Then your Lord knows well who is best guided.'",
    "verse_85": "And they ask you about the spirit. Say 'The spirit is a thing by the command of my Lord and you did not receive the knowledge but a little.'",
    "verse_86": "And if We pleased, We could take away that We have revealed to you, then you would have found none to plead for you before Us.",
    "verse_87": "But mercy from your Lord. Undoubtedly His grace to you is greater.",
    "verse_88": "Say you, 'If men and jinn all agreed together to bring the like of this Quran, then they could not produce the like thereof, even though in them one may be helper of other.'",
    "verse_89": "And undoubtedly, We have in this Quran described every kind of sayings in various ways, then most of men accepted nothing but being ungrateful.",
    "verse_90": "And they said, 'We shall never believe you unless you cause a spring to gush forth for us from the earth.",
    "verse_91": "'Or you have a garden of date palms and vines, then you cause springs to gush forth.",
    "verse_92": "'Or you may cause the heaven to fall upon us in pieces as you have asserted, or bring Allah and the angels as surety.",
    "verse_93": "'Or you have a house of gold or you ascend up into heaven and we shall never believe even after your ascending up until you send down to us a book that we may read.' Say you, 'Glory be to my Lord; who am I, but a man sent by Allah.'",
    "verse_94": "And what prevented men from believing when the guidance came to them, but this that they said, 'Has Allah sent down a man as Messenger?'",
    "verse_95": "Say you, 'If there would have been angels in the earth walking about in peace, then We would have certainly sent down an angel as Messenger to them.'",
    "verse_96": "Say you, 'Sufficient is Allah for a Witness between me and you; undoubtedly, He knows and sees His bondmen.'",
    "verse_97": "And he whom Allah guides, is the only on the right way, and he whom He leads astray, then for them you will not find any supporter besides Him. And We shall raise them on the Day of Resurrection on their faces, blind dumb and deaf. Their abode is Hell, whenever it will come to be extinguished, We shall make it blow in flames vigorously.",
    "verse_98": "This is their punishment because they rejected Our signs and said, 'Shall when we become bones and broken particles, then shall we really be raised up as a new creation?'",
    "verse_99": "And whether they see not that Allah, Who made heavens and earth, can make the like of them, and He has appointed for them a term in which there is no doubt. But the unjust accept not except being ungrateful.",
    "verse_100": "Say you, 'If you would have been owners of the treasures of the mercy of my Lord, you would surely hold them back for fear of spending. And the man is a big miser.'",
    "verse_101": "And undoubtedly We gave nine clear signs to Musa, then ask the children of Israel; when he came to them, then Firawn said 'to him, 'O Musa, in my opinion you have been hypnotized (bewitched).'",
    "verse_102": "He said, 'Certainly you know well that none sent these down except the Lord of the heavens and earth as opener of the eyes of heart, and in my opinion, O Firawn, you are necessarily to be ruined.'",
    "verse_103": "Then he desired to oust them from the land, then We drowned him and all his associates.",
    "verse_104": "And We said to the children of Israel after him, 'Dwell in this land, then when the promise of the Hereafter will come, We shall bring you all rolled together.'",
    "verse_105": "And We sent down Quran with truth and it has come down for truth and We sent you not but as the bearer of glad tidings and as warner.",
    "verse_106": "And We sent down Quran in pieces so that you may read it to mankind at intervals and We sent it down gradually bit by bit.",
    "verse_107": "Say you, 'Believe in it or believe not. Certainly those who got knowledge before it was sent down do fall down prostrate on their faces, when it is recited to them.'",
    "verse_108": "And say, 'Glory be to our Lord; undoubtedly, the promise of our Lord was to be fulfilled.'",
    "verse_109": "And they fall down on their faces weeping, and this Quran increases their hearts leaning.",
    "verse_110": "Say you, 'Call upon Him saying Allah or saying Rahman (Most Affectionate) which so ever you call upon, all are His good names, and neither offer your prayer with loud voice nor with too low voice and seek a way in between.'",
    "verse_111": "And say, 'All praise to Allah, Who has not taken Him a son and no one is partner in His Kingdom and none is supporter of Him because of weakness, and proclaim His Greatness Magnifying.'"
 },
    "count": 111
}
