{
    "name": "al-Baqarah",
    "index": "002",
    "verse": {
        "verse_0": "Allah in the name of The Most Affectionate, The Merciful.",     
  "verse_1": "Alif-Lam-Mim (Individual Letters of Arabic Alphabet)",
  "verse_2": "That high rankerd Book (Quran) Whereof there is no place of doubt, in it there is guidance to the God-fearing.",
  "verse_3": "Who believe without seeing, and establish prayer and spend in Our path, out of Our provided subsistence.",
  "verse_4": "And who believe in what has been sent down towards you, O beloved prophet! And what has been sent down before you and are convinced of the Last Day.",
  "verse_5": "They alone are on the guidance from their Lord and they alone are the gainers.",
  "verse_6": "Surely as to those who are destined to infidelity, it is alike whether you warn them or warn them not, they will never believe.",
  "verse_7": "Allah has set a seal on their hearts and on their ears; and over their eyes, there is a dark covering, and for them is great torment.",
  "verse_8": "And some people say, have believed in Allah and the Last Day; yet they are not believers.",
  "verse_9": "They seek to deceive Allah and the believers, and in fact they deceive not but their own souls, and they perceive not.",
  "verse_10": "In their hearts is a disease, so Allah has increased their disease and for them is a painful torment, the recompense of their lies.",
  "verse_11": "And when it is said to them, create not disorder on the earth, they say, ‘we are but reformists’.",
  "verse_12": "Beware! it is they who are the mischief-makers, but they perceive not.",
  "verse_13": "And when it is said to them ‘believe as other have believed’, they say, ‘shall we believe as fools believed’. Beware! It is they who are the fools, but, they do not know.",
  "verse_14": "And when they meet believers, they say, ‘we believe’, and when they are alone with their devils, they say, ‘we are with you, we are only mocking’.",
  "verse_15": "Allah mocks at them (befitting His Dignity) and leaves them to wander about in their contumacy.",
  "verse_16": "They are those people who purchased error for guidance but their trade earned them no profit, and they indeed know not the way of trading.",
  "verse_17": "Their example is like the one who kindled a fire, so when it lit up all around him, Allah took away their light and left them in darkness where noting is seen.",
  "verse_18": "Deaf, dumb, blind, so they are not to return.",
  "verse_19": "Or like a rain pouring from the sky, wherein is darkness and thunder and lightning, they thrust finger in their ears because of the thunderclaps, for fear of death and Allah has encompassed the disbelievers.",
  "verse_20": "It so seems that the lightning would snatch away their sights, whenever there is some flashing they walk therein and when it is dark, they stand still, and if Allah willed, He would have taken away their ears and sights, surely Allah can do everything.",
  "verse_21": "O, mankind! Worship your Lord Who has created you and those before you, haply you may become pious.",
  "verse_22": "And Who made the earth a bed for you, and the sky a structure and caused water to come down from heaven hence brought forth therewith some fruits for your food, therefore do not se up equals for Allah knowingly.",
  "verse_23": "And if you are in some doubt, concerning what We sent down upon Our special devotee, then bring one chapter like it, and call upon all your helpers besides Allah, if you are truthful.",
  "verse_24": "Then if you cannot bring and We declare that you can never bring, hence dread the fire whose fuel is men and stones; it is prepared for the disbelievers.",
  "verse_25": "And give glad tidings to those who accepted faith and did good deeds that for them there are gardens under which flow streams. Whenever they would be provided with a fruit to eat, they would say seeing its shape this is the same subsistence which we got before and that was given to them resembling in shape, and for them there are pure mates and therein they will abide forever.",
  "verse_26": "Surely, Allah is not ashamed of describing anything for illustration, be it a gnat or above it, hence those who accepted faith, they know that it is the truth from their Lord; and those who are disbelievers, they say, “What does Allah mean by such a similitude”. Allah sends astray many by it and guides many and sends astray those by it who are disobedient.",
  "verse_27": "Those who break the covenant of Allah after its confirmation and sever that which Allah ordered to join and spread disorder in the earth, they are the only losers.",
  "verse_28": "How you will disbelieve in Allah, whereas, you were dead, He gave you life, then will cause you to die then again will give you life, then towards Him you will return.",
  "verse_29": "He is Who created for you all that is in the earth, then turned toward the heaven, then formed seven heavens correctly and He know all and everything.",
  "verse_30": "And recall when your Lord said to the Angels, “I am about to place a vicegerent in the earth, they said, “will You place such who will spread disorder therein and shed blood”? and We praise You commending You and sanctify You”, He told, ‘I know what you know not’.",
  "verse_31": "And Allah the Exalted taught the names of all things to Adam, Then presenting all things before the Angels said, “Tell the names of these, if you are truthful”.",
  "verse_32": "They said, “Sanctity to You”, We know nothing but what You taught us, no doubt, You alone are the Knower and the Wise”.",
  "verse_33": "He Said, “O Adam tell them the names of all thing, when Adam had informed them of the names of all, He told, had not told you that I know all the hidden things of the heavens and earth, and I know whatever you disclose and whatever you hide.",
  "verse_34": "And recall, when We ordered the angels to prostrate before Adam, then all prostrated save Iblees. He refused and boasted and became disbeliever.",
  "verse_35": "And We said, “O Adam dwell you and your wife in this paradise and eat freely thereof where you will, but do not approach this tree lest you become of the transgressors.",
  "verse_36": "The Satan made them slip and got them out from the place where they lived, and We said, “Get down, one of you is the enemy of the other and you have to stay in the earth and to make use of it for a time”.",
  "verse_37": "Then Adam learnt certain words from his Lord, so Allah accepted his penitence. Surely, He is the alone most Relenting, Merciful.",
  "verse_38": "We said, “You all, get down from the paradise then if any guidance comes to you from Me, then whosoever followed My guidance, they have no fear nor any grief.",
  "verse_39": "“And those who disbelieve and shall belie My sings, they are the people of the hell, they have to live in it forever”.",
  "verse_40": "O, children of Yaqoob, recall My, that favor Which I bestowed upon you and fulfill My covenant; and you dread Me alone.",
  "verse_41": "And believe in what I sent down confirming that which is with you and be not the first rejecter of it and accept not small price for My sings and dread Me alone.",
  "verse_42": "And confound not the truth with falsehood and conceal not the truth knowingly.",
  "verse_43": "And establish prayer and pay the Zakat (poor due) and bow with those who bow.",
  "verse_44": "Do you order righteousness to mankind and forget yourselves whereas you read the Book? Then, have you no sense?",
  "verse_45": "And seek help in patience and prayer, and surely, the prayer is hard indeed save to those who lean towards Me with their hearts.",
  "verse_46": "Who are sure that they have to meet their Lord and to return unto Him alone.",
  "verse_47": "O’ children of Yaqoob! Recall My that favor which I bestowed upon you, and exalted you over the entire world in your time.",
  "verse_48": "And fear the day, when no soul shall be a substitute for another, and not any intercession be accepted for the infidels and nor his soul be freed for any compensation and nor shall they be helped.",
  "verse_49": "And recall when We delivered you from the Pharaoh’s people that afflicted you with grievous torment, slaughtering your sons and keeping your daughters alive and in this there was a great trail or great reward from your Lord.",
  "verse_50": "And when We divided the river for you, then saved you and drowned Pharaoh’s people before your eyes.",
  "verse_51": "And We made a promise of forty nights with Moses, then after him, you began worshipping a calf and you were unjust.",
  "verse_52": "Then We pardoned you after that, so that you might be grateful.",
  "verse_53": "And when We gave the Book to Moses and Criterion to judge between right and wrong, so that you might be on right path.",
  "verse_54": "And when Moses said to his people, “O my people, you have done injustice to your souls by taking the calf, turn therefore towards your Creator, then kill amongst yourselves each other. That is better for you with your Creator, so He accepted your penitence. Surely, He is alone the most Relenting, Merciful”.",
  "verse_55": "And when you said, “O Moses, we shall never believe you until we see Allah manifestly”, then the thunderbolt overtook you, while you were looking.",
  "verse_56": "Then We made you alive after your death, so that you might be grateful.",
  "verse_57": "And We made cloud your shade and sent down on you Manna and Salwa, eat of Our good things, provided by Us, and they did no harm to Us, yes they had harmed their own souls.",
  "verse_58": "And when We said, “Go into this town, then eat freely there from wherever you will, and enter the gate prostrating and say, ‘forgive our sins’, We shall forgive your sins and it is possible that more be given to the right doers.",
  "verse_59": "Then the unjust changed the words besides that which had been told, so We sent down upon them a scourge from heaven, in lieu of their disobedience.",
  "verse_60": "And when Moses asked water for his people, then We said, “Strike this rock with your staff”, at one, there gushed forth twelve springs there from. Each group knew its drinking place. Eat and drink of what Allah has provided and do not wander in the earth raising mischief.",
  "verse_61": "And when you said, “O Moses, We will not remain content with one food, pray then to your Lord that He bring forth for us of what the earth grows, some vegetables and cucumbers and wheat and lentils and onions”, said, “Do you demand inferior thing in exchange of the superior”? Well get down in Egypt or in any city, there you shall get that which you demanded, and humiliation and poverty were stamped upon them and drew in the wrath of Allah. This was in lieu of their refusal of the sings of Allah and slaying the prophets unjustly. This was due to their disobedience and transgression.",
  "verse_62": "Surely, those who believed, and the Jews and the Christians and the Sabians, whoever have faith with true hearts in Allah and in the Last Day and do good deeds, their reward is with their Lord, and there shall be no fear for them nor any grief.",
  "verse_63": "And when We took a covenant from you and raised high above you the mount Toor, hold firmly to what we give you, and remember what is therein, in the hope that you may become God-fearing.",
  "verse_64": "Then you turned back therefore, so if there had been no grace of Allah and His mercy upon you, then you would have been among the losers.",
  "verse_65": "And, undoubtedly, you surely know, those among you who rebelled in the matter of Saturday (Sabbath). So We said to them, “Be Apes, despised”.",
  "verse_66": "Thus We made this event of that town a warning to those of the present and to those after them and a lesion to the God-fearing.",
  "verse_67": "And when Moses said to his people, “Allah commands you to slaughter a cow”, they said, “you make us a laughing stock”. He said, “Refuge of Allah that I be among the ignorant”.",
  "verse_68": "They said, “Pray to your Lord that He tell to us, what kind of the cow is”, he said, Says, He, she is a cow, neither old nor immature, but in between both”, so do what you are commanded.",
  "verse_69": "They said, “Pray to your Lord that He tell to us what her color is, he said, “Says He, she is a yellow cow, whose color is intensely deep, delightful to the beholders”.",
  "verse_70": "They said, “Pray to Your Lord that He explain clearly to us, what kind of cow is that. Certainly, we have become dubious about cows, and if Allah wills, we shall get the guidance”.",
  "verse_71": "(Moses) said, “Says He that she is a cow, no service is taken from her nor she ploughs the earth, nor water the tilth, un-blemish in which there is no spot”. They said, “Now you brought the truth”, then they slaughtered her and were not willing to slaughter.",
  "verse_72": "And when you shed a blood, then began accusing for it each other and Allah was to disclose what you were hiding.",
  "verse_73": "Then We said, “Strike with a part of that cow to the slain. Allah thus will give life to the dead and shows you His Signs, so that you may understand”.",
  "verse_74": "Then, thereafter your hearts hardened, then they are like stones, but harder than these; and of stones there are some from which rivers gush forth and some are those which split, then water comes there from and there are some which fall down for fear of Allah, and Allah is not unmindful of your doings.",
  "verse_75": "Then O Muslims! Do you covet that the Jews would believe you, and one group of them was that which used to hear the words of Allah, then used to pervert it knowingly after having understood it.",
  "verse_76": "And when they meet Muslims, they say, ‘we accepted the faith, and when they are alone among themselves, then they say, “Do you explain to Muslims that knowledge which Allah disclosed to you, that they there by with you before your Lord. Have you no wisdom?",
  "verse_77": "Do they not know that Allah knows all that they conceal and all that they disclose?",
  "verse_78": "And some of them are illiterate who do not know the Book, but oral reading or their own false notions and they are in mere supposition.",
  "verse_79": "Then there is woe for them who write the Book with their own hands and then say, “This is from Allah”, so that they may gain small price in lieu of it. Then there is woe for them for the writings of their own hands and woe to them for such earning.",
  "verse_80": "And they said, “The fire shall not touch us except for numbered days”, say then, have you taken a promise from Allah, then Allah, will never break His Promise. Or you say about Allah that which you do not know.",
  "verse_81": "Aye, why not who so earns vice and his sin encompasses him, he is one among the people of the hell, they have to remain therein forever.",
  "verse_82": "And those who accepted faith and did good works. They are the people of Paradise. They have to remain therein forever.",
  "verse_83": "And when We took covenant from the children of Israel that worship none save Allah and do good to parents and to kindred, and orphans and the needy and speak good to people and establish prayer and pay the poor due (zakat); then you turned back, except a few among you and you are backsliders.",
  "verse_84": "And when We took a covenant you, that shed no blood of your own and turn not out your own people from your own towns, then you affirmed it and you are witnesses.",
  "verse_85": "Then it is you who began slaying your own people and turn out a group of your own people from their homeland, provide help to (their opponents) against them in sin and transgression, and if they come to you as captive, you ransom them, and their expulsion is unlawful for you. Do you then have faith on some commandments of God and refuse some other. Then who so of you do such, what is the reward of it, save disgrace in the world, and on the Day of Resurrection, they shall be driven towards severest torment, and Allah is not unaware of your doings.",
  "verse_86": "These are the people who purchased the life of the world for the life of hereafter, so neither the torment shall be lightened from over them nor they shall be helped.",
  "verse_87": "And verily, We gave Moses the Book and after him sent the Messengers one after another, repeatedly, and gave clear signs to Jesus, son of Mary, and helped him with the Holy Spirit. Then, do you grow arrogant, when any Messenger came to you with what your soul desire not? So belie you a group of them (Prophets) and slay another group.",
  "verse_88": "The Jews said, “Our hearts are wrapped with covers, Nay Allah cursed them because of their blasphemy, so little of them accept faith.",
  "verse_89": "And when there came to them that Book (Quran) of Allah, which confirms the Book (Taurat) with them, and before that they were asking for victory over the infidels by means of the same Prophet. Then, when came to them that known and recognized one, they rejected him. So Allah’s curse on those who reject.",
  "verse_90": "They sold their souls, for what a miserable price that they deny what Allah has sent down, with this jealousy that, Allah of His grace send revelation on whomsoever of His devotees He pleases. Thus they became worthy of wrath upon wrath and there is humiliating torment for the infidels.",
  "verse_91": "And when it is said to them, “Have faith in what Allah has sent down”, then they say, “We have faith in what has been sent down to us and reject the rest, though it is the truth confirming what is with them. Say you, ‘why did you then kill former Prophets, if you had faith upon your Book”?",
  "verse_92": "And assuredly Moses came to you with clear signs, then after that you made the calf a god and you were unjust.",
  "verse_93": "And recall, when We took a covenant from you and raised above your heads the mountain Tur, hold what We give to you with firmness and listen. They said, “We heard and did not accept”, and the calf was permeating in their hearts because of their infidelity. Say then, “What a vile command is given to you by your faith, if at all you have faith.",
  "verse_94": "Say you: 'If the last home near Allah be for you solely, not for others, then well, long for death, if you are truthful.",
  "verse_95": "And they will never long for it ever, because of their evil deeds which they have done before and Allah knows the unjust well.",
  "verse_96": "And undoubtedly, you will find them that they are necessarily most coveters of life even more than of all the people. And of idolaters, one is desirous of having a life of thousand years, and that will not keep him away from the torment, even being granted such life. And Allah is seeing their doings.",
  "verse_97": "Say you, 'whoever be the enemy of Jibreel, then he (Jibreel) caused to descend on your heart this Quran by the Command of Allah, Confirming the former Books, and there is guidance and glad tidings to Muslims'.",
  "verse_98": "Whoever be the enemy of Allah and His angels and His Messengers and Jibreel and Mikael, then Allah is the enemy of infidels.",
  "verse_99": "And undoubtedly, We sent down towards you manifest Signs; and none will be denying them but the disobedient.",
  "verse_100": "And is it that whenever they enter into a covenant, one party of them throws it out; nay, most of them have no faith?",
  "verse_101": "And when came to them a Messenger from Allah confirming their Books. A party of the people of the Book threw away the Book of Allah behind their backs, as if they had no knowledge.",
  "verse_102": "And they followed that which were being recited by the devils in the reign of Sulaiman (Solomon) and Sulaiman did not disbelieve; nay, the devils disbelieved. They teach magic to people and that (Magic) which was sent down unto the two angels Harut & Marut in Babel (Babylon). But both did teach nothing to anyone till they did not say this, \"We are nothing' but trial\", then do not therefore lose your faith. They learnt that from them by which they might cause separation between man and his wife, and they cannot harm anyone, but by the command of Allah. And they learn that which will harm them, and will not profit. And undoubtedly, they know that one who took this trade has no share in the hereafter; and undoubtedly, what the evil thing is that for which they sold their souls; had they known!",
  "verse_103": "And if they had accepted faith and kept themselves aloof from sins; then there is better reward from Allah; had they known!",
  "verse_104": "O men of Faith, do not say: Raina, but say humbly, respected Sir, \"look upon us\", and from the very beginning listen carefully, and for the disbelievers is a grievous torment.",
  "verse_105": "Those who are infidels, whether people of the book or idolaters, do not desire that any good should be sent down to you from your Lord and Allah chooses for His Mercy, whomsoever He pleases and Allah is of Exceeding Bounty.",
  "verse_106": "When any verse We abrogate or cause to be forgotten, then shall bring one better or the like thereof. Do you not know that Allah can do all and everything?",
  "verse_107": "Do you not know that the sovereignty of heavens and earth is only for Allah and besides Allah, you have neither any supporter nor helper?",
  "verse_108": "Do you wish to question your Messenger as Moses was questioned before; and whoever exchanges faith for unbelief, he rightly has gone astray from the right path.",
  "verse_109": "Many of the people of the Book desired, had you been turned back towards infidelity after faith!, out of sheer envy of their hearts; after it that the truth has become manifest unto them, so leave them and overlook, till Allah brings His command. Undoubtedly Allah is Powerful over everything.",
  "verse_110": "And keep up the prayer and pay Zakat (poor-due); and whatever good you shall send forth for your souls, you shall find it with Allah. Undoubtedly Allah is seeing your doings.",
  "verse_111": "And the people of the Book spoke, 'None shall enter paradise, but he who be a Jew or Christian. These are their vain desires. Say, you 'Bring your proof, if you are truthful'.",
  "verse_112": "Yes, why not, who submitted his face for Allah and is the doer of good, then his reward is with his Lord and they have neither any fear nor any grief.",
  "verse_113": "And the Jews spoke, \"The Christians are nothing\", and Christians spoke, \"The Jews are nothing\", though they read the Book. Even thus the illiterates said the like of their saying. Then Allah will judge between them on the Day of Judgement regarding that wherein they are disputing.",
  "verse_114": "And who is more unjust than he who prevents the mosques of Allah from being mentioned the name of Allah, and strives to ruin them, it was not proper for them to enter the mosques but with fear. For them, there is dis-grace in the world and for them there is great torment in the hereafter.",
  "verse_115": "And East and West all is for Allah, then whichever side you turn your face, there is the face of Allah (The mercy of Allah inclined towards you). Undoubtedly Allah is All-Embracing, All-Knowing.",
  "verse_116": "And they say, 'Allah has taken unto Himself a son', sanctity is for Him. Nay, whatever is in the heavens and is in the earth is His possession. All are unto Him subservient.",
  "verse_117": "The Originator of the heavens and the earth, and when He decrees anything, then says to it only, 'be and it becomes at once.\"",
  "verse_118": "And the illiterates spoke, 'Why Allah speaks not to us or any sign is being given to us.' Likewise said those before them, similar to their saying. The hearts of these people and of those are alike. Undoubtedly, We manifested the signs for the persons of firm faith.",
  "verse_119": "Assuredly, We have sent you with the truth, bearer of glad tidings and a warner and you shall not be questioned about the inmates of Hell.",
  "verse_120": "And never the Jews and Christians will be pleased with you unless you follow their Deen (creed), say then, 'The guidance of Allah is the only guidance; and (O listener who he may be) if you become follower of their desires, after the knowledge that has come to you, then no one will be your protector from Allah and no helper.",
  "verse_121": "Those who have been given the Book by Us, they recite it as it ought to be, they alone have faith unto it and those who disbelieve it, they alone are the losers.",
  "verse_122": "O Children of Yaqoob! Remember My favor which I bestowed upon you and that I exalted you above all people of that period.",
  "verse_123": "And fear the day when no soul shall be a substitute for another and nor it shall be freed for any compensation, and nor any intercession will profit the infidels and nor will they be helped.",
  "verse_124": "And when his Lord tested Ibrahim with certain words, then he fulfilled them. Said He \"I am to make you leader of the people,\" submitted he \"and from my offspring\". Said He, \"My covenant does not reach the unjust.\"",
  "verse_125": "And recall, when We made this house a place of assembly for the people and a place of safety; and make the station of Ibrahim a place of prayer and We enjoined strictly upon Ibrahim and Ismail to purify well My house for those who go around it and those who stay therein for devotion and those who bow down and prostrate.",
  "verse_126": "And when Ibrahim submitted \"O my Lord make this City a region of peace and feed the inhabitants of it with varied fruits - to such of them who believe in Allah and the Last Day\", said He, \"and who became unbeliever, to him also I will give a little to use, and then shall force him towards the torment of the hell and what an evil place of return that is!",
  "verse_127": "And when Ibrahim was raising the foundations of this house and Ismail (too) praying, O Our Lord! Accept from us; undoubtedly, You alone hear and know.",
  "verse_128": "'O Our Lord, make us submissive to You and of our offspring a nation submissive to You and tell us our ways of worship and turn to us with Your mercy. Surely You alone are most Relenting and Merciful.",
  "verse_129": "'O Our Lord, and send in them a Messenger from among themselves, who may recite to them Your signs and teach them Your Book and wise knowledge and may purify them well. Surely, You are alone the Predominant, the Wise.",
  "verse_130": "And who will turn his face from the religion of Ibrahim, save one who is a foolish in heart, and undoubtedly, We necessarily, chose him in the world and surely he is among the people having ability to gain Our special proximity in the hereafter.",
  "verse_131": "When his Lord said to him, \"Surrender\", submitted he, ‘I surrendered to Him, Who is the Lord of all the worlds'.",
  "verse_132": "And Ibrahim left the legacy of the same religion to his sons and Yagoob too; that 'O my sons, surely Allah has chosen this religion for you, therefore die not, but as Muslim.",
  "verse_133": "On the contrary, some of you were present, when death came toYaqoob, when he said to his sons, 'whom will you worship after me? Said they, 'we shall worship Him Who is your God and of your fathers Ibrahim and Ismail and Ishaque, the One God and to Him we have submitted ourselves'.",
  "verse_134": "This is a community that has passed away; for them is what they earned and for you is what you earn and you shall not be questioned for their deeds.",
  "verse_135": "And the people of the book spoke, 'Be Jews or Christians you will get guidance'. Say you, 'on the contrary, we take the religion of Ibrahim who was away from every falsehood and was not among the polytheists'.",
  "verse_136": "Say like this, 'we believed in Allah and what has been sent down towards us and what was sent down on Ibrahim and Ismail and Ishaque and Yaqoob and on his children and what was given to Moses and Christ and what was given to the rest of the Prophets from their Lord; we do not differentiate between any of them in the matter of faith and we have submitted ourselves to Allah.",
  "verse_137": "Then if they believe too as you have believed, then they are guided, and if they turn back their faces, then they are but in total schism. So, 0 beloved, Prophet! soon Allah will suffice you on behalf of them. He is alone Hearing and Knowing.",
  "verse_138": "We took the dye of Allah and whose dye is better than Allah and we worship Him alone.",
  "verse_139": "Say you, 'Do you dispute about Allah, though He is our Lord and yours too: and our doings are with us and your doings with you, and we belong totally to Him alone.",
  "verse_140": "On the contrary, you say like this, that Ibrahim, and Ismail and Ishaque and Yaqoob and his sons were Jews or Christians; say then, 'have you more knowledge or Allah. And who is more unjust than he who has the testimony from Allah and he conceals it and Allah is not unmindful of your doings.",
  "verse_141": "That is a community that has passed away, for them are their earnings and for you are your earnings and you shall not be questioned of their works.",
  "verse_142": "Now the fools say, who has turned the Muslims from their Qiblah on which they had been Say you: 'East and West all belong to Allah; He guides whom He likes to the right path.",
  "verse_143": "And thus We made you exalted among all nations that you may be witnesses to the people and this Messenger your guard and witness. And O beloved! We had not made that Qiblah upon which you had been before, but to see who follows the Messenger and who turns back upon his heels, and verily, indeed it was hard, but to those who were guided by Allah. And it does not behave Allah that He might waste your faith: Verily Allah is very Kind and Merciful to human beings.",
  "verse_144": "We are seeing the turning of your face towards heaven repeatedly; necessarily then We will turn you towards that Qiblah which pleases you. Turn your face towards the sacred mosque (Ka'bah) just now; and O Muslims! Turn your faces towards the same, wherever you be. And those who have been given the Book know necessarily, that this is the truth from their Lord, and Allah is not unaware of their doings.",
  "verse_145": "And even if you should bring every sign to those people of the Book, they would not follow your Qiblah. And you follow not their Qiblah; and they are not followers of each other’s Qiblah among themselves too. And (0 listener whoever he may be) if you should follow their desires after the knowledge that has been given to you, then at that time, you shall surely be of the transgressors.",
  "verse_146": "Those whom We gave the Book recognize this Prophet as man recognizes his sons and no doubt, a group of them conceal the truth knowingly.",
  "verse_147": "(O Listener) It is the truth from your Lord (or the truth is that which is from your Lord) then beware! Doubt not.",
  "verse_148": "And there is a direction of inclination for everyone, towards which, he turns his face; then desire, that you may surpass others in good deeds. Wherever you be, Allah will bring you all together. No doubt, Allah has the power to do all that He wills.",
  "verse_149": "And from whosesoever you come forth, turn your face towards the sacred Mosque (Ka'bah) and that is necessarily, the truth from your Lord and Allah is not unaware of your doings.",
  "verse_150": "And O beloved! Whomsoever you come forth turn your face towards the sacred Mosque (Ka'bah) And O Muslims! turn your faces towards the same, wherever you be, so that people may have no argument against you, but those among them who do injustice, so fear them not and fear Me. And it is for this that I may perfect My favor upon you and that you may be rightly guided." ,
    "verse_151": "As We sent in you a Messenger from among you, that he recites Our signs (verses) to you and purifies you and teaches you the Book and mature knowledge and teaches you that which you did not know.",
    "verse_152": "Therefore remember Me, I shall remember you, and accept My right and do not be ungrateful to Me.",
    "verse_153": "O believers! Seek help with patience and prayer; no doubt, Allah is with the Patients.",
    "verse_154": "And say not those who are killed in the path of Allah as dead; but they are alive, yes, you are unaware.",
    "verse_155": "And necessarily, We shall put you to test with something of fear and hunger and with some loss of wealth and lives and fruits; and give glad tidings to the patient.",
    "verse_156": "That when any calamity comes to them, then they say, \"We are belongings of Allah and we are to return to Him alone.\"",
    "verse_157": "These are the people on whom are the benedictions from their Lord and mercy; and they are only on the guidance.",
    "verse_158": "No doubt, Safa and Marwah are among the symbols of Allah; then who so makes pilgrimage to this House or performs \"Umrah\", there is no sin for him that he may go round both, and who so does any good voluntarily, then Allah is Appreciating and All-Knowing.",
    "verse_159": "No doubt, those who conceal what We have sent down of clear signs and guidance after that We have made it clear in the Book for the people, on them there is the curse of Allah and the curse of those who curse.",
    "verse_160": "But those who repent and amend and make manifest, then I shall accept their repentance and I am the only Relenting Merciful.",
    "verse_161": "No doubt, those who disbelieved and died as disbelievers, on them is the curse of Allah and of Angels and of men combined.",
    "verse_162": "They will ever remain in it; neither the torment shall be lightened from them and nor shall they be granted respite.",
    "verse_163": "And your God is One God, there is no God but He, most Gracious and Merciful.",
    "verse_164": "Verify, the creation of heavens and earth and coming of night and day alternately, and the boat that sails in the river for the benefit of the people, and that which Allah sent down of water from heaven, and revived the dead earth thereby and scattered all kinds of beast therein, and the change of winds and the cloud that is obedient between heaven and earth, in all of them, necessarily there are signs for the wise people.",
    "verse_165": "And some people set some other deities of worship other than Allah that they love them as they are to love Allah and the believers love not anyone equal to that of Allah. And what would be the condition, if the transgressors see the time when the torment would come before their eyes, because all power belongs to Allah and because the torment of Allah is severe.",
    "verse_166": "When those who were followed would be disgusted with their followers and would see the torment and all their ties shall be cut asunder.",
    "verse_167": "And the followers will say, \"Would that for us there were a return (in the world) then We would have broken with them as they have broken with us. Thus will Allah show them their works as anguish for them, and they are not to come out from the Fire.",
    "verse_168": "O Mankind! Eat of whatever is in earth lawful clean and follow not the steps of the Devil, no doubt, he is your open enemy.",
    "verse_169": "He will only command you to evil and indecency and that you should say of Allah what you do not know.",
    "verse_170": "And when it is said to them, 'follow what Allah has sent down, they say, 'Nay We shall follow that whereon we found our fathers, what! Even if their fathers had no sense at all and no guidance?",
    "verse_171": "And the saying of disbelievers is like him who calls unto that who hears nothing except a shout and cry; deaf, dumb, blind, so they have no sense.",
    "verse_172": "O believers! Eat our good things provided to you, and be grateful to Allah, if you worship Him alone.",
    "verse_173": "He has only made unlawful to you the carrion, and blood and the flesh of swine and the animal that has been slaughtered by calling a name other than Allah. But he who is driven by necessity to eat neither desiring, nor exceeding the need, then there is no sin on him, no doubt, Allah is Forgiving and Merciful.",
    "verse_174": "Those who conceal the Book sent down by Allah and in exchange of it accept mean price; they fill in their bellies with fire only and Allah will not talk to them on the Day or Resurrection and nor will He purify them and for them is painful torment.",
    "verse_175": "Those are they who purchased error in exchange of guidance and torment for forgiveness. Then to what degree is their endurance for fire.",
    "verse_176": "This is because Allah sent down the Book with truth, and no doubt, those who began to put difference in the Book, they are necessarily, brawlers of highest degree.",
    "verse_177": "The real righteousness is not this that you turn your face towards East or West; yes, the real virtue is this that one has faith in Allah and the Last day and the angels and the Book and the Prophets and gives his dear wealth for love of Allah to kindred and orphans and the needy and the wayfarer and the beggars and for redeeming necks, and establishes prayer and pays Zakat (poor-due); and the performers of their promises when they make promise and the patient in tribulation and adversity and at time of jihad (Holy war or crusade); These are they, who proved truth of their talks and they are only God-fearing.",
    "verse_178": "O believers! it is obligatory upon you to take retaliation of the blood of those who are killed innocently; the free for free and the slave for slave and woman for woman. Then as for him who is forgiven something by his brother; there should be demand for payment with kindness and the payment be made satisfactorily well. This is to ease your burden from your Lord and a mercy upon you. Then after this one who transgresses, for him there is painful torment.",
    "verse_179": "And there is life for you in retaliating for blood, O men of understanding! so that you may save yourselves.",
    "verse_180": "Made obligatory on you that when death approaches any of you, if he leaves some property, then he should make a will for his parents and near relatives according to usage. This is an obligation on those who fear God.",
    "verse_181": "Then whoso changes the will after hearing, the sin thereof is only on those who change it. No doubt, Allah knows and hears.",
    "verse_182": "Them who feared, that the testator has done certain injustice or sin, then he made peace between them, there is no sin for him; no doubt, Allah is Forgiving, Merciful.",
    "verse_183": "O believers! Fasting have been made obligatory upon you as were made obligatory upon those before you, so that you may become pious.",
    "verse_184": "The days are counted. Then whoso among you is ill or on a journey, then same number of fasting in other days, and those who have no strength, they should give in ransom meal to a needy; then whoso does more good voluntarily, then that is better for him, and fasting is better for you if you know.",
    "verse_185": "The month of Ramadan in which Quran was sent down, the direction for the people and guidance and clear signs of judgement; then whoso of you finds this month, necessarily, he should fast in it, and whoso is ill or on a journey, then same number of fasting in other days; Allah desires facility for you and desires not hardship and for this, that you should complete the counting and speak of the Greatness of Allah, as He guided you and so that you may be grateful.",
    "verse_186": "And O beloved, when My bondsmen ask you about Me, then I am indeed near, accept the call of the caller when he calls upon Me; then they should obey My Commands and believe in Me, so that they may get the way.",
    "verse_187": "It was made lawful for you to go near your women in the nights of fasting. They are your garments and you are their garments. ‘Allah’ knows that you used to put your souls in defalcation, then He accepted your repentance and pardoned you; then now copulate with them and seek what Allah has written in your destiny and eat and drink until white thread becomes distinct to you from the black thread at the dawn; then complete the fasts till coming of night, and do not touch the women when you remain in the mosques, for devotion. These are the limits of Allah, do not approach them. Allah thus describes His Signs to the people, so that they may become pious.",
    "verse_188": "And do not eat up unjustly the property of each other among yourselves and nor convey their cases to the authorities for devouring unlawfully some portion of the property of the people knowingly.",
    "verse_189": "They ask you about the new moons, say you, \"They are the signs of time for the people and Hajj (pilgrimage). And it is no virtue that you enter your houses by the backs thereof, yes, the virtue is piety, so come in houses by their doors and fear Allah in the hope that you may get prosperity.",
    "verse_190": "And fight in the way of Allah, those who fight against you and do not transgress, Allah does not love the transgressors.",
    "verse_191": "And kill the infidel’s wherever you find and turn them out from the place wherefrom they turned you out; and their mischief is more grievous than killing. And do not fight them near the sacred mosque unless they fight you therein; and if they fight against you, then kill them. This is the only punishment of infidels.",
    "verse_192": "Then if they desist, then no doubt, Allah is Forgiving, Merciful.",
    "verse_193": "And fight them until there remains no mischief and be there worship of One Allah, then if they desist, then there is no violence save against oppressors.",
    "verse_194": "There is forbidden month in exchange of forbidden month and elegant manner in exchange of elegant manner. Whoso does violence against you, do violence against him in the same measure as he did, and remain fearing Allah and know that Allah is with the God-fearing.",
    "verse_195": "And spend in the way of Allah, and cast not yourselves in destruction with your hand; and be good-doers; no doubt, good doers are the beloved of Allah.",
    "verse_196": "And fulfil the Hajj and Umra for Allah. Then if you are prevented, send sacrifice which you may get easily and shave not your heads, unless the sacrifice reaches its destination; Then whoso is ill of you or there is some ailment in his head, then he should keep fast in exchange or give alms or sacrifice, then when you are at ease, then whoso takes advantage by combining Umrah with Hajj, on him there is sacrifice which may be obtained easily. Then whoso cannot afford, he should fast for three days during Hajj and seven days when you return back to your home, these are ten days complete. This Command is for him who is not the dweller of Mecca; and remain fearing Allah and know that the torment of Allah is severe.",
    "verse_197": "The months of Hajj are known; then whoso determines to perform Hajj in these months, then there should be no mention of copulation before women nor any sin nor quarrelling with anyone till the time of Hajj; and whatever good you do, Allah knows it. And take necessary provision with you, the best provision is piety and remain fearing Me, O Men of understanding!",
    "verse_198": "There is no sin unto you that you seek the bounty of your Lord. Then when you return back from 'Arafat' remember Allah near Mash'are-Haraam (Qazah Mountain) and remember Him as He guided you and no doubt, you had gone astray before.",
    "verse_199": "Then the thing is this that O Men of Quraish, you also return back from the same place whence the people return back and seek forgiveness from Allah; no doubt, Allah is Forgiving, Merciful.",
    "verse_200": "Then when you have completed the acts of your Hajj, then remember Allah as you used to remember your fathers, but more than-that, and someone says like this, 'O our Lord give us in the world, ‘and there is no share of him in the Hereafter.",
    "verse_201": "And someone says like this, 'O our Lord give us good in the world and give us good in the Hereafter and save us from the torment of the Hell.'",
    "verse_202": "To such people there is share from their earnings and Allah is Swift at reckoning.",
    "verse_203": "And remember Allah during numbered days. Then whoso hastens to leave in two days, there is no sin unto him and whoso stays behind, then on him is no sin for the God-fearing, and remain fearing God and know that you have to be raised unto Him.",
    "verse_204": "And someone of men is he whose talk seems pleasing to you in the life of the world and brings Allah as a witness on what is in his heart, while he is the greatest disputer.",
    "verse_205": "And when he turns his back, then wanders spreading mischief in the land and destroys the crops and lives and Allah agrees not with the mischief.",
    "verse_206": "And when it is said to him, 'fear Allah' then he becomes more persistence in sin, to such the hell is enough and that is necessarily, a very bad bed.",
    "verse_207": "And someone of men sells his life in seeking the pleasure of Allah and Allah is Merciful over His bondmen.",
    "verse_208": "O people of Faith! Enter into Islam as a whole and do not follow in Satan's footsteps; no doubt, he is your open enemy.",
    "verse_209": "And if even after this, that clear commands have come unto you, you slip, then know that Allah is Mighty, Wise.",
    "verse_210": "What are they waiting for but for this that the torment of Allah should come in the coverings of clouds and the angels should come down and the affairs be completed and to Allah are all affairs returned.",
    "verse_211": "Ask the children of Israel how many clear signs We gave them, and whoso changes the favor of Allah after it has come, then no doubt, the torment of Allah is severe.",
    "verse_212": "The life of the world has been decorated in the eyes of infidels and they laugh at Muslims, and those who fear would be above them on the Day of Resurrection; and God bestows without counting whomsoever He pleases.",
    "verse_213": "People were on one religion; thereafter Allah sent Prophets giving good tidings and warning and sent down with them the true Book that it should judge between people in their differences. And only those differed in the Book to whom it was given after clear commands had come to them, through refraction among themselves. Then Allah showed the truth to the believers in which they were quarrelling by His command, and Allah shows the straight path whomsoever He pleases.",
    "verse_214": "Do you imagine that you will enter Paradise, and yet the incident like of your forerunners did not come unto you? The affliction and adversity reached to them and they were badly shaken until the Messenger and believers along with him said, when will come the help of Allah'? Listen! No doubt, the help of Allah is nigh.",
    "verse_215": "They ask you what they should spend. Say: whatever wealth you spend in good, then that is for parents and near relatives and orphans and the needy and the wayfarer. And whatsoever good you do, no doubt: Allah knows it.",
    "verse_216": "It was made obligatory upon you to fight in the path of God and though it is disliked by you, and it may happen that anything may be disliked by you and that may be in your favor, and it may happen that anything may be liked by you and that may not be in your favor, and Allah knows and you do not know.",
    "verse_217": "They ask you the precept for fighting in the sacred month. Say you: 'Fighting therein is a great sin; but to prohibit from the way of Allah, and not to have faith in Him and to prevent from the sacred Mosque (Haram) and to oust its dwellers, are greater sins than it with Allah; and their mischief is more grievous than killing. And they will remain fighting against you always, until they turn you back against your faith, if they can. And whoso among you turns back from his faith, then dies as an infidel, then their works shall go in vain in the world and in the Hereafter, and they are the people of Hell and will abide in it.",
    "verse_218": "Those who believed and those who left their home and hearth for Allah and fought in the way of Allah, they are the aspirants of the mercy of Allah and Allah is Forgiving, Merciful.",
    "verse_219": "They ask you the precept of wine and gambling. Say you, 'in both there is great sin and also some worldly profits for the people but their sin is greater than their profit and ask you what they ought to spend, say you, 'that which is saved after your needs'. Thus Allah explains to you His Signs so that you may do after reflecting.",
    "verse_220": "The works of the world and the Hereafter. And they ask you, the precept about orphans. Say you, 'To do good to them is better' and if you intermix your and their expenses, then they are your brothers; and Allah knows well the mischief-maker from the reformer. And had Allah so willed, He would have put you into hardship, no doubt, Allah is Mighty, Wise.",
    "verse_221": "And marry not idolatresses until they accept faith, and no doubt, a Muslim bond-maid is better than an idolatress though she may please you. And give not in marriage to idolaters until they accept faith, and no doubt, a Muslim bondman is better than an idolater, though he may please you. They call towards Hell and Allah call towards Heaven and forgiveness by His Command and explains his signs for the people so that they may accept admonition.",
    "verse_222": "And they ask you the precept about menstruation. Say You:- that is pollution, so keep away from women during menstruation and do not approach them until they are clean. Then when they are clean, go unto them whence Allah commanded you. No doubt, Allah likes the constant repentant and likes cleansers.",
    "verse_223": "Your women are tilths for you, then come in your tilth as you will, and do first the work for your good, and remain fearing Allah and know that you are to meet Him. And O beloved! Give glad tidings to the believers.",
    "verse_224": "And make not Allah the target of your oaths that you may take oath for not doing good and nor fearing Allah and nor making peace between men; and Allah hears, knows.",
    "verse_225": "Allah does not call you to account for your such oaths as they come out from your tongues unintentionally, yes, He calls you to account for what your hearts did, and Allah is Forgiving, Forbearing.",
    "verse_226": "For those who swear off from going to their wives is an awaiting of four months; hence if they go back in this period, then Allah is Forgiving, Merciful.",
    "verse_227": "And if they decided firmly to divorce, then Allah hears, knows.",
    "verse_228": "And divorced women should keep their souls away till three menstruations, and it is not lawful to them that they conceal what Allah created in their wombs. If they have faith in Allah and the Last Day. And their husbands have the right to take them back during that period, provided they will to rejoin. And the women have rights similar to those over them according to law, and men have superiority over them and Allah is Dominant, Wise.",
    "verse_229": "This divorce is for two times only; then is to retain with good or to release with kindness, and it is not allowed to you to take back something of what you have given to the women, but if both fear that they could not keep the limits of Allah. Then, if you fear that the twain shall not remain just on the same limits, then there is no sin on them for that with which the woman ransoms herself. These are the limits of Allah, do not transgress them, and whoso transgresses the limits of Allah, then they are the oppressors.",
    "verse_230": "Then if she is divorced for the third time, then now that woman will not be lawful to him, until she lives with another husband, then if that second one divorces her, then there is no sin on the twain that they come together again, if they think that they will observe the limits of Allah and these are the limits of Allah, He explains them for the learned.",
    "verse_231": "And when you divorce women and their period are completed, then, till that time either retain them kindly or release them kindly, but there should not be retention to hurt them so that you may transgress the limit and whoso does this, he wrongs his own soul, and do not make jest of the signs of Allah and remember the favor of Allah upon you, and the Book and Wisdom which He has sent down to you for admonishing you, and remain fearing Allah and know that Allah knows all things.",
    "verse_232": "And when you divorce women and their period are completed, then O guardians of women! Prevent them not from marrying their husbands, when they agree among themselves according to law. This counsel is given to him who among you have faith in Allah and the Last Day. This is cleaner and purer for you, and Allah knows and you do not know.",
    "verse_233": "And mothers should suckle their children for complete two years, for him who intends to complete the period of suckling, and to whom the child belongs, on him there is feeding and clothing of the women according to convention. No soul shall be burdened but within his capacity, the mother should not be made to suffer because of her child and nor father because of his child or (the mother should not make the child to suffer, and nor father to his child) and the same is incumbent on the father's heir. Then if the mother and father both try to wean by mutual consent and consultation, there is no sin on them; and if you wish that your children should be suckled by nurses, then too there is no blame on you, provided what was agreed to pay is paid by you with kindness; and remain fearing Allah and know that Allah is seeing your works.",
    "verse_234": "And those of you who die and leave behind wives, they should keep themselves apart for a period of four months and ten days, then when they complete their period, then 0 guardians! There is no blame on you in anything which the women do with regard to themselves according to law. And Allah is Aware what you do.",
    "verse_235": "And there is no sin on you regarding this, that you sent offer of marriage to women by giving obscure hint or hold it in your hearts. Allah knows that now you will remember them. Yes, make not with them secret contract, but say that much only which is known in law. And do not resolve wedding tie until the written term reaches its period and know that Allah knows what is in your hearts, then fear Him and know that Allah is Forgiving, Forbearing.",
    "verse_236": "There is not any demand against you if you divorce the women while you have not touched them or have fixed any dower. And give them something to carry on with the men of resources according to his means and the poor according to his means something to carry on with, this is incumbent on the well-doers.",
    "verse_237": "And if you divorced women without touching them and for them you had already fixed some dower, then what much was agreed, half of it is incumbent, but if the women forgo something or he gives more in whose hand is the tie of the marriage, and O men! Your giving more is nearer to piety. And do not forget doing good to each other among yourselves. No doubt, Allah is seeing your work.",
    "verse_238": "Watch over all your prayers and the middle prayer and stand before Allah with devotion.",
    "verse_239": "And if you are in fear, then on foot or riding, as you can, then when you are secure, remember Allah as He taught you that which you did not know.",
    "verse_240": "And those of you who die and leave behind them wives, they should bequeath for their women to provide them maintenance for a year without turning them out; then if they themselves leave, you are not accountable regarding any proper thing which they did in their matters and Allah is Dominant, Wise.",
    "verse_241": "And for divorced women too there is proper maintenance, it is incumbent on the God-fearing.",
    "verse_242": "Thus Allah explains His signs for you so that you may understand.",
    "verse_243": "O beloved! Had you not seen those who came out from their homes, and they were in thousands for fear of death? Then Allah said to them. “Die” and thereafter made them alive. No doubt, Allah is Gracious to people but most of the people are ungrateful.",
    "verse_244": "And fight in the way of Allah and know that Allah hears, knows.",
    "verse_245": "Is there any who should give a goodly loan to Allah so that Allah may increase many times for him. And Allah scants and amplifies, and you are to return unto Him.",
    "verse_246": "O Beloved! Did you not see a group of the children of Israel after Moosa? When they spoke to a Prophet of theirs, 'raise for us a king that we may fight in the way of Allah. The Prophet told, Are your styles like this that if the fighting is made obligatory on you, thereafter you may not fight'? Spoke them, 'what happened to us that we should not fight in the way of Allah, whereas we have been driven away from our homeland and from our Children? But when fighting was made obligatory on them, they turned their faces but a few of them, and Allah knows very well the unjust.",
    "verse_247": "And their Prophet said to them. 'Verily Allah has sent Talut (Saul) as your king.' Spoke they 'How can there be kingship of him over us, whereas we are more entitled for the kingship than he, and nor has he been given abundance of wealth too'. Said the Prophet, \"Allah has chosen him over you, and has increased him abundantly in knowledge and body, and Allah gives His kingdom to whom He will, and Allah is All-Embracing, All-Knowing.",
    "verse_248": "And their Prophet said to them: 'The sign of his kingship is that there would come to you an ark in which there is tranquility of hearts from your Lord, and there are something left of the relics of the respectable Moosa and the respectable Haroon, the angels raising it would bring. No doubt, in it there is great sign for you if you believe.",
    "verse_249": "When Talut departed taking the armies from the City, spoke he: 'no doubt Allah is to test you with a stream. Then whoso drinks its water, he is not mine, and whoso drinks not, he is mine, but he who takes a sip with his hand, then all drank of it except a few of them. Again when Talut and the Muslims with him went across the stream, spoke, 'we have no power against Jalut (Goliath) and his armies'. Those who were sure to meet Allah spoke, 'that often a small party has triumphed over a large party by Allah's Command, and Allah is with the steadfast.",
    "verse_250": "Again when they came across Jalut and his armies, they submitted: 'O our Lord pour forth steadfastness upon us and make our steps firm, and help us against disbelieving people.",
    "verse_251": "Then they routed them by the Command of Allah and Daud (David) slew Jalut and Allah gave him kingdom and wisdom and taught him what He pleased. And if Allah would not repel some of them by some others among people, then necessarily the earth would have been ruined, but Allah is Munificent to the entire world.",
    "verse_252": "These are the verses of Allah; that O beloved! We recite correctly to you and you are no doubt one of the Messengers.",
    "verse_253": "These are Messengers! That in them We caused one to excel upon the other; to some of them Allah spoke: and someone is he who was raised high in degrees overall, and We gave clear signs to Isa son of Maryam and aided him with Holy Spirit and had Allah so willed, then those who came after them would not have fought among themselves after the clear signs had come to them. But they differed, some of them remained faithful and some became disbelievers and if Allah so willed, they would not have fought; but Allah does whatever He desires.",
    "verse_254": "O believers! Spend in the way of Allah out of what We have given you before the coming of the Day in which there is neither trafficking nor friendship and nor intercession for infidels and the infidels are themselves the persons unjust.",
    "verse_255": "Allah is, none is to be worshiped save Him, He is Himself Alive and Sustainer of others. Slumber seizes Him not, nor sleep. To Him belongs whatsoever is in the heavens and whatsoever in the earth\". Who is he that would intercede with Him save by His leave? Knows He what is before them and what is behind them, and they get nothing of His knowledge save as much as He desires. The heavens and earth are contained in His Throne, and their guarding is not a burden for Him and He is the only Exalted, the Supreme.",
    "verse_256": "There is no compulsion in religion; no doubt the virtuous path has become clearly distinct from the erring; then whoso does not accept devil and believes in Allah, he grasped a very firm knot which is never to open and Allah hears and knows.",
    "verse_257": "Allah is the Protector of Muslims; brings them out from darkness towards light, and the supporters of infidels are devils, and they bring them forth from light towards darkness. They are the people of hell, they are to abide therein.",
    "verse_258": "O beloved (Prophet); I had you not seen him who quarreled with Ibrahim about his Lord because Allah gave him Kingdom? When Ibrahim said, my Lord is He Who gives life and causes death, said he, 'I give life and cause death'. Ibrahim said, 'Well, Allah brings sun from the East: bring it you from the West.' Thereupon the infidel was confounded and Allah guides not the unjust people.",
    "verse_259": "Or like him who passed by a town and it was laid down fallen upon its roofs. Spoke he, 'How Allah shall give life to it after its death. Then Allah kept him dead for a hundred years; then gave him life. Said, He: 'How long you stayed here,' submitted he, 'I would have stayed a full day or a little less.' He said, 'No, you have passed a hundred years, and look at your food and drink; they are not stinked as yet, and look at your ass whose bones even are not safe. And this is that We may make you a sign for the people. And look at these bones how We set them up, then cover them with flesh. When this matter became clear to him, said, 'I know very well that Allah is Potent over all things.'",
    "verse_260": "And when Ibrahim submitted, 'O my Lord, show me how You shall give life to the dead.' Said He, 'do you not believe.' Submitted he, 'why not, but I like that my heart may be at rest.' Said He, 'then well, taking four birds, make them familiar to you, then put a part of each of them on each hill, thereafter call them, they will come to you running with their feet. And know that Allah is Mighty, Wise'.",
    "verse_261": "The example of those who spend their wealth in the way of Allah is like that of a grain which caused to grow seven ears and in each ear one hundred grains, and Allah may increase more than that for whomsoever He pleases; and Allah is Bountiful, All-Knowing.",
    "verse_262": "Those who spend their wealth in the way of Allah, then after spending neither boast of favors conferred nor injure, their reward is with their Lord, and they shall have no fear, nor any grief.",
    "verse_263": "To speak kind word and to forgive is better than that charity followed by injury. And Allah is above want, Clement.",
    "verse_264": "O believers! Void not your charities by boasting of your favors conferred and injuring, like him who spends his wealth for showing to people and believes not in Allah and Last Day. Then the example of him is like that of a smooth rock on which is dust of earth; now a heavy rain fell upon it leaving it a bare stone. They shall have no control on anything of what they have earned. And Allah guides not the infidels.",
    "verse_265": "And the example of those who spend their wealth in seeking the pleasure of Allah, and for strengthening their hearts is like that garden which is on an elevated ground; a heavy rain fell upon it, then it brought forth its fruits two fold; again if a heavy rain reaches it not, then dew suffices. And Allah is seeing what you do.",
    "verse_266": "Would any one of you like it that he would have a garden of dates and grapes beneath which rivers would have been flowing; for him, there is every kind of fruit in it, and old age came to him and he has weak children, then came a whirlwind on it in which there was fire, so it was burnt? Thus Allah explains to you His signs, so that you may ponder.",
    "verse_267": "O believers! Give something of your pure earnings and of what We produced from the earth for you; and intend not to give specially vile of it, whereas if you get of it, you will not accept unless you close your eyes in it. And know that Allah is Free of all wants, Praiseworthy.", 
    "verse_268": "The devil dreads you of destitution and commands you of lewdness, and Allah promises you forgiveness and abundance. And Allah is All Embracing, All Knowing.",
    "verse_269": "Allah grants wisdom to whom He pleases and he who got wisdom indeed got abundant good; and none accepts counsel but men of understanding.",
    "verse_270": "And whatsoever you spend or vow Allah knows it, and the unjust have no helpers.",
    "verse_271": "If you give charity openly, then what a good thing it is; and if you give beggars hidingly, it is better for you than everything, and He will remove some of your sins. And Allah is Aware of what you do.",
    "verse_272": "To guide them is not your responsibility; yes, Allah guides whomsoever He pleases. And whatsoever good thing you give it is for your own good, and it is not proper for you to spend but for seeking pleasure of Allah, and whatever of wealth you give, you will get back in full and you shall not be wronged.",
    "verse_273": "For those beggars who are detained in the way of Allah, they cannot move about in the earth. The ignorant man thinks them wealthy because of restraint. You shall recognize them from their faces; they do not beg of men importunately. And whatever you give in charity Allah knows it.",
    "verse_274": "Those who spend their wealth (in charity) in the night and in the day secretly and openly have their reward with their Lord. There is neither any fear nor any grief to them.",
    "verse_275": "Those who devour interest shall not stand on the Day of Judgement, but like the standing of one whom the evil spirit has by touching made mad. This is because they said, 'The trade too is like interest,' and Allah made trade lawful and made interest unlawful, so he who received admonition from his Lord and refrained, then whatever he took before is lawful to him, and his affair is with Allah. And now whoever shall commit such fault, then he is a man of hell, they will live therein for longer period.",
    "verse_276": "Allah destroys interest and increases charity and Allah loves not any ungrateful big sinner.",
    "verse_277": "No doubt, those who accepted faith and did good deeds and established prayer and paid the Zakat, (poor-due) their reward is with their Lord, and there is neither any fear nor any grief to them.",
    "verse_278": "O believers! Fear Allah and leave what remains of interest if you are Muslims.",
    "verse_279": "But if you do not do like this, then be sure of war from Allah and the Messenger of Allah. And if you repent, then take your principal sums; neither you wrong anyone nor be wronged yourselves.",
    "verse_280": "And if the debtor is a man in hardship, then give him time till it is easy, and to remit the debt fully is better for you if you know.",
    "verse_281": "And fear the day in which you shall be made to return to Allah and shall every soul be paid in full what it has earned and they shall not be wronged.",
    "verse_282": "O believers! When you enter in the transaction of any debt for a fixed period, then write it down. And a scribe should write between you justly and the scribe should not refuse to write as he has been taught by Allah, then he should write and let him on whom the liability falls dictate, and fear Allah Who is his Lord and leave not behind something out of the liability. Then again he on whom liability falls be of low understanding or be weak or be unable to dictate; then let his guardian dictate justly. And make two witnesses from among your men, then if two men be not available, then a man and two women such witnesses as you like, so that either of the two women errs in memory, then the other may remind that one. And when the witnesses are called, they should not refuse to come. And do not take it as a burden, the liability be it small or big, write it down along with its fixed period. It is jester in the sight of Allah, in it the evidence will be more suitable, and it is nearer to it that you may not be in doubt; save a ready merchandise which you give or take from hand to hand, there is no sin on you, if you write it not. And when you trade, make witnesses. And neither any scribe be harmed nor the witness (or neither the scribe do harm nor the witness). And if you do such, then it would be your insubordination. And fear Allah and Allah teaches you and Allah knows everything.",
    "verse_283": "And if you are on a journey, and you find not a scribe, then let there be pledge with possession. And if in between you one entrusts the other, then let he whom he trusted deliver his trust and fear Allah, Who is his Lord; and conceal not evidence; and whosoever would conceal evidence, then his heart is sinful from inside, and Allah knows your deeds.",
    "verse_284": "To Allah belongs whatever is in the heavens and whatever is in the earth; and if you disclose whatever is in your heart or keep it hidden, Allah will call you to account for it; then He will forgive whomsoever He pleases and punish whomsoever He pleases, and Allah is Potent over everything.",
    "verse_285": "The Messenger believed in that which was sent down to him from his Lord and the believers too; all accepted Allah and His angels and His Books and His Messengers saying this, 'that we do not differentiate in the matter of having faith in any of His Messengers' and submitted, 'we heard and obeyed. Let there be your forgiveness, O Our Lord! And to You is our return.'",
    "verse_286": "Allah places not burden on any soul but to the extent of his strength; whatever good it earned is useful for it and whatever bad it earned is a loss for it. 'O our Lord! Catch not us if we forget or miss the mark! O our Lord! And place not heavy burden on us as You had placed on those before us. O our Lord! And put not that burden on us of which we have no strength to bear! And pardon us and forgive and have mercy on us. You are our Master; then help us against the infidels.'"
     },
    "count": 286
}
