{
    "name": "an-Naba'",
    "index": "078",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "What they are questioning for among themselves?",
        "verse_2": "About the Great News.",
        "verse_3": "In which they differ.",
        "verse_4": "Yes, they will now know.",
        "verse_5": "Again, yes, they will soon know.",
        "verse_6": "Have We not made the earth a bed,",
        "verse_7": "And the mountains as stakes?",
        "verse_8": "And we have made you pairs,",
        "verse_9": "And We have made your sleep a rest,",
        "verse_10": "And We have made the night a covering.",
        "verse_11": "And We have made the day for seeking livelihood.",
        "verse_12": "And We have built over you seven strong layers (firmaments).",
        "verse_13": "And We have set therein a very bright lamp.",
        "verse_14": "And We sent down then from the clouds water pouring forcefully.",
        "verse_15": "That We may bring forth therewith grains and vegetables.",
        "verse_16": "And thick gardens.",
        "verse_17": "Undoubtedly, the Day of Decision has an appointed time.",
        "verse_18": "The day when the trumpet shall be blown, and you will come in hosts.",
        "verse_19": "And the sky shall be opened up and it will become as doors.",
        "verse_20": "And the mountains shall be made to move and shall become as they were a mirage.",
        "verse_21": "Undoubtedly, Hell is watching.",
        "verse_22": "The destination of the contumacious.",
        "verse_23": "For ages they will abide therein.",
        "verse_24": "They will not taste therein neither cool nor any drink.",
        "verse_25": "But boiling water and a bunring yellow liquid of the people of Hell.",
        "verse_26": "A fitting recompense.",
        "verse_27": "Undoubtedly, they had no fear of reckoning.",
        "verse_28": "And they belied Our signs fully.",
        "verse_29": "And We have already kept counted everything in a Book.",
        "verse_30": "Taste now, We shall not increase you but in torment.",
        "verse_31": "Undoubtedly, for the Godfearing is the place of triumph.",
        "verse_32": "Gardens and grapes.",
        "verse_33": "And rising breasted maidens of equal age.",
        "verse_34": "And overflowing cups.",
        "verse_35": "Therein they will hear no idle talk nor lying.",
        "verse_36": "A recompense from your Lord, a bestowing sufficient.",
        "verse_37": "From Him Who is the Lord of the heavens and the earth and all that in between them is, the Most Affectionate, they shall not have the power to speak to Him.",
        "verse_38": "On the day when the spirit (Jibril) and all angels will stand in rows, no one shall be able to speak, but he whom the Most Affectionate will permit and who speaks aright.",
        "verse_39": "That is the true day. Now let him who will seek a way to his Lord.",
        "verse_40": "We warn you of a torment which is near at hand; a day when man will see whatsoever his hands have sent on before, and the infidel will say, 'Would that I were dust!'"
     },
    "count": 40
}
