{
    "name": "al-Fath",
    "index": "048",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Undoubtedly, We have granted you a clear victory.",
        "verse_2": "That Allah may forgive the sins of your formers and of your letters on account of you and may complete His favors upon you and may show you straight path.",
        "verse_3": "And that Allah may help you with mighty help.",
        "verse_4": "He it is Who sent down satisfaction in the hearts of the believers so that they might add belief to their belief and to Allah belongs all the hosts of the heavens and the earth. And Allah is Knowing, Wise.",
        "verse_5": "So that He may cause the believing men and the believing women to enter the gardens underneath which flow rivers, to abide therein and He may remove their evils from them and this is the great triumph in the sight of Allah.",
        "verse_6": "And that He may torment the hypocrite men and the hypocrite women and the polytheist men and polytheist women who have evil thoughts concerning Allah. On them is the evil turn of fortune and Allah showed His wroth on with them, and has cursed them and has prepared Hell for them. And that is what an evil end.",
        "verse_7": "And to Allah belongs all the hosts of the heavens and the earth. And Allah is Dignified. Wise.",
        "verse_8": "Surely, We have sent you as a witness (present and seeing) and a bearer of glad tidings and a warned.",
        "verse_9": "So that O people you may believe in Allah and His Messenger and pay respect to him and honor him and that you may glorify Him morning and evening.",
        "verse_10": "Those who swear allegiance to you, swear allegiance to Allah. The hand of Allah is over their hands; so whosoever breaks his oath, he breaks it to his own loss, and whosoever fulfils the covenant which he had made with Allah, then Allah shall soon give him a great reward.",
        "verse_11": "Now those desert Arabs who had remained behind will say to you our possessions and our family members kept us busy, therefore now you ask forgiveness for us?' They say with their tongues that which is not in their say you, 'who has any power for you against Allah, if he desires you harm or if He desires you good. Nay, Allah is Aware of your doings.'",
        "verse_12": "Nay! But you thought that the Messengers and Muslims would never return to their homes, and the same was understood by your fair in you hearts, and you conceived an evil thought, and you were a people to be ruined.",
        "verse_13": "And whoso believes not in Allah and His Messengers We have surely prepared for the infidels a blazing fire.",
        "verse_14": "And for Allah only is the kingdom of the heavens and the earth. He forgives whomsoever He pleases and punishes whomsoever He pleases. And Allah is Forgiving, Merciful.",
        "verse_15": "Now those who lagged behind will say, 'when you go to take the spoils, let us follow you. They desire to change the words of Allah'. Say you, 'you shall by no means follow us thus has Allah said before. Then now they will say, 'nay! but you are jealous of us. Not so rather, they understood not but a little.",
        "verse_16": "Say to the desert Arabs who lagged behind, 'soon you shall be summoned to fight against a people of severe fighting that you shall become Muslims'. Then, if you will obey the command, Allah will give you a good reward, but if you will turn away as you turned away before, He will punish you with a painful punishment.",
        "verse_17": "No straitening there is on the blind and no harm on the lame, and nor there is penalization on the sick, And whoso obeys Allah and His Messenger, Allah will admit him into gardens underneath which streams flow, but whoso will turn away, He will torment him with a painful torment.",
        "verse_18": "Surely, Allah was Pleased with the believers when they were swearing allegiance to you under the tree, and Allah knew what were in their hearts, so He sent down on them tranquility and rewarded them with a near victory.",
        "verse_19": "And abundant spoils that they took. And Allah is Dignified, Wise.",
        "verse_20": "And Allah has promised you abundant spoils that you will take, and these He has hastened to you and has restrained the hands of the people from you and that it may be a sign to the believers and that He may guide you on a straight path.",
        "verse_21": "And one more (victory) which was not under your power, that is in the possession of Allah. And Allah is Potent over everything.",
        "verse_22": "And if the infidels should fight you, they would necessarily then turn their back from your confrontation; then they would not find any supporter nor helper.",
        "verse_23": "This is the practice of Allah that is being practiced from before, and you shall never find the practice of Allah changing.",
        "verse_24": "And it is He Who has restrained your hands from them in the vallye of Mecca after He has given you control over them. And Allah sees your doings.",
        "verse_25": "They are those who disbelieved and hindered you from the Sacred Mosque, and the sacrificial animal were detained from reaching their place of sacrifice. And if it had not been for certain believing men and some believing women whom you knew not that you might have trampled them, and there befalls you any harm from them unknowingly, We would have permitted you to fight, This protection of theirs is for that Allah may admit into His mercy who He pleases. If they have been separated, necessarily then We would have punished the infidels among them with a painful punishment.",
        "verse_26": "When the infidels harbored obduracy in their hearts the obduracy of the days of ignorance then Allah sent down, His tranquility on His Messenger and on the believers and made incumbent on them the words of righteousness and they were better entitled to it and more worthy of it. And Allah knows everything.",
        "verse_27": "Undoubtedly, Allah has proved true the true vision of His Messenger. You shall, no doubt, enter the sacred mosque, if Allah pleases, in security, having your heads shaven or having your hair cut short without any fear. But He knew what you knew not and appointed before that a near victory.",
        "verse_28": "It is He Who has sent His Messenger with guidance and the religion of truth that he may make it prevail over all other religions And Sufficient is Allah as witness.",
        "verse_29": "Muhammad is the Messenger of Allah and those with him are hard against the infidels and tender among themselves you will see them bowing and prostrating themselves (in pray) seeking grace of Allah and His pleasure. Their mark is on their faces from the traces of prostrations. This description of theirs is in Taurah and their description is in Enjeel. As a cultivated field which puts forth its sprout, then strengthened it, then it became thick, then stood straight upon its stem, it looks pleasant to the cultivators of the infidels may burn. Allah has promised unto those of them who are belivers and do good, forgiveness and a great reward."
        },
    "count": 29
}
