{
    "name": "Hud",
    "index": "011",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif Lam Ra. This is a Book, whose verses are full of wisdom, then have been detailed from One Wise, Aware.",
        "verse_2": "That worship not but Allah. No doubt, I am to you a warner from Him and a bearer of glad tidings.",
        "verse_3": "And that, you, ask forgiveness of your Lord then repent to Him, He will give you a good pulling until an appointed term, and will cause to reach his grace to every man of grace, and if you turn your face, then I fear for you the torment of a Great Day.",
        "verse_4": "Towards Allah is your return, and He is Potent over everything.",
        "verse_5": "Listen, they fold up their breasts that they may hide from Allah. Listen, when they cover their whole body with their garments, Allah knows what they conceal and what they reveal. No doubt, He is the Knower of all the thoughts with in the breasts.",
        "verse_6": "And there is none moving on this earth, the provision of that is not upon the generous responsibility of Allah, and He knows its place of stay and the place of return. All is recorded in a clear explanatory Book.",
        "verse_7": "And it is He Who has created the heavens and earth in six days, and His Throne was on the water, that He might try you, as to whose work of you is best. And if you say, 'Undoubtedly, you shall be raised after death,' then the infidels will surely say, 'this is not but a magic manifest.'",
        "verse_8": "And if We defer from them the torment for a counted period, then they would certainly say, \"What has detained it?\" Listen, 'the day when it will come to them, it shall not be averted from them, and the same torment which they used to mock at shall encompass them.",
        "verse_9": "And if We let man taste Our any mercy, then take it away from him, surely he is despairing, ungrateful.",
        "verse_10": "And if We let him taste favor after the hardship that has reached him, then he will surely say, 'the evils have gone from me.' No doubt, he is joyous, boastful.",
        "verse_11": "But those who remained patient and did good deeds; for them is forgiveness and a great reward.",
        "verse_12": "Then will you leave some of what is being revealed to you and straiten your breast therewith, because they say, 'why a treasure has not been sent down with him or any angel would have come with him? You are a warner. And Allah is Guardian over everything.",
        "verse_13": "Do they say this, 'He has fabricated it?' Say you, 'Bring then ten verses the like of it, and call all those whom you can besides Allah, if you are truthful.'",
        "verse_14": "Then O Muslim! If they do not respond to you, then know that it has been sent down with Allah's knowledge, and that there is no True Deity save Allah, Will you then now submit?",
        "verse_15": "Whoever desire the life of the world and its adornment, We will give their full fruit in it and will not lessen anything therein.",
        "verse_16": "These are they for whom there is nothing in the Hereafter but Fire. And whatever they used to do there is destroyed and all their work became void.",
        "verse_17": "Is he then (like him) who is upon a bright proof from his Lord and there comes a witness on him from Allah and before it was the Book of Moses, a guide and mercy? Those believe therein, and whosoever of all parties disbelieves in it, then Fire is his promised place. Then O listener! Be not you in any doubt about it. No doubt, that is the truth from your Lord, but most people believe not.",
        "verse_18": "And who is more unjust than he who forges a lie against Allah. They shall be presented before their Lord, and the witnesses will say, 'These are they who forged a lie against their Lord. Behold; curse of Allah is upon the unjust.'",
        "verse_19": "Those who hinder from the path of Allah, and desire crookedness in it; and they are they who deny the Hereafter.",
        "verse_20": "They are unable to fatigue in the earth, nor besides Allah, they have any helper. They will face torment over torment. They could neither hear nor see.",
        "verse_21": "These are they who put their souls in loss and the things which they used to fabricate have been lost from them.",
        "verse_22": "Willing or not willing, it is they who are the greatest losers in the Hereafter.",
        "verse_23": "No doubt, those who believed, and did good deeds and turned humbly towards their Lord, they are the men of Heaven, therein they shall abide.",
        "verse_24": "The condition of both parties is like one the blind and deaf and the other seeing and hearing. Is the case of the two alike? Do you then not take heed?",
        "verse_25": "And no doubt, We sent Nuh to his people saying I am for you a clear warner.",
        "verse_26": "That worship none save Allah. Verify, I fear for you the torment of a painful day.",
        "verse_27": "Then the chiefs who unbelieved of his people spoke, 'We see you a man like us, and we see not that anyone who has followed you but the meanest of us inadvertently, and we do not find in you any superiority over us; but rather we think you a liar.",
        "verse_28": "He said, 'O my people! Tell me, if I am on a clear proof from my Lord, and He has bestowed upon me from Himself a great mercy, then you remained blind from it. Shall we stick it to your neck while you are averse to it'",
        "verse_29": "'And O people! I ask no wealth on it from you. My reward is only with Allah and I am not to drive away Muslims. No doubt, they are to meet their Lord, but I find you wholly ignorant people.",
        "verse_30": "'And O people! Who will save me from Allah, if I will drive away them. Do you then not take heed?",
        "verse_31": "'And I say not to you, 'I have treasures of Allah with me, and nor I get the unseen known myself and nor I say this, 'I am an angel, and nor I say those whom your eyes despise, 'Allah will never bestow any good to them.' Allah knows well whatever is in their hearts. If I do so, then surely I am of the unjust.'",
        "verse_32": "They said, 'O Nuh, you have disputed with us, and disputed much, then bring that which for you promise us, if you are truthful.'",
        "verse_33": "He said, 'Allah will bring it to you, if He please, and you cannot get Him tired.",
        "verse_34": "'And my admonition will not profit you, if I desire good to you, whilst Allah desires you to go astray. He is your Lord and to Him you shall return.'",
        "verse_35": "Do they say, 'He has fabricated it?' Say you, 'If I have fabricated it, then upon me is my sin and I am quit of your sins.'",
        "verse_36": "And it was revealed to Nuh, 'None of your people will become Muslim but those who have already believed, grieve not then at what they do.",
        "verse_37": "'And built the ark before Us and with Our command, and address Me not concerning the unjust, they shall necessarily be drowned.'",
        "verse_38": "And Nuh builds the ark, and whenever the chief of his people passed by him, they laughed at him. He said, 'If you laugh at us, then we shall laugh at you at one time as you laugh.",
        "verse_39": "'Now then you shall know to whom comes the torment that may disgrace him, and comes down the torment that may be lasting.'",
        "verse_40": "Until, when Our Command came, and the Oven boiled, We said, 'Embark in the ark a pair male and female of every kind and the members of your family except those against whom the word has already gone forth, and the rest of the Muslims.' And Muslims were not with him but a few.",
        "verse_41": "And he said, 'Embark therein; in the name of Allah is its moving and its berthing. No doubt, my Lord is assuredly Forgiving, Merciful.'",
        "verse_42": "And it is sailing with them amidst such waves as mountains. And Nuh called his son, and he was standing apart from him: 'O my son, embark with us and be not with the infidels.'",
        "verse_43": "He said, 'Now I take refuge of any mountain, it will save me from the water. Said he, 'Today there is no protector form the torment of Allah but for him on whom He has mercy.' And the wave came in between the two, so he was among the drowned.",
        "verse_44": "And it was commanded, 'O earth swallow your water, and O heaven, withhold! 'And water was dried and the affair was accomplished, and the ark settled on mountain Judi, and it was said, 'away be the people unjust.'",
        "verse_45": "And Nuh called upon his Lord, said he, 'O my Lord, my son too is of my family, and no doubt, Your promise is true, and You are the Greatest of rulers.'",
        "verse_46": "He said, 'O Nuh, he is not of your family, No doubt, his work is not righteous; then ask not of Me that of which you have no knowledge. I admonish you not to become ignorant.'",
        "verse_47": "Submitted he, 'O my Lord, I beg Your refuge from asking You that of which I have no knowledge. And if you forgive me not and have not mercy on me, then I shall be loser.'",
        "verse_48": "It was said, 'O Nuh! Get down from the ark with peace from Us and with blessings on you and on some parties with you. And there are some parties whom We shall allow to enjoy in the world, then a painful torment will reach them from Us.",
        "verse_49": "These tidings of unseen, We reveal to you. Neither you did know nor your people before this. Then be patient. No doubt there is good end for the duty bound.",
        "verse_50": "And towards Aad (sent) Hud a compatriot of their own. He said, 'O my people, worship Allah. You have no Deity besides Him. You are but fabricators.",
        "verse_51": "'O my people, I ask you not any wage for this, My wage is only on Him Who created me. Have you then no wisdom?",
        "verse_52": "'And O my people! Beg forgiveness of your Lord, then turn to Him, He will send over you heavy rain and will add strength to your strength, and turn not away your faces committing crimes.'",
        "verse_53": "They said, 'O Hud you have not come to us having any proof, and we are not to leave our gods merely because of your saying, nor are we going to believe your words.",
        "verse_54": "'We say only that one of our gods has smitten you with evil.' He said, 'I call Allah to witness and you all bear witness that I am quit of all those whom you associate with Him.",
        "verse_55": "'Besides Allah. Devise against me you altogether then respite me not.",
        "verse_56": "'I relied on Allah, my Lord and your Lord. There is no moving creature whose forelock is not under His control. No doubt, my Lord meets on straight path.",
        "verse_57": "'Then if you turn your faces, then I have already conveyed to you that with which I have been sent to you, and my Lord will bring others to take your place, and you cannot harm Him at all. No doubt my Lord has watch over everything.'",
        "verse_58": "And when Our Command came, then We saved Hud and the Muslims with him, by showing Our mercy, and delivered them from severe torment.",
        "verse_59": "And these are Aad. They denied the signs of their Lord and disobeyed His Messengers and followed the saying of every contumacious, haughty enemy.",
        "verse_60": "And the curse stuck to them in the world and on the Day of Judgement. Listen, verily, Aad rejected their Lord. Ho; Away with Aad the people of Hud.",
        "verse_61": "And towards Thamud (We sent) Saleh a compatriot of their own. He said 'O my people, worship AlIah, you have no Deity besides Him. He produced you from the earth and caused you to live therein, then beg forgiveness of Him, then turn to Him. No doubt, my Lord is Near, Responsive.'",
        "verse_62": "They said, 'O Saleh, you looked promising amongst us before it. 'Do you forbid us to worship what our fathers worshipped, and verily we are in a big deceitful doubt regarding that to which you call us.'",
        "verse_63": "He said, 'O my people! Tell me, if I am on a clear proof from my Lord,, and He has bestowed upon me mercy from Himself, then who will save me against Him, if I disobey Him; then you will increase me nothing save loss.",
        "verse_64": "'And O my people! This is she-camel of Allah, a sign for you, then leave her, that she may eat in Allah's earth, and touch her not with evil lest a near torment should reach you.'",
        "verse_65": "Then they hamstrung her, then Saleh said, 'Enjoy in your houses three days more. This is a promise that will not be falsified.'",
        "verse_66": "Then when Our Command came, We saved Saleh and the Muslims with him showing Our mercy and from the humiliation of that day. No doubt, your Lord is Mighty, Honorable.",
        "verse_67": "And a roaring noise overtook the unjust, then in the morning, they remained lying crouched in their homes.",
        "verse_68": "As though they had never dwelt therein. Listen, no doubt, Thamud denied their Lord, Ho; curse be on Thamud.",
        "verse_69": "And no doubt, Our messengers (angels) came to Ibrahim with glad tidings. They said, 'Peace.' He said, 'Peace,' then not being late, brought a calf roasted.",
        "verse_70": "Then when he saw that their hands did not reach towards the food, he thought them strangers and began to fear them in his heart. They said, 'Fear not, we have been sent towards the people of Lut.'",
        "verse_71": "And his wife was standing by, she began to laugh, then We gave her the glad tidings of Ishaque and after Ishaque of Yaqoob (Jacob).",
        "verse_72": "She said, 'Oh; Woe is me, shall I bear a child and I am old, and this is my husband, an old man? No doubt, this is a strange thing.'",
        "verse_73": "The angels said, 'Do you wonder at Allah's Command? The mercy of Allah and His blessings be upon you, O people of the house! No doubt, it is He Who is All Praiseworthy, Honorable.'",
        "verse_74": "Then when the fear of Ibrahim disappeared, and he got glad tidings, he began to dispute with Us about the people of Lut.",
        "verse_75": "No doubt, Ibrahim is clement most tender-hearted, penitent.",
        "verse_76": "(The angels said,) 'O Ibrahim! Do not plunge in this thought. No doubt, the Command of your Lord has come, and no doubt, the torment is to approach them, that cannot be averted.'",
        "verse_77": "And when Our angels came to Lut (Lot), he was grieved of them and became sad on account of them, and said, This is a fierce day.'",
        "verse_78": "And his people came running to him, and they were in the habit of doing evil deeds from before. He said, 'O people these are daughters of my people, they are purer for you, then fear Allah, and do not disgrace me in the face of my guests. Is there not among you any man of good character?'",
        "verse_79": "They said, 'You know that we have no right in the daughters of your people, and you surely know what we desire.'",
        "verse_80": "He said, \"Had I strength against you or might take refuge in a strong pillar!'",
        "verse_81": "The angels said, 'O Lut! We are messengers of your Lord, they cannot reach you, then carry forth your family within night, and let none of you look back except your wife. The same is to reach her too, what will reach them. No doubt, their promise is for the morning. Is the morning not nigh?'",
        "verse_82": "Then when Our Command came, We turned that town upside down, and We rained upon it stones of baked clay continuously.",
        "verse_83": "Which are marked with your Lord, and those stones are not away from unjust people.",
        "verse_84": "And towards Madian Shoaib a compatriot of their own. He said, 'O my people, worship Allah, there is no Deity besides Him. And diminish not the measure and the weight. No doubt, I see you prosperous, and I fear for you the torment of encircling day.",
        "verse_85": "'And O my people! Fill up measure and weight with justice and do not give the people their things decreasing and do not roam in the earth spreading mischief.",
        "verse_86": "'And that which is left from the provision of Allah is better for you, if you believe, and I am not over you a guardian.'",
        "verse_87": "They said, 'O Shoaib, does your prayer bid you that we should abandon the gods of our fathers, or that we should not do with our riches whatever we will? Yes please, you are the only wise and upright.'",
        "verse_88": "He said, 'O my people, tell me fairly, if I am on a clear proof from my Lord, and He gave me good provision from Himself. And I do not desire, that I myself begin to do against that which I forbid you to do. I only desire to reform as far as I can. And my succor is from Allah only. I relied only upon Him and I turn towards Him only.",
        "verse_89": "'And O my people! Let not your opposition to me make you earn that which befell the people of Nuh, or the people of Hud or the people of Saleh. And the people of Lut are not far away from you.",
        "verse_90": "And beg forgiveness of your Lord [Allah], then turn towards Him. No doubt, my Lord is Merciful Loving.'",
        "verse_91": "They said, 'O Shoaib, we do not understand most of your talks; and no doubt, we see you weak among us. And if there would not have been your tribe, we would have stoned you. And there is no respect for you in our eyes.'",
        "verse_92": "He said, 'O my people! Is the pressure of my tribe over you is more than Allah? And you have cast Him behind your back. No doubt, whatever you do is under the control of my Lord.",
        "verse_93": "'And O people! Continue your work at your places, I do my work. Soon you are to know, on whom comes the torment that will disgrace him and who is a liar. And wait, I also wait with you.'",
        "verse_94": "And when Our Command came, We saved Shoaib and the Muslims with him by showing Our mercy, and the roaring noise overtook the unjust, then they remained lying on their knees in their homes at morning.",
        "verse_95": "As they had never dwelt there. Ho; Be away Madian just as Thamud were removed far away.",
        "verse_96": "And verily, We sent Musa with Our signs and clear authority.",
        "verse_97": "To Firawn and his courtiers, then they followed the command of Firawn. And the work of Firawn was not rightly directed.",
        "verse_98": "He shall be before his people on the Day of Resurrection, and bring them down in the Hell. And what an evil place of watering to descent.",
        "verse_99": "And the curse followed them in this world and on the Day of Resurrection. What is an evil reward which they got?",
        "verse_100": "These are the tidings of the towns that We relate to you, some of them are standing and some mown down.",
        "verse_101": "And We wronged them not, but they did evil to themselves; then they deities whom they used to worship besides Allah availed them not, when the Command of your Lord came, and they increased them nothing save destruction.",
        "verse_102": "And such is the seizing of your Lord, when He seizes the towns on their injustice. No doubt, His seizing is painful, severe.",
        "verse_103": "No doubt, herein is a sign to him who fears the torment of Hereafter. That is a Day whereon all shall be gathered together and that is a Day of presence.",
        "verse_104": "And We defer it not save for a counted period.",
        "verse_105": "When that Day will come, no one will speak save by the leave of God. Then anyone of them is unfortunate, and anyone of them is fortunate.",
        "verse_106": "Then those who are unfortunate, they are in the Hell, they will bray like ass.",
        "verse_107": "They shall abide therein, so long as the heavens and earth abide, save as your Lord will. No doubt, your Lord accomplishes what He desires.",
        "verse_108": "And those who are fortunate, they are in heaven. They shall abide therein, so long as the heavens and earth abide, save as your Lord will. This is the gift unending.",
        "verse_109": "Then O listener! Be not in delusion concerning that which these infidels worship. They worship as their fathers used to worship before. And undoubtedly, We shall repay them their portion in full undiminished.",
        "verse_110": "And no doubt, We gave Musa the Book, then they differed therein. And if a word of your Lord had not gone already before, the matter would have been decided between them at that very time. And no doubt, they are in a deceptive doubt about it.",
        "verse_111": "And no doubt, to each of them in all your Lord will repay their works in full. He is Aware of their doings.",
        "verse_112": "Then remain you firm as you have been commanded and whoever has repented with you; and O people! do not be arrogant. No doubt He is seeing your works.",
        "verse_113": "And do not lean towards wrongdoers, lest the Fire should touch you, and you have no supporter besides Allah, then you will not be helped.",
        "verse_114": "And establish prayer at the two ends of the day and in parts of the night. No doubt, good deeds obliterate evil deeds. This is admonition for the persons accepting admonition.",
        "verse_115": "And be patient, Allah wastes not the reward of the righteous.",
        "verse_116": "Then why there were not among generations before you persons possessing some virtue who would have forbidden mischief in the earth, yes, there were few of them whom We delivered? And the unjust remained behind the same luxury that was given to them, and they were sinners.",
        "verse_117": "And your Lord is not such that He would destroy towns without any reason while its people be good.",
        "verse_118": "And if your Lord had willed He would have made all mankind one nation, and they will always remain differing.",
        "verse_119": "Save those on whom your Lord had mercy, and for this has He created them. And the word of your Lord has been fulfilled, no doubt, I will fill hell with the jinn and mankind together.",
        "verse_120": "And all that We relate to you of the tidings of the Messengers is for the purpose of strengthening your heart therewith, and in this Sura the truth has come to you and admonition to the Muslims.",
        "verse_121": "And say you to the infidels, 'Continue working on your places, and we do our work.",
        "verse_122": "'And wait and we too are waiting.",
        "verse_123": "'And to Allah belong the unseen of the heavens and the earth and towards Him is the return of the whole affairs, then worship Him and rely upon Him. And your Lord is not heedless of what you do.'"
           },
    "count": 123
}
