{
    "name": "an-Naml",
    "index": "027",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "TA, Sin, These are the verses of the Quran and the Bright Book.",
    "verse_2": "A guidance and glad tidings to the believers.",
    "verse_3": "Those who observe the prayer and pay the poor due (Zakat) and they have firm faith in the Hereafter.",
    "verse_4": "Those who do not believe in the Hereafter, We have made their works good-looking in their eyes so that they are wandering perplexed.",
    "verse_5": "They are those for whom there is evil torment and they are alone the greatest losers in the Hereafter.",
    "verse_6": "And undoubtedly, you are being taught Quran by the Wise, the Knowing.",
    "verse_7": "When Musa told his housewife, 'I have perceived a fire, soon I shall bring you any news of it or I bring you any bright spark that you may warm yourself.'",
    "verse_8": "Then when he came to fire, a call was made that, 'Blessed is he who is in the place of manifestation of that fire, i.e. (Musa) and those who are around it, i.e. (angels). And glorified is Allah Who is the Lord of entire Worlds.",
    "verse_9": "'O Musa! The thing is this that I am alone Allah, the Mighty, the Wise.",
    "verse_10": "And cast down your staff,' Then Musa saw it wriggling as it were a serpent, he set out turning his back and did not look behind. We said, 'O Musa fear not', undoubtedly, the Messengers have no fear in My presence.",
    "verse_11": "'Yes, whosoever shows highhandedness, then substitutes good for evil, then undoubtedly, I am Forgiving, Merciful.",
    "verse_12": "'And put your hand into your bosom, it shall come forth white shining without any defect; among nine signs towards Firawn and his people. Undoubtedly, they are the people disobedient.'",
    "verse_13": "Then Our signs came to them visibly, they said, 'This is a clear magic.'",
    "verse_14": "And they denied them unjustly and proudly, while their hearts were convinced of them. Then see how the end of mischief-mongers became.",
    "verse_15": "And We bestowed on Daud (David) and Sulaiman (Solomon) great knowledge, and both said, 'All praise to Allah, Who has excelled us over many of their believing bondmen.'",
    "verse_16": "And Sulaiman became the successor of Daud and said, 'O people, We have been taught the language of birds, and we have been bestowed, on of everything. Undoubtedly, this indeed is a manifest grace.'",
    "verse_17": "And there were gathered for Sulaiman his armies amongst Jinns and men and birds, then they were hold back.",
    "verse_18": "Until when they came to the valley of the ants, one ant said, 'O ants, enter your houses, lest Sulaiman and his armies may crush you unknowingly.'",
    "verse_19": "Thereupon he smilingly laughed at her words, and said, 'O my Lord, grant me guidance that I may be grateful for Your favor which You have bestowed upon me and my parents that I may do such good work as would please You and admit me out of Your Mercy among Your those bondmen who deserve Your proximity!'",
    "verse_20": "And he reviewed the birds, then he said, 'What happened to me that I do not see the hoopoe (Hud-Hud)? Or he is really not present.",
    "verse_21": "'I shall surely punish him severely or shall slaughter him or he should bring me a clear authority.'",
    "verse_22": "Then the hoopoe (Hud Hud) did not stay long and he came and said, 'I have seen that which you have not seen and I have brought you a certain news from the city of Saba.",
    "verse_23": "'I saw a woman reigning over them and she has got of everything and she has a great throne.",
    "verse_24": "'I found her and her people prostrating before the sun leaving Allah and the devil (Satan) adorning their deeds in their eyes has barred them from the straight path so that they do not get the way.",
    "verse_25": "Why they prostrate not before Allah, Who brings forth the hidden things of the heavens and earth and knows what you conceal and what you declare?",
    "verse_26": "Allah is, besides Him there is no True Deity, He is the Lord of the magnificent throne.",
    "verse_27": "Sulaiman said, ‘Now we shall see whether you have spoken the truth or you are amongst the liars.",
    "verse_28": "'Take my this edict and cast it to them, then moving aside from them see what answer they return.'",
    "verse_29": "The woman said, 'O chiefs! Undoubtedly there has been cast a noble letter towards me.",
    "verse_30": "'Undoubtedly, it is from Sulaiman and it is by the name of Allah, the Most Affectionate, the Merciful.",
    "verse_31": "'That you seek not exaltness against me and come to me submitting.'",
    "verse_32": "She said, 'O my chiefs, 'advise me in this matter, I decide not any matter firmly until you are present with me.'",
    "verse_33": "They said, 'We are men of great strength and of severe fighting and the authority is yours, therefore see what you command.'",
    "verse_34": "She said, 'Undoubtedly, when the kings enter any town ruin it and disgrace its honorable inhabitants, and thus they do.",
    "verse_35": "'And I have to send a present to him, then I shall see what answer the messengers bring back.'",
    "verse_36": "Then when he came to Sulaiman, he said, 'Do you help me with wealth? But that which Allah has given me is better than that which He has given to you. Nay, it is you who rejoice in your gift.",
    "verse_37": "'Return to them, we shall, therefore, bring that army to them against which they will have no power and we shall necessarily turn them out of the city disgraced in a manner that they will be humbled.'",
    "verse_38": "Sulaiman said, 'O chiefs, which is of you who may bring her throne to me before they come to me submitting?'",
    "verse_39": "One big evil Jin said, 'I will bring you that throne before you rise from your sitting; and undoubtedly, I am powerful over that, trustworthy.'",
    "verse_40": "One who had knowledge of the Book said, 'I shall bring it to you before twinkling of an eye.' Then when Sulaiman saw the throne set before him said, 'This is of the grace of my Lord that He may try me whether I am grateful or ungrateful.' And whosoever is grateful is grateful for his own good. And whosoever is ungrateful, then my Lord is Self-Sufficient, All-virtuous.'",
    "verse_41": "Sulaiman ordered, ‘Make the throne of the woman strange before her changing its shape, so that we see whether she gets the right way or is one of those who remained misguided.'",
    "verse_42": "Then when she came, it was said to her, 'Is your throne like this? 'She said, 'As it is the same; and we were given knowledge before this and we have already submitted.'",
    "verse_43": "And that which she used to worship besides Allah had stopped her. Undoubtedly she was of a disbelieving people.",
    "verse_44": "It was said to her, 'Come to the courtyard.' Then when she saw it, she thought it a deep water and uncovered her shanks. Sulaiman said, 'It is a soft courtyard set with glasses.' The woman said, 'O my Lord I have wronged my soul and now I submit with Sulaiman before Allah, Who is the Lord of entire world.'",
    "verse_45": "And undoubtedly, We sent towards Thamud their compatriot Saleh that worship Allah, then henceforth they became two parties contending.",
    "verse_46": "Saleh said, 'O my people, why do you hasten the evil before the good'? Why do you not ask forgiveness of Allah haply you may be shown mercy?'",
    "verse_47": "They said, 'We took a bad omen from you and from your companions. 'He said, 'Your bad omen is with Allah, rather you people are lying in temptation.'",
    "verse_48": "And there were nine persons in the city making mischief in the earth and did not like rectification.",
    "verse_49": "They said swearing by Allah among each other, 'We shall necessarily fall upon Saleh and his household by night, then we shall say to his heir, \"We were not present at the time of murder of the members of this family and undoubtedly, we are truthful.\"",
    "verse_50": "And they plotted their own plot and We made Our secret plan and they remained unaware.",
    "verse_51": "Then see how the end of their plot was; We destroyed them and their entire people.",
    "verse_52": "Then these are their houses overturned, the recompense of their oppression. Undoubtedly, in it there is a sign for the people who know.",
    "verse_53": "And We rescued those who believed and used to fear.",
    "verse_54": "And to Lut, when he said to his people, 'Do you come to indecency while you are seeing?",
    "verse_55": "'Do you approach men lustfully leaving women? Rather you are a people ignorant.'",
    "verse_56": "Then there was no answer of his people but that they said, 'Expel the family of Lut from your city; they are they who want cleanliness.'",
    "verse_57": "Then We delivered him and his family but his wife. We destroyed her that she is among those who stayed behind.",
    "verse_58": "And We rained upon them a rain, therefore what an evil rain was of those who were warned.",
    "verse_59": "Say you, 'All praise belongs to Allah and peace upon His chosen bondmen.' Is Allah Best, or their made associates?",
    "verse_60": "Or He Who made heavens and earth, and sent down for you water from the heaven, then We caused to grow therewith gardens full of loveliness; you had no power to cause their trees to grow. Is there any other God along with Allah? Nay they deviate from the path.",
    "verse_61": "Or He Who made the earth for habitation and set amidst it streams and made for it anchors (mountains) and a barrier between the two seas. Is there any other God along with Allah? Nay! Most of them know not.",
    "verse_62": "Or He Who listens to destitute when he calls upon Him and removes the evil and makes you successors in the earth. Is there any other God along with Allah? Very little you reflect.",
    "verse_63": "Or He Who guides you in the darkness of the land and the sea and He Who sends the winds bearing good tidings before his Mercy? Is there any other God along with Allah? Exalted is Allah above what they associate with Him.",
    "verse_64": "Or He Who originates the creation, and shall thereafter make it again? And He Who provides you from the heavens and the earth? Is there any other God along with Allah? Say you, 'Bring forward your proof if you are truthful.'",
    "verse_65": "Say you, 'Whosoever are in the heavens and earth do not know themselves the unseen but Allah. And they do not know when they will be raised up.'",
    "verse_66": "Has their knowledge reached to the knowing of the Hereafter? Nay, they are in doubt about it, rather they are blind to it.",
    "verse_67": "And the infidels said, 'What, when we and our fathers will become dust, shall we be brought forth again?",
    "verse_68": "'Undoubtedly, we have been promised this and before us our fathers, this is not but the tales of the ancients.'",
    "verse_69": "Say you, 'Travel in the earth and see how the end of the culprits was.'",
    "verse_70": "And grieve you not over them, and not be straightened on their plotting.",
    "verse_71": "And they say, 'When this promise will be fulfilled, if you are truthful?'",
    "verse_72": "Say you, ‘It is near that some of the things you are hastening for, may have come close behind you.'",
    "verse_73": "And undoubtedly, your Lord is Graceful for mankind but most of them are not grateful.",
    "verse_74": "And undoubtedly, your Lord knows what is hidden in their breasts and what they disclose.",
    "verse_75": "And as many unseen of the heavens and the earth are there, all are in a Book disclosing.",
    "verse_76": "Undoubtedly, this Quran explains to the children of Israel most of those things in which they differ.",
    "verse_77": "And undoubtedly, that is guidance and mercy for the Muslims.",
    "verse_78": "And undoubtedly, your Lord decide between them by His command, and He it is, the Honorable, the Knowing.",
    "verse_79": "Therefore put your trust in Allah. Undoubtedly, you are on clear truth.",
    "verse_80": "Undoubtedly you cannot make the dead hear, and nor you can make the deaf to hear the call, when they turn showing their backs.",
    "verse_81": "And you cannot guide the blind from their error. You can make only those hear who believe in Our sign sand they are Muslims.",
    "verse_82": "And when the word will fall upon them, We shall bring forth for them out of the earth a beast that shall talk to them, because the people had not believed in Our signs.",
    "verse_83": "And the Day when We shall raise from every group of people a troop of those who belied Our signs, then their first comers shall be stopped that those coming after may meet them.",
    "verse_84": "Till when all would have come, Allah will say, 'Did you belie My signs while your knowledge could not reach them. Or what you used to do?'",
    "verse_85": "And the word has already fallen upon them because of their wrong, so now they speak nothing.",
    "verse_86": "Have they not seen that We have made the night that they may rest therein, and the day sight giving? Undoubtedly, in them necessarily there are signs for those who believe.",
    "verse_87": "And the Day when the Trumpet shall be blown, then all those who are in heavens and those in the earth shall be unnerved but he whom Allah wills. And all were present before Him showing humility.",
    "verse_88": "And you shall see the mountains, you shall think that they are fixed, but they will be passing (like) the passing of the clouds. This is the work of Allah, Who made everything with wisdom. Undoubtedly, He is Aware of your works.",
    "verse_89": "Whoever brings good for him there is better reward than that, and they are secure that Day from bewilderment.",
    "verse_90": "And whoever brought evil, then their faces were lied down in the Fire. What reward you will get but only of that which you used to do.",
    "verse_91": "I have been commanded only to worship the Lord of this city, Who has sanctified it and His is everything, and I have been commanded to be of the obedient.",
    "verse_92": "And that I recite Quran; therefore whoever got guidance got it for his own good and whoever went astray, then say you, 'I am only a warner.'",
    "verse_93": "And say, 'All praise belongs to Allah, soon He will show you His signs, then you will recognize them.' And O beloved prophet! Your Lord is not unaware, O people, of your doings."
   },
    "count": 93
}
