{
    "name": "ar-Ra'd",
    "index": "013",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
       "verse_1": "Alif-Lam Mim Ra. These are the verses of the Book, and that which has been sent down from your Lord is the truth, but most men believe not.",
    "verse_2": "Allah is He Who raised up the heavens without the pillars that you can see, then He settled Himself on the throne as is befitting to His Dignity, and made the sun and the moon subservient. Each one runs to a term stated. Allah plans the work and details the signs so that you may believe the meeting with your Lord.",
    "verse_3": "And it is He Who stretched the earth and made therein anchors and rivers, and He made every kind of fruit in pairs two and two in the earth. He covers the night with the day. No doubt in that are signs for a people who reflect.",
    "verse_4": "And there are different regions adjoining each other, and there are gardens of grapes and are corn fields and palm trees growing from one base and separately, all are watered with one water; and in fruits, We make one to excel the other. No doubt, in that are signs for wise people.",
    "verse_5": "And if you wonder, then wondrous indeed is their saying that 'shall we be made anew after being dust? 'Those are they who denied their Lord, and those are they who will have shackles round their necks. And those are the people of Hell wherein they shall abide.",
    "verse_6": "And they ask you for hastening the torment before mercy, and the punishment of those before them have already occurred. And verily your Lord awards forgiveness even on the injustices of the people. And no doubt, the torment of your Lord is severe.",
    "verse_7": "And the infidels say, 'Why has not a sign been sent down upon him from his Lord.' You are only a warner and a guide to every people.",
    "verse_8": "Allah knows whatever is in the womb of any female and whatever the wombs diminish and whatever they increase. And everything with Him is with proper estimate.",
    "verse_9": "Knower of every hidden and open, The Greatest, The Exalted.",
    "verse_10": "All are alike, one who among you conceals his talks and one who utters openly, and one who hides himself in the night and one who walks by day.",
    "verse_11": "For man there are angels in succession before and behind him that they watch him by Allah's command, verily Allah alters not His blessing from any people until they themselves alter their condition. And when Allah desires evil to a people, then it cannot be turned back, and besides Him they have no Supporter.",
    "verse_12": "It is He Who shows you the lightning for fear and hope and raises the heavy clouds.",
    "verse_13": "And the thunder praising Him proclaims His Holiness and the angels with His awe, and sends thunderbolts then smites there with whom He wills while they are disputing about Allah, and His grip is severe.",
    "verse_14": "Calling to Him alone is true, and those whom they call upon besides Him, hear them not at all, but like him who is sitting stretching his hands before the water that it may reach his mouth, and it will never reach it. And every prayer of the infidels loses its way.",
    "verse_15": "And to Allah alone prostrates as many there are in the heavens and earth willingly or unwillingly and their shadows too every morning and evening.",
    "verse_16": "Say you, 'Who is the Lord of the heavens and the earth. Say yourself, 'Allah'. Say you, 'Have you then made supporters besides Allah, who can neither do good or evil even to themselves?' Say you, 'will the blind and the seeing be equaled? Or will the darkness and the light be equaled? Or have they set up such associates with Allah who have made something as Allah has made, then the making of Him and of theirs looked similar to them? Say you, 'Allah alone is the Creator of everything and He is the One, Dominant over all.'",
    "verse_17": "He sent down water from the sky, then the channels flow according to its capacity, then the flux of water carried with it the swelling foam, and from that over which they kindle a fire for making ornaments or other goods, arises foams similar to it. Thus Allah illustrates truth and falsehood. Then the foam is blown up and that which benefits mankind remains in the earth. Thus Allah illustrates the examples.",
    "verse_18": "For those who obeyed the commands of their Lord, there is good. And as for those who obeyed not His commands, if they had all that is in the earth, and the more like of it would have been in their possession, then they would have offered it for their ransom. These are they who will have an evil reckoning, and their abode is Hell. And what an evil place of rest.",
    "verse_19": "Shall he then who knows that what has been sent down to you from your Lord is truth be like him who is blind? Only those who have wisdom accept admonition.",
    "verse_20": "Those who fulfil the covenant of Allah and turn not entering into a covenant.",
    "verse_21": "And those who join what Allah has commanded to join, and fear their Lord and dread the evil reckoning.",
    "verse_22": "And those who kept patience for seeking the pleasure of their Lord, and kept up the prayer, and spent in Our path secretly and openly out of what We have provided them and drive away evil by means of goodness. For them is the profit of the last abode.",
    "verse_23": "Gardens for habitation in which they will enter, and those who are righteous from among their fathers, and wives and offspring and angels shall enter unto them from every door, saying:",
    "verse_24": "'Peace be upon you for your patience,' what an excellent last abode then you got.'",
    "verse_25": "And those who break the covenant of Allah after confirming it, and cut asunder what Allah has commanded to join, and spread mischief in the earth, their share is only curse and theirs is the evil abode.",
    "verse_26": "Allah increases the provision for whom He will and also He straitens, and the infidels were strut with the life of the world. And the life of the world is nothing in comparison to the life of the Hereafter but to pull on for some days.",
    "verse_27": "And the infidels say, 'why is not a sign from His Lord sent down to him.' Say you, 'Allah leads astray whomsoever He will and guides towards Him one who turns to Him.'",
    "verse_28": "They are those who have believed and their hearts find satisfaction with the remembrance of Allah. Behold, in the remembrance of Allah alone there is the satisfaction of hearts.",
    "verse_29": "Those who believed and performed good deeds for them is the bliss and good end.",
    "verse_30": "Thus We have sent you to a people before whom other peoples have passed in order that you may recite to them what We have revealed to you, and they are rejecting the Most Affectionate, Say you, 'He is my Lord, none is to be worshiped besides Him. I relied upon Him alone and to Him do I return.'",
    "verse_31": "And if there would have come a Quran by which mountains could be moved or the earth could be cut asunder or the dead could have spoken, even then too these infidels would not have believed, but the entire affair is under the authority of Allah. Did then the Muslims not become disappointed with it that if Allah had willed, He would have guided men altogether? And the thump will ever continue to smite the infidels for what they wrought or it will alight near their houses, until Allah's promise comes. Verily Allah does not do against His promise.",
    "verse_32": "And surely, the Messengers before you were mocked at, then I let loose the infidels for some days, then I seized them. Then how was My torment.",
    "verse_33": "Is then He Who watches every soul with his actions? And yet they ascribe to Allah associates. Say you, 'name them.' Or do you inform Him of what is not in His knowledge in the entire earth, or by the way an empty saying? Rather their fraud has been made to look good in the eyes of the infidels, and they have been hindered from the way. And he whom Allah leads astray has no guide.",
    "verse_34": "They shall be punished in the life of the world, and verily the torment of the Hereafter is hardest. And they have none to defend from Allah.",
    "verse_35": "The likeness of the Heaven which has been promised to the God-fearing, beneath it streams flow. Its fruits are everlasting and its shade. This is the end of those who fear Allah, and the end of the infidels is the Fire.",
    "verse_36": "And those to whom We have given the Book rejoice at what has been sent down to you, and of those groups there are some who deny a part thereof. Say you, 'I am only commanded to worship Allah and not to ascribe associate to Him. To Him I call, and to Him is my return.'",
    "verse_37": "And thus We have sent it down as a decision in Arabic. And O listener! If you will follow their desires after what has come to you of knowledge, then you shall have no supporter nor defender against Allah.",
    "verse_38": "And no doubt, We have sent Messengers before you, and assigned to them wives and children. And it is not for a Messenger to bring any sign, but by Allah's leave. For each promise there is a writing.",
    "verse_39": "Allah wipes out what He pleases and establishes (what he pleases) and the real writing is with Him.",
    "verse_40": "And if We show you any promise that is made to them or We call you to Us before, in any case upon you is only to deliver the message, and on Us is the reckoning.",
    "verse_41": "Do they not see that We are coming diminishing their population from all sides. And Allah commands, there is none to put back His command, and He is Swift in reckoning.",
    "verse_42": "And those before them have already plotted, but the entire secret plans belong to Allah. He knows what every soul earns. And the infidels are soon to know, who gets the last abode.",
    "verse_43": "And the infidels say, 'you are not a Messenger.' Say you, Allah is Sufficient as Witness between me and you, and he who has knowledge of the Book.'"
  },
    "count": 43
}
