{
    "name": "an-Nur",
    "index": "024",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "This is a chapter (Sura) that We have sent down and We have made obligatory its commandments, and We have sent down bright signs in it so that you may take heed.",
    "verse_2": "The adulteress and the adulterer, then flog each of them with hundred stripes, and you should not be compassionate for them in the religion of Allah if you believe in Allah and the Last Day. And let a party of the Muslims be present at the time of their punishment.",
    "verse_3": "The adulterer should not marry but an adulteress or an associatoress and marry not an adulteress but an adulterer or associator, and this deed is forbidden to the believers.",
    "verse_4": "And those who blame chaste women, then bring not four eyewitnesses, then flog them with eighty stripes and never accept any evidence of theirs; and it is they that are the disobedient.",
    "verse_5": "But those who repent thereafter and act aright, undoubtedly, then Allah is Forgiving, Merciful.",
    "verse_6": "And those who malign their own wives and they have no witnesses except themselves, then the evidence of any such of them is that he should bear witness four times in the name of Allah that he is truthful.",
    "verse_7": "And fifthly this that the curse of Allah be upon him if he be a liar.",
    "verse_8": "And the punishment shall avert from the wife if she bears witness four times in the name of Allah that the man is a liar.",
    "verse_9": "And fifthly this that the curse of Allah be upon the woman if the man is truthful.",
    "verse_10": "And if the grace of Allah and His mercy had not been upon you, and that Allah is Relenting, Wise, then He would have opened your secret.",
    "verse_11": "Undoubtedly, those who have brought this big slander are a party from among you. Consider it not an evil for you; rather it is good for you. For every one of them is the sin that he has earned, and among them he who took the greatest share, for him is the mighty torment.",
    "verse_12": "Why it did not happen when you had heard it that the Muslim men and Muslim women would have thought good of their own and would have said, 'This is the manifest slander'.",
    "verse_13": "Why did they not bring four witnesses against it? Therefore since they did not bring witnesses, then they are indeed liars in the sight of Allah.",
    "verse_14": "And if the grace of Allah and His mercy had not been upon you, in this world and the Hereafter, then a mighty torment would have touched you for the muttering into which you plunged.",
    "verse_15": "When you brought such talk on your tongues hearing from one another, and uttered with your mouths that of which you have no knowledge and thought it light, while it was great in the sight of Allah.",
    "verse_16": "And why it did not so happen, when you heard it you would have said, 'It is not befitting to us to speak about such thing? Allah, Hallowed be You; this is a great slander.",
    "verse_17": "Allah admonishes you never then to repeat like of it if you believe.",
    "verse_18": "And Allah explains to you His signs clearly. And Allah is Knowing, Wise.",
    "verse_19": "Those who desire that scandal should spread among the Muslims, for them is the painful torment in this world and the Hereafter, And Allah knows and you know not.",
    "verse_20": "And if there had not been the grace of Allah and His mercy upon you and that Allah is Kind enough, Merciful to you, (then you would have experienced its hardship).",
    "verse_21": "O believers; follow not the footsteps of the devil (Satan). And whoever follows the footsteps of the devil (Satan), then he will indeed tell only indecency and evil things. And if there had not been the grace of Allah and His mercy upon you, no one of you could have ever been cleansed, Yes Allah cleanses whosoever He like. And Allah is Hearing, Knowing.",
    "verse_22": "And swear not those among you who are men of excellence and of means against giving to the kinsmen and to the needy and to the emigrants in the way of Allah; and let them forgive and overlook. Do you not love that Allah should forgive you? And Allah is Forgiving, Merciful.",
    "verse_23": "Undoubtedly, those who malign unaware chaste believing women are cursed in the world and the Hereafter. And for them is the mighty torment.",
    "verse_24": "On the day when their tongues and their hands and their feet will bear witness against them as to what they used to do.",
    "verse_25": "On that day Allah will give them their true punishment in full, and they will know that Allah alone is the Manifest Truth.",
    "verse_26": "Dirty women are for dirty men and dirty men for dirty women and clean women are for clean men and clean men for clean women; they are free from what they are saying. For them is forgiveness and honorable provision.",
    "verse_27": "O believers! Enter not houses other than your own, until you take permission and salute the residents thereof. This is better for you, haply you may be heedful.",
    "verse_28": "But if you find not anyone therein, then also enter them not without the permission of the owners; and if you are told to go back, then go back, this is cleaner to you. And Allah knows your deeds.",
    "verse_29": "There is no sin on you that you enter those houses which are not especially for anyone's residence and you have discretion to use them. And Allah knows what you disclose and what you conceal.",
    "verse_30": "Order the Muslim men to lower down their sights a little and to guard their private parts. This is cleaner for them; undoubtedly, Allah is Aware of their deeds.",
    "verse_31": "And order the Muslim women to lower down their sights a little and guard their chastity and show not their adornment but as much which is itself apparent and remain putting their head coverings over their bosoms. And disclose not their adornment but to their husbands, or to their fathers, or the fathers of their husbands, or to their sons, or the sons of husbands or their brothers or the sons of their brothers or the sons of their sisters or the women of their religion or their handmaids who are the property of their hands or servants provided they are not men of sexual desire or the children who are unaware of the private parts of the women; and put not their feet forcibly \"on the ground that hidden adornment may be known. And repent to Allah, O Muslims altogether, haply you may get prosperity.",
    "verse_32": "And perform marriage of those among you who have not been married and of your suitable servants and handmaids. If they are poor, Allah will enrich them out of His Bounty. And Allah is Ample; Knowing.",
    "verse_33": "And let those who have no means to marry restrain themselves until Allah provides them means out of His Bounty. And from among your servants and handmaids the property of your hand those who wish that you should write for them freedom on the condition that they may earn some wealth, then write it for them if you know some good in them; and help them out of the wealth of Allah which He has given to you. And force not your maids to prostitution when they desire to live in chastity in order that you may get some goods of this world's life. And whosoever will force them, then undoubtedly, Allah after this that they remain in compulsion is Forgiving, Merciful.",
    "verse_34": "And undoubtedly, We have sent down to you manifest signs and some description of those who have passed away before you and admonition for those who fear.",
    "verse_35": "Allah is the Light of the heavens and the earth. The similitude of His Light is as a niche wherein is a lamp. The lamp is in a chandelier (of glass). The chandelier is as it were a star glittering like a pearl; it is lighted from the blessed olive tree which is neither of east nor of west, it is near that its oil may flare up even though the fire touches it not. The Light is upon the Light. Allah guides to His Light whomsoever He will. And Allah narrates examples for the people. And Allah knows all things.",
    "verse_36": "In those houses which Allah has ordered to be raised up and in them His name is remembered, Allah is glorified therein in the mornings and the evenings.",
    "verse_37": "By men whom neither trade nor business diverts from the remembrance of Allah and performing of prayer and paying of the poor-due (Zakat). They fear a day in which hearts and eyes shall be turned about.",
    "verse_38": "So that Allah may recompense them for their best works and give them more reward out of His Bounty. And Allah provides whomsoever He will without reckoning.",
    "verse_39": "And those who disbelieved, their works are like a mirage in a desert that the thirsty one thinks it to be water until when he came up to it, he found it to be nothing and found Allah near him, then He paid him his account in full. And Allah is Swift in reckoning.",
    "verse_40": "Or it is like the darkness in a deep sea, above which is a wave, above wave another wave, above which are clouds. There are layers of darkness one upon the other. When he puts out his hand, it seems not to be visible, and to whom Allah gives not light, for him there is no light anywhere.",
    "verse_41": "Have you not seen that all who are in the heavens and earth glorify Allah and so do the birds spreading their wings? Everyone knows his prayer and his way of glorifying. And Allah knows their deeds.",
    "verse_42": "And it is for only Allah the Kingdom of heavens and earth and to Allah is the return.",
    "verse_43": "Have you not seen that Allah drives the clouds softly, then joins them together, then piles them one over the other so that you see that rain comes out from the midst thereof? And He sends down from the sky wherein mountains of ice are, some hails out of them; then casts it over whom He will and turns it away from whom He will. It is very near that its flash of lightning may take away the sight.",
    "verse_44": "Allah turns about the night and the day. Undoubtedly in it is a lesson for those who have eyes.",
    "verse_45": "And Allah has created every beast from water. Then of them is one that walks on his belly, and of them is one that walks and his two feet, and of them is one that walks on his four feet. Allah creates what He pleases. Undoubtedly, Allah can do everything.",
    "verse_46": "Undoubtedly, We have sent down clear explanatory signs. And Allah guides whom He pleases to the straight path.",
    "verse_47": "And they say, 'we have believed in Allah and in the Messenger and we obeyed,' then some of them turn away after this. And they are not Muslims.",
    "verse_48": "And when they are called towards Allah and His Messenger that the Messenger may decide between them at that very time a party of them turns away.",
    "verse_49": "And if the right be upon their side, they would have come to him submitting.",
    "verse_50": "Is in their hearts a disease? Or do they doubt or they fear that Allah and His Messenger will be unjust to them? Nay, they themselves are unjust.",
    "verse_51": "The saying of Muslims is only this, when they are called towards Allah and Messenger that the Messenger may decide between them, then they say, 'We have heard and we obeyed.' And these are they who attained to their goal.",
    "verse_52": "And whoso obeys Allah and His Messenger and fears Allah and guards himself from evil, then such are the people who are successful.",
    "verse_53": "And they have sworn by Allah with utmost strength in their oath that if you will order them, necessarily, then they would come out for religious war, say, you, 'Swear not; obedience is required according to religious dogma. Allah knows what you do.'",
    "verse_54": "Say you, 'Obey Allah and obey His Messenger; therefore, if you turn your faces, then for the Messenger is that which was made incumbent on him and for you is that whose burden was put upon you, and if you will obey the Messenger, you will be guided. And upon the Messenger there is no responsibility but to deliver clearly.",
    "verse_55": "Allah has promised those among you who believed and performed good deeds that He will surely give them power to rule in the earth as was given to those who were before them; and He will surely consolidate their religion which He has chosen for them, and will surely change their fear of future with peace and security. They should worship Me and associate not anything with Me. And whoso is ungrateful after this, then they are the people disobedient.",
    "verse_56": "And establish prayer and give the poor-due (Zakat) and obey the Messenger; haply you may be shown mercy.",
    "verse_57": "Never think that the infidels may go out of Our control in the earth; and their destination is Fire and indeed what an evil end it is.",
    "verse_58": "O believers: let those servants your hands own and those of you who have not reached puberty ask leave of you three times - before the Morning Prayer, and when you put off your clothes at the noon and after the night prayer. These are three times of privacy for you. After these three times there is no sin on you or on them. They come and go about one to the other. Thus Allah narrates His signs for you. And Allah is Knowing, Wise.",
    "verse_59": "And when the children among you reach puberty, then they should also ask leave as asked those before them. Thus Allah narrates to you His signs, and Allah is Knowing, Wise.",
    "verse_60": "And the old retired women (past child bearing) who have no desire for marriage, on them there is no sin that they may lay aside their outer clothing when they display not their adornment. And to abstain from that even is better for them. And Allah is Hearing, Knowing.",
    "verse_61": "There is no harm for the blind and there is no harm for the lame and there is no restriction on the sick nor on anyone of you that you eat in the houses of your children or the houses of your fathers, or the houses of your mothers, or the houses of your brothers, or the houses of your sisters or the houses of your paternal uncles, or the houses of your paternal aunts, or the houses of your maternal uncles, or the houses of your maternal aunts, or from those places of which the keys are in your possession or from the house of your friend. There is no blame upon you whether you eat together or separately. Then when you enter any house, salute your own people, a nice greeting from Allah at the time of meeting, blessed, pure. Thus Allah narrates to you His signs that you may understand.",
    "verse_62": "Those are the only believers who have believed in Allah and His Messenger, and when they have come to the Messenger regarding any such matter for which they were collected, then go not away until they have asked leave of him. Those who ask leave of you, those are they who believe in Allah and His Messenger. Then when they ask leave of you for some affairs of their own, give leave to whom you will from among them and ask forgiveness of Allah for them. Undoubtedly, Allah is Forgiving, Merciful.",
    "verse_63": "Make not the summoning of the Messenger among yourselves, like one calls the other among you. Undoubtedly, Allah knows those of you who slip away quietly taking shelter of any excuse; therefore let those who do against the command of the Messenger fear lest some trial befall them or a painful torment overtake them.",
    "verse_64": "Take it for granted, undoubtedly, it is of Allah, 'Whatever is in the heavens and earth. Undoubtedly, He knows in what condition you are. And on the Day when they be returned to Him, then He will tell them whatever they did. And Allah Knows everything."
     },
    "count": 64
}
