{
    "name": "al-Mujadilah",
    "index": "058",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Surely, Allah heard the speech of her who pleads with you regarding her husband and makes her complaint to Allah, and Allah is hearing the conversation of you two. Verily Allah hears, beholds.",
        "verse_2": "Those of you who leave their wives calling them as their mothers, they are not their mothers. Their mothers are only those who gave them birth, and they certainly utter evil and purely false words. And undoubtedly, Allah is necessarily, Pardoning, Forgiving.",
        "verse_3": "And those who call their wives as in place of their mothers, then wish to retract what they have said, it is then incumbent upon them to free a slave before they touch each other. This is what you are admonished with, and Allah is Aware of your doings.",
        "verse_4": "But whoso finds not a slave, he should fast for two months continuously before they touch each other, and if anyone is unable to fast, then he should feed sixty poor people. This is so, that you may believe in Allah and His Messenger. And these are the limits of Allah, and for the infidels is a painful torment.",
        "verse_5": "Undoubtedly, those who oppose Allah and his Messenger were abased as those before them were abased; and We have undoubtedly sent down bright signs. And for the disbelievers is an humiliating punishment.",
        "verse_6": "The day Allah will raise them altogether, He will inform them of their doings. Allah has already kept an account of it, while they forgot it. And everything is before Allah.",
        "verse_7": "O listener! Have you not seen that Allah knows whatever is in the heavens and whatever is in the earth? Where there is secret counsel of three, then the fourth is He, and of five then the sixth is He, neither less than that nor more, but He is with them wherever they may be. Then on the Day of Resurrection He will inform them of what they did. Undoubtedly, Allah knows all things.",
        "verse_8": "Have you not seen them who were forbidden from evil counsels, then they do the same of what they were forbidden? And counsel among themselves of sin and transgressions and disobedience to the Messengers. And when they come to you, they greet you with the words with which Allah has not greeted you and they say within themselves; why does Allah not punish us, for what we utter, Sufficient to them is Hell wherein they shall be thrust; then what an evil end it is!",
        "verse_9": "O believers! When you counsel among yourselves, counsel not for sin and transgression and disobedience to the Messenger and counsel for virtue and piety, and fear Allah towards Whom you shall be gathered.",
        "verse_10": "That secret counsel is only from Satan (Devil) in order that he may grieve the believers and he cannot harm them at all without Allah's leave. And the Muslims should rely upon Allah only.",
        "verse_11": "O believers! When it is said to you; make room in assemblies, then do make room Allah will make room for you. And when it is said, 'rise up, then rise up; Allah will raise, in degree, those of you who believe and those who are endowed with knowledge. And Allah is Aware of your doings.",
        "verse_12": "O believers! When you desire to say anything secretly to the Messenger, then give some alms before your submission. This is better for you and purer. But if you are unable to give anything, then Allah is Forgiving, Merciful.",
        "verse_13": "Are you afraid of giving alms before your submission? But when you did not do so and Allah turned to you with His mercy, then keep up the prayer and pay poor due (Zakat) and remain obedient to Allah and His Messenger, And Allah is Aware of your doings.",
        "verse_14": "Have you not seen those who took for friends a people upon whom is Allah's wrath? They are neither of you nor of them, they swear falsely knowingly.",
        "verse_15": "Allah has already kept prepared severe torment for them. Undoubtedly, they do most evil work.",
        "verse_16": "They have taken their oaths as shield, and they hindered from the way of Allah, for them, therefore, is the humiliating torment.",
        "verse_17": "Their riches and their children will avail them nothing against Allah. They are men of Hell wherein they shall abide.",
        "verse_18": "The day when Allah will raise them altogether, then they will swear before Him as they are swearing before you and they think that they have done something. Do you hear? Undoubtedly, they are the liars.",
        "verse_19": "Satan (the Devil) has got control over them and has made them forget the remembrance of Allah. They are the party of Satan. Do you hear? Undoubtedly, it is the party of Satan that are the losers.",
        "verse_20": "Undoubtedly, those who oppose Allah and His Messenger, they are amongst the lowest.",
        "verse_21": "Allah has already decreed that most surely I will prevail, I and My Messengers. Undoubtedly Allah is Powerful, Dignified.",
        "verse_22": "You will not find a people who believe in Allah and the last Day taking as their friends those who opposed Allah and His Messenger, even though they be their fathers or their sons or their brethren or their kinsmen. These are they in whose hearts Allah has inscribed faith and helped them with a spirit from Himself, and will make them enter gardens beneath which flow streams, abiding therein, Allah is Pleased with them and they are pleased with Allah. This is Allah's party. Do you hear? It is Allah's party that is successful."
  },
    "count": 22
}
