{
    "name": "as-Sajdah",
    "index": "032",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif Lam Mim.",
        "verse_2": "The sending down of the Book, undoubtedly is from the Lord of the worlds.",
        "verse_3": "What they say, 'that it has been fabricated by him?' Nay, it is the truth from your Lord that you may warn such people to whom no warner came before you that haply they may get the way.",
        "verse_4": "Allah is He Who has made heavens and earth and whatever is in between them in six days, Then He seated Himself on the throne. You have no supporter nor intercessor leaving Him. Do you not then reflect?",
        "verse_5": "He plans the affairs from the heaven to the earth, then it will return to Him in a day whose measure is a thousand years in your counting.",
        "verse_6": "He it is, the Knower of every hidden and apparent, Honorable, Merciful.",
        "verse_7": "He Who whatever He made, made best, and He began the creation of man from the clay.",
        "verse_8": "Then He made his progeny from an extract of valueless water.",
        "verse_9": "Then He set him right and breathed into him of His spirit and gave you ears and eyes and hearts. What a little gratitude you acknowledge!",
        "verse_10": "And they said, 'what! When we shall be merged in the earth, shall we be made a new?' Nay! They even deny the presence before their Lord.",
        "verse_11": "Say you, 'the angel of death who has been appointed over you causes you to die, then you shall be returned to your Lord'.",
        "verse_12": "And if you could see when the culprits will be hanging their heads before their Lord, saying, 'O our Lord! now we have seen and have heard, send us back again that we may do good, we are convinced now'.",
        "verse_13": "And had We wished, We would have given to every soul its guidance, but My word has been already established that I shall necessarily fill the Hell with Jinn and men altogether.",
        "verse_14": "Now taste you, for you forgot the meeting of this day, We have left you, now taste the lasting torment the recompense of your doing.",
        "verse_15": "Those only believe in Our signs, who when they are reminded of them fall down prostrate and praising their Lord speak His Hallowness and they are not proud.",
        "verse_16": "Their sides keep away from beds and they call upon their Lord in fear and hope and spend in charity out of what We have provided them.",
        "verse_17": "And no soul knows what joy of eyes has been kept hidden for them, the recompense of their doings.",
        "verse_18": "Will then he who is a believer be like him who is disobedient, they are not equal?",
        "verse_19": "As to those who have believed and have done good deeds, for them are gardens for abiding, an entertainment for their doings.",
        "verse_20": "And as for those who are disobedient, their destination is the Fire. Whenever they will wish to come out from there, they will be returned back into the same and it will be said to them, 'taste the torment of this Fire which you used to belie'.",
        "verse_21": "And surely We will make them taste some of the nearer torment before the great torment, so that one who sees it may hope that just now they will turn back repenting.",
        "verse_22": "And who is more unjust than he who has been admonished by the signs of his Lord, then turned away his face from them? Undoubtedly We are to take revenge from the culprits.",
        "verse_23": "And undoubtedly, We bestowed Book on Musa, you therefore doubt not about meeting him and We made it a guidance for the children of Israel.",
        "verse_24": "And We appointed from amongst them some leaders that they guide by Our command, while they themselves endured patiently and they were convinced of Our signs.",
        "verse_25": "Undoubtedly, your Lord shall decide between them on the Day of Judgement concerning that in which they used to differ.",
        "verse_26": "And have they not been guided by this that We have already destroyed many generations before them in whose dwelling, they are today walking about? Undoubtedly in it are signs. Do then they hear not?",
        "verse_27": "And do they not see that We send water toward dry land, and produce thereby crops of which their cattle and they themselves eat? Do then they see not?",
        "verse_28": "And they say, 'when shall be this decision if you are truthful'?",
        "verse_29": "Say you, 'on the Day of Judgement the believing of infidels shall not avail them and nor will they get time.",
        "verse_30": "Therefore turn away your face from them and wait, undoubtedly, they are also to wait."
      },
    "count": 30
}
