{
    "name": "al-Qashash",
    "index": "028",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "TA — Sin — Mim.",
        "verse_2": "These are the verses of the luminous Book.",
        "verse_3": "We recite to you the true news of Musa and Firawn (Pharaoh) for those who believe.",
        "verse_4": "Undoubtedly, Firawn had got control in the earth and made its people his subordinates, he sought to weaken a group of them, slew their sons and let their women live. Undoubtedly, he was mischief-maker.",
        "verse_5": "And We desired that We should be Gracious to those weakened and make them leaders and should make them the inheritors of their country and wealth.",
        "verse_6": "And We should establish them in the earth and show to Firawn and Haman and their armies the same which they fear from them.",
        "verse_7": "And We inspired the mother of Musa, suckle him, when you may have fear for him, then cast him into river and fear not and nor grieve; undoubtedly, We shall return him to you and shall make him Messenger.",
        "verse_8": "Then the family of Firawn picked him up that he may become their enemy and there may be grief to them. Undoubtedly, Firawn and Haman and their armies were wrongdoers.",
        "verse_9": "And the wife of Firawn, said 'this child is the comfort to me and you, slay him not perhaps he may profit us or we may take him for a son,' and they were unaware.",
        "verse_10": "And next morning the heart of the mother of Musa became impatient. Surely it was near that she might have disclosed his condition, if We had not solaced her heart, that she might remain believing on Our promise.",
        "verse_11": "And his mother said to his sister 'follow him', then she remained observing him from a far, and they were not aware.",
        "verse_12": "And We had already forbidden all wet-nurses to him, then she said, 'shall I tell you of such a household who may bring up this child of yours, and they are his well-wishers.'",
        "verse_13": "Then We returned him to his mother that his mother might be comforted and not grieve, and she might know that the promise of Allah is true, but most of the people know not.",
        "verse_14": "And when he reached his grown up age and attained his full strength, We bestowed him judgement and knowledge. And thus We reward the good doers.",
        "verse_15": "And he entered the city, at a time, when the people of the city, were unaware in their noon's nap, and found there two men fighting, one was of Musa's party, and the other of his enemies.-Then the one that was of his party sought from Musa his help against him who was of his enemies. Therefore Musa gave a blow to him and put an end of him; he said, 'this is of the work of the devil (Satan)', undoubtedly, he is an enemy a clear misleader.",
        "verse_16": "He submitted, 'O my Lord, 'I have exceeded the limit against my soul, therefore forgive me, then the Lord forgave him. Undoubtedly, He it is the Forgiving, Merciful.",
        "verse_17": "He submitted, 'O my Lord as you have blessed me, therefore now I shall never be a helper to the culprits.'",
        "verse_18": "Then he passed the night in the city fearing and waiting anxiously what happens, when he saw that he who had sought help the day before is crying for help. Musa said to him, undoubtedly, you are manifestly a misguided man'.",
        "verse_19": "Then when Musa wished to lay hold of him who is an enemy to both, he said, 'O Musa! do you intend to kill me as you did kill a person yesterday'? You only intend to become violent in the land and intend not to reform.",
        "verse_20": "And a man came running from the far side of the city. He said, 'O Musa, undoubtedly, the chiefs are counselling together to kill you, therefore get away; I am your well-wisher'.",
        "verse_21": "Then he got out of the city fearing and waiting anxiously what happens now. He submitted, 'O my Lord, save me from the oppressors!'",
        "verse_22": "And when he diverted his attention towards Madian, he said 'it is near that my Lord may tell me the straight path'.",
        "verse_23": "And when he came at the water of Madian, there he saw a party of the people watering their animals, and at the other side of them, he saw two women that they are holding back their animals; Musa said, 'what is the condition of you two'? They said, 'we do not water until all shepherds take away their animals after watering, and our father is very old.'",
        "verse_24": "Then Musa watered their animals for them both, then turned back towards the shade, and said, 'O my Lord, I am in need of that food which You may send down for me.'",
        "verse_25": "Then one of the two came to him walking bashfully and said, 'my father invites you that he may give you wage for that you have watered our animals'. When Musa came to him and related to him the story, he said, 'fear not; you have been rescued from the oppressors'.",
        "verse_26": "One of the women said, 'O my father', employ him. Undoubtedly, the best employee is he who is strong and trustworthy'.",
        "verse_27": "He said, 'I intend that I may marry to you one of my two daughters on the condition of such a dower that you may serve me for eight years, but if you complete full ten years, then it will be from your side, and I do not desire to put you in hardship. It is near if Allah wills, you would find me of the righteous.",
        "verse_28": "Musa said, 'this has been agreed between me and you. Whichever of the two terms, I fulfil, then there is no demand against me. And Allah is Responsible over what we say'.",
        "verse_29": "When Musa fulfilled his term and departed with his wife, he observed a fire from the side of the Tur (Mountain) He said to his household, 'stay you here, I have observed a fire from the side of Tur, perhaps I may bring you some news from there, or I may bring to you any brand from the fire that you may warm yourself.",
        "verse_30": "Then when he came to fire, a call was-made from the right side of the valley in the blessed spot, out of the tree, 'O Musa, I am, I am Allah, the Lord of the entire world.",
        "verse_31": "'And cast down your staff. Then when, Musa saw it wriggling as it were a serpent, he set out turning his back and did not look behind. 'O Musa, come before and fear not, undoubtedly, you are secure.",
        "verse_32": "'Put your hand in your bosom, it will come out white shining without defect, and put your hand on your chest for removing the fear. So these are the two arguments of your Lord toward Firawn and his chiefs. Undoubtedly, they are disobedient people.'",
        "verse_33": "He said, 'I have killed a person from among them, I therefore, fear that they may kill me.",
        "verse_34": "'And my brother Haroon, he is more eloquent in speech than me, therefore appoint him a Messenger for my help that he may confirm me, I fear that they will belie me.'",
        "verse_35": "He said, 'it is near that We shall strengthen your arm with your brother and shall give you both dominance, then they could not harm you on account of Our signs. You both and those who will follow you shall triumph.'",
        "verse_36": "Then when Musa brought them Our bright signs, they said, 'this is nothing but magic fabricated, and we did not hear the like among our earlier fathers'.",
        "verse_37": "And Musa said, 'my Lord knows well him who brought guidance from Him and for whom will be the home of the Hereafter. Undoubtedly, the unjust reach not to the goal.",
        "verse_38": "And Firawn said, 'O chiefs, I know not for you any god besides myself; therefore, 'O Haman, after burning clay (bricks) build for me a high palace that perhaps I may ascend and peep into the God of Musa, and undoubtedly, I imagine that indeed he is a liar'.",
        "verse_39": "And he and his army wished unjust greatness in the land and thought that they are not to return towards Us.",
        "verse_40": "Therefore We seized him and his army and cast them into the river. See, then, how became the end of the oppressors.",
        "verse_41": "And We made them leaders of the people of Hell that they call towards the Fire; and they shall not be helped on the Day of Resurrection.",
        "verse_42": "And We set on curse to follow them in this world; and on the Day of Resurrection theirs is the ugly condition.",
        "verse_43": "And undoubtedly, We gave a Book to Musa after We had destroyed earlier generation, in which there are evident arguments for the people and guidance and mercy so that they may accept admonition.",
        "verse_44": "And you were not on the western side of Tur, when We sent the command of Prophet hood to Musa and nor you were present at that time.",
        "verse_45": "But it so happened that We produced generations and a very long period passed over them, and neither you were a de Weller among the people of Madian, reciting Our signs to them, yes We became the Sender of Messengers.",
        "verse_46": "And nor you were at the side of Tur, when We called, yes it is the mercy from your Lord (He gave you the knowledge of the Unseen) that you may warn a people to whom no warner came before you, haply they may be admonished.",
        "verse_47": "And had it not so happened if any calamity would have touched them for what their hands have sent before, they would say, 'O our Lord, why did You not send any Messenger towards us that we might have followed Your signs and might have believed.'",
        "verse_48": "Then when the truth came to them from Us, they said, 'why they were not given the like of what was given to Musa'? Had they not rejected what was given to Musa before'? They said, \"Two magic’s supporting each other\" and they said, \"We are rejecters of all the two.\"",
        "verse_49": "Say you, 'bring then any Book from Allah which is a better guide than these two, I shall follow it, if you are truthful'.",
        "verse_50": "Then if they accept not your saying, then, know you that they only follow their own desires. And who is more astray than one who follows his own desires separate from the guidance of Allah. Undoubtedly Allah guides not the unjust people.",
        "verse_51": "And undoubtedly, We have sent down for them the word in continuation that they may give heed.",
        "verse_52": "Those to whom We gave the Book before it, they believe in it.",
        "verse_53": "And when these signs are recited to them they say, 'We believed in it, undoubtedly, it is the only truth from our Lord, We had already submitted/even before.",
        "verse_54": "They will be given their reward twice the recompense of their patience, and they repel evil with good, and spend something out of what We have provided them.",
        "verse_55": "And when they hear vain talk, they turn away from it and say, 'for us our works, and for you your works. Peace be to you, we seek not the ignorant'.",
        "verse_56": "Undoubtedly, this is not that you may guide whomsoever you like on your own accord, yes, Allah guides whomsoever He will. And He knows well who are the guided.",
        "verse_57": "And they say, 'if we follow guidance with you we shall be taken away from our land by the people'. Have We not provided them a place in the safe sanctuary towards which all kinds of fruits are brought, a provision from Us? But most of them know not.",
        "verse_58": "And how many a city have We destroyed that behaved boastfully on their luxurious life. Then these are their homes which were not inhabited after them but a little. And only We are Inheritors.",
        "verse_59": "And your Lord destroys not the cities until He sends in their real resort a Messenger who may recite Our signs to them; and We destroy not the cities but when their inhabitants are oppressors.",
        "verse_60": "And whatever thing you have been given is the provision of this worldly life and its adornment, and whatever is with Allah is better and more enduring. Have you then no sense?",
        "verse_61": "Is then he whom We promised a goodly promise with which he will meet like him whom We allowed to enjoy the provision of this worldly life, then on the Day of Resurrection he will be presented arrested?",
        "verse_62": "And the Day when He calls them out, then will say, 'where are My those partners whom you so imagined'?",
        "verse_63": "Those against whom the word has been proved will say, 'O our Lord, these are they whom we led astray, we led them astray as we were strayed ourselves; we return to You being dis guided with them. They worshipped us not.'",
        "verse_64": "And it shall be said to them, call your partners, therefore they will call, but they shall not hear them, and they shall see the torment. What a good thing would have been if they had got the way!",
        "verse_65": "And the Day when He will call upon them, He will say, 'what answer did you give to Our Messengers?",
        "verse_66": "Then all news will become black to them on that Day, and they will not even ask each other.",
        "verse_67": "But as for him who repented and believed and did good deeds; it is near that he may be successful.",
        "verse_68": "And your Lord creates whatsoever He will and chooses. They have no power. Sanctified and Exalted is Allah from their association.",
        "verse_69": "And your Lord knows what is hidden in their breasts and what they disclose.",
        "verse_70": "And He is the only Allah there is no God besides Him. His is only praise in the world and in the Hereafter, and His is only command and to Him you shall be returned.",
        "verse_71": "Say you, look to it, if Allah makes the night continue over you till the Day of Resurrection, then who is God besides Allah who would bring you light. Do you then not hear?",
        "verse_72": "Say you, look to it, if Allah makes the day continue over you till the Day of Resurrection, then who is God besides Allah who would bring you a night wherein you might rest'. Do you not then see?",
        "verse_73": "And out of His mercy He has made for you the night and the day, that you may rest in the night and you may seek His bounty in the day and for this that you may accept the truth.",
        "verse_74": "And the Day when He will call upon them, He will say then, 'where are My those associates whom you talked idly'.",
        "verse_75": "And We shall after drawing a witness from every people say, 'bring your proof,' then they will know that the truth belongs to Allah, and that which they used to fabricate will be lost from them.",
        "verse_76": "Undoubtedly, Quaroon (Korah) was of the people of Musa, then he showed highhandedness against them, and We gave him so much treasures whose keys were a heavy burden over a party of strong men. When his people said to him, 'Exult not, undoubtedly Allah loves not those who exult.",
        "verse_77": "And seek by means of that treasure which Allah has bestowed on you, the home of the Hereafter, and forget not your share in the world and do good as Allah has done good to you and seek not mischief in the land. Undoubtedly Allah loves not the mischief-makers.",
        "verse_78": "He said, 'this indeed has been given to me because of a knowledge which is with me. And does he not know that Allah has destroyed before him such generations who were stronger in strength than him and greater in accumulation? And the culprits shall not be questioned of their sins.",
        "verse_79": "Then he came out of his people in his adornment. Those who desire the life of the world said, 'anyhow, we would too had the like of that Quaroon has been given, undoubtedly he has a great fortune?",
        "verse_80": "And those who were given knowledge said, 'woe to you', Allah's reward is better for him who believes and does good work, and it is given only to those who are patient.",
        "verse_81": "Then We caused him and his home to sink into the earth, and he had no party with him that it may help him to save against Allah, and nor he could take revenge.",
        "verse_82": "And in the morning those who had longed his position the day before began to say, 'it is strange' Allah increases the provision for whomsoever of His bondmen He please and straitens (for whomsoever He pleases), if Allah had not been Gracious to us, we too had been caused to sink. Ah', there is no good for infidels.",
        "verse_83": "This home of the Hereafter, We assign it to those who desire not exaltation in the earth, nor disorder. And the end is only for those who are pious.",
        "verse_84": "Whoever brings good, for him is better than it; and whoever brings evil, the doers of evil shall not be recompensed but what they did.",
        "verse_85": "Undoubtedly, He who has made the Quran binding on you, will bring you back where you desire to return. Say you, 'my Lord knows him well who has brought the guidance and him who is in open error.",
        "verse_86": "And you did not expect that the Book would be sent to you, yes your Lord showed His Mercy, therefore never be a backer of the infidels.",
        "verse_87": "And let them never bar you from the signs of Allah after they have been sent down to you, and call towards your Lord and be never among polytheists.",
        "verse_88": "And worship not another god with Allah. There is no God besides Him. Everything is perishable save His Being. His is the command and towards Him you shall be returned."
       },
    "count": 88
}
