{
    "name": "Shad",
    "index": "038",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "By this renowned Quran.",
        "verse_2": "Rather the infidels are in pride and schism.",
        "verse_3": "How many a generation We destroyed before them, then now they cried when there was no time for deliverance.",
        "verse_4": "And they were surprised that a warner from among themselves came to them, and the infidels said, 'this is a magician, a great liar.",
        "verse_5": "'Has he made one God of many gods? Undoubtedly, this is a strange thing.'",
        "verse_6": "And the chiefs of them departed saying, 'go away from him and be steadfast to your gods; undoubtedly, he has some object in this!",
        "verse_7": "'We have not heard about this even in the latest religion of Christianity. This is indeed wholly a new invention.",
        "verse_8": "'Has the Quran been sent upon him from amongst us all?' Nay, rather they are in doubt concerning My Book. Nay, they have not yet tasted My chastisement.",
        "verse_9": "Are they treasurers of the mercy of your Lord, the Dignified, the Bestower?",
        "verse_10": "Is the kingdom of the heavens and earth and what is between them for them? If so, let them ascend by hanging ropes.",
        "verse_11": "This is a disgraced host from amongst the confederates which shall be made to flee to the same place.",
        "verse_12": "Before them the people of Nuh, and Aad and pharaoh (Firawn) the contriver of stakes have already belied (the Messengers).",
        "verse_13": "And Samud and the people of Lut and dwellers of the wood. These are those parties.",
        "verse_14": "There is none among them but belied the Messengers, so My torment became inevitable.",
        "verse_15": "And they wait not but of a single roaring cry which no one can turn away.",
        "verse_16": "And they said, \"O our Lord, hasten to us our shares before the Day of Reckoning.'",
        "verse_17": "Bear you patiently at what they say; and remember Our bondman Daud a man of blessings; undoubtedly, he is a great penitent.",
        "verse_18": "Undoubtedly, We have subjected mountains, that they with him glorify Allah at evening and sunrise.",
        "verse_19": "And the birds assembled; all were obedient to him.",
        "verse_20": "And We strengthened his kingdom and bestowed wisdom and decisive speech upon him.",
        "verse_21": "Has the tidings of the claimants reached to you when they came into Daud's mosque jumping over the walls?",
        "verse_22": "When they entered upon Daud, he became confused on account of them. They said, ‘fear not, we are two disputants, one has shown high-handedness against the other, therefore decide between us with truth and be not unjust and guide us to the right path.",
        "verse_23": "Undoubtedly, this is my brother, he has ninety nine ewes and I have one ewe, now he says, entrust this one also to me and presses me in speech.",
        "verse_24": "Daud said, 'undoubtedly, he is doing injustice in demanding your ewe to add to his ewes. And certainly, many of the partners show high-handedness against each other, but those who believed and did good, and they are very few. Now Daud guessed that We had tested him, therefore, he begged forgiveness of his Lord and fell in prostration and turned (to Allah).",
        "verse_25": "Then We forgave him that. And verily he has necessarily nearness to Us and an excellent resort.",
        "verse_26": "O Daud, undoubtedly, We have made you a vicegerent in the earth, therefore order between mankind with truth, and follow not desire, otherwise it would cause you to go astray from the path of Allah. Verily, those who go astray from the path of Allah, there is for them a severe torment for that they have forgotten the Day of Reckoning.",
        "verse_27": "And We have not made the heavens and the earth and what is in between them in vain. This is the thought of the infidels. Therefore woe is to the infidels because of the Fire.",
        "verse_28": "Shall We make those who have believed and have done good deeds like those who spread mischief in the earth or make the pious ones like wicked disobedients?",
        "verse_29": "This is a Book that We have sent down towards you Blessed, so that they may ponder on its signs and that the men of wisdom may be admonished.",
        "verse_30": "And We bestowed Sulaiman on Daud. What a fine bondman! Verily, he was most repenting.",
        "verse_31": "When in the afternoon were presented to him horses when at ease standing on three feet and touching the ground with the tow of fourth foot, and when they run, they are very swift.",
        "verse_32": "Then Sulaiman said, 'I have loved the love of these horses for the remembrance of my Lord'. Then he ordered to drive them until they were hidden from his sight behind the veil.",
        "verse_33": "Then he ordered that 'bring them back to me. 'Then he began to pass his hand over their shanks and necks.",
        "verse_34": "And undoubtedly, We tested Sulaiman and placed on his throne a lifeless body, then he turned repented.",
        "verse_35": "He said, 'O my Lord, forgive me, and bestow me a Kingdom which may not suit to anyone else after me. Undoubtedly, You are the Big Bestower.",
        "verse_36": "Then We subjected the wind to him that it ran by his commandment softly, wherever he desired.",
        "verse_37": "And subjected to him the giants (Saitans), every builder and diver.",
        "verse_38": "And others bound in fetters.",
        "verse_39": "This is Our gift, now you do favor upon whom you like or withhold, there is no reckoning upon you.",
        "verse_40": "And undoubtedly, he has necessarily nearness to Us and an excellent resort.",
        "verse_41": "And remember Our bondman Ayoob (Job). When he called his Lord that 'the devil (Saitan) has touched me with affliction and oppression.'",
        "verse_42": "We said, 'strike your foot with the ground, here is the cool, stream for bathing and for drinking.'",
        "verse_43": "And We bestowed him his family and others like them in addition to them as a mercy from Us and as admonition to the people of understanding.",
        "verse_44": "And We said, 'take in your hand a broom of dry grass and strike therewith and break not your oath. Undoubtedly, We found him steadfast, What an excellent bondman he was! Verily he is of returning.",
        "verse_45": "And remember Our bondmen Ibrahim and Ishaq and Yaqoob the men of authority and knowledge.",
        "verse_46": "Verily, We distinguished them with a distinct speech that is the remembrance of that abode (Hereafter).",
        "verse_47": "And undoubtedly, they are in Our sight chosen and favorites.",
        "verse_48": "And remember Ismail and Al- Yasa and Zulkifl. And they are all excellent ones.",
        "verse_49": "This is an admonition. And undoubtedly, the resort of pious ones is good.",
        "verse_50": "Gardens of perpetual abode the doors of which are open for them.",
        "verse_51": "Reclining therein on cushions, therein they ask for plenty of fruits and drink.",
        "verse_52": "And they have such wives with them that they look not towards others save their husbands, Companions of equal age.",
        "verse_53": "This is what you are promised for the Day of Reckoning.",
        "verse_54": "Undoubtedly, this is Our provision which will never be exhausted.",
        "verse_55": "This is for them (believers). But undoubtedly, for the contumacious is the evil resort.",
        "verse_56": "Hell, that they shall enter it, then what an evil couch!",
        "verse_57": "This is for them, therefore let them taste it, boiling water and pus.",
        "verse_58": "And other couples of torments of the same nature.",
        "verse_59": "They will be told, ‘this is a troop of yours rushing-in along with you'. They will say, 'let them not get any open place. They are indeed to enter the Fire, let them remain there too in a strained place.'",
        "verse_60": "The followers said, 'nay! Rather you should not get an open place. You brought this distress to us'. Therefore what an evil destination it is.",
        "verse_61": "They said, 'O our Lord, whoso brought this distress to us, increase him in torment twofold in the Fire.'",
        "verse_62": "They said, 'what has happened to us that we see not the men whom we used to count among evil ones.",
        "verse_63": "'Did we treat them in ridicule or our eyes are turned away from them?'",
        "verse_64": "Undoubtedly, it is necessarily a truth, the disputing together of the people of the Fire.",
        "verse_65": "Say you, 'I am only a warner, and there is no God but Allah, the One' All Dominant.",
        "verse_66": "'The Lord of the heavens and the earth and whatever is in between, the Dignified, the Great Forgiver'.",
        "verse_67": "Say you, 'that is a supreme news.",
        "verse_68": "'You are negligent of it.",
        "verse_69": "'What knowledge I had about heavenly world, when they disputed.",
        "verse_70": "'I am only revealed that I am not but a manifest warner.'",
        "verse_71": "When your Lord said to the angels, 'I shall make man from the clay.",
        "verse_72": "'And so when I have fashioned him perfectly, and have breathed into him of My spirit, fall you down prostrating for him.'",
        "verse_73": "Therefore angles fell down prostrate, all of them together.",
        "verse_74": "But Iblis He waxed proud, and he was among the infidels.",
        "verse_75": "Allah said, 'O Iblis, what hindered you from falling prostrate before that which I made with My own hands? Have you been proud or you were indeed among haughty ones?'",
        "verse_76": "He said, 'I am better than he, You have made me of fire and created him of clay'.",
        "verse_77": "Allah said, 'get you out from the Heaven, for you are rejected.",
        "verse_78": "'And undoubtedly, My curse is on you till the Day of Judgement.'",
        "verse_79": "He said, 'O my Lord, if it is! So, then grant me respite till the day when they are raised'.",
        "verse_80": "Allah said, 'certainly, you are of those that are granted respite.",
        "verse_81": "'Till the day of the known time'.",
        "verse_82": "He said, 'By Your Dignity I shall necessarily, beguile them all.'",
        "verse_83": "'But those among them who are Your chosen bondmen'.",
        "verse_84": "Allah said, 'then the truth is this, and I speak the truth.",
        "verse_85": "'Undoubtedly, I shall necessarily fill Hell with you and of those who will follow you altogether.'",
        "verse_86": "Say you, 'I ask of you no wage for this Quran nor I am of those who affect.",
        "verse_87": "'That is not but an admonition to the entire world.",
        "verse_88": "'And you shall surely know its news after a time."
       },
    "count": 88
}
