{
    "name": "al-Jatsiyah",
    "index": "045",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Ha — Mim.",
    "verse_2": "The sending down of the Book is from Allah, the Honorable, the Wise.",
    "verse_3": "Undoubtedly, there are signs in the heavens and the earth for the believers.",
    "verse_4": "And in your creation, and what He scatters of animals, there are signs for a people who are fully convinced.",
    "verse_5": "And in the alternation of night and day and in this that Allah has sent down rain the means of the provision from the sky, whereby He gave life to the earth after its death and in the turning about of the winds, there are signs for the people of understanding.",
    "verse_6": "These are the sings of Allah that We rehearse to you with truth. In what word then, after leaving Allah and his signs, will they believe?",
    "verse_7": "Woe is to every imposter, sinner!",
    "verse_8": "Who hears the sings of Allah being recited to him, then persists proudly, as if he has not heard them, so give him the glad tidings of a painful torment.",
    "verse_9": "And when he comes to know anything from Our signs, he takes them in mockery. For them is an abasing torment.",
    "verse_10": "Behind them is the Hell and nothing will avail them what they have earned, nor those whom they had taken as supporters beside Allah. And for them is the great torment.",
    "verse_11": "This is a guidance, and for those who disbelieved the signs of their Lord is the severest punishment of a painful torment.",
    "verse_12": "Allah is He Who has subjected to you the river that the boats, may run on it by His command, and that you may seek His bounty and that you may be grateful.",
    "verse_13": "And has made to work for you whatsoever is in the heavens and whatsoever is in the earth by His Command. Verily in it are signs for a people who reflect.",
    "verse_14": "Tell to the believers pardon those who hope not for the days of Allah so that Allah may recompense a people for their earnings.",
    "verse_15": "Whosoever does good, does it for his own soul, and whosoever does evil, does it for his own loss. Then to your Lord will you all be returned back.",
    "verse_16": "And undoubtedly, We bestowed the children of Israel, the Book, the Government and the Prophet hood, and We provided them with pure things and exalted them over the people of their time.",
    "verse_17": "And We gave them bright arguments regarding this affair, so they differed not but after true knowledge had come to them through mutual jealousy. Undoubtedly, your Lord will decide between them on the Day of Judgement concerning that wherein they differ.",
    "verse_18": "Then We set you upon a nice path of that affair, therefore follow it and associate not with the desires of those who know not.",
    "verse_19": "Undoubtedly, they will avail you nothing against Allah. And verily, the unjust people are Friends to one another. And the friend of God-fearing is Allah.",
    "verse_20": "This opens the eyes of the people and is a guidance and mercy for a people believing.",
    "verse_21": "Do those who have committed evil deeds think that We shall make them like those who have believed and have done good works, so that their life and their death should be equal? What an evil judgement they give?",
    "verse_22": "And Allah made the heavens and the earth with truth and that every soul may be recompensed for his earnings and they shall not be wronged.",
    "verse_23": "See you then, he who has made his desire to be his God and Allah led him astray despite his knowledge and set a seal upon his ears and his heart and laid a covering on his eyes. Who would guide him after Allah. Do you not then heed?",
    "verse_24": "And they said, 'that is not but this our worldly life, we die and we live and none destroys us but the time, and they have no knowledge of it, they merely conjecture.",
    "verse_25": "And when Our bright signs are recited to them, then their only arguments is that they say, 'bring our fathers, if you are truthful'.",
    "verse_26": "Say you, 'Allah gives life to you, then He will make you die, then He shall gather you all on the Day of Resurrection of which there is no doubt, but most men know not.",
    "verse_27": "And for Allah is the Kingdom of the heavens and the earth and on the Day when the Hour shall be established, upon that day the people of falsehood will be the losers.",
    "verse_28": "And you shall see every people on their knees. Every people will be summoned to their record. Today you shall be recompensed for your doings.",
    "verse_29": "Our this writing speaks truth against you. We were recording whatever you did.",
    "verse_30": "But those who have believed and have done good works, their Lord will take them in His Mercy, This is the open triumph.",
    "verse_31": "And those who disbelieved, it will be said to them, 'were not My signs recited to you, but you used to wax proud and you were a people guilty.",
    "verse_32": "And when it is said, 'verily the promise of Allah is true and there is no doubt in the Hour,' you used to say, 'we know not what the Hour is, we have only a surmise and we are not convinced.'",
    "verse_33": "And the evil of their deeds became apparent to them and they have been encompassed by the torment that they mocked at.",
    "verse_34": "And it will be said to them, 'Today We shall leave you as you had forgotten the meeting of this your day, and your destination is the fire and you have no helper.",
    "verse_35": "That is for that you took the signs of Allah in mockery and the life of the world deceived you. Therefore today neither they will be taken out from the fire nor anyone will wish that they may please Allah.",
    "verse_36": "All praise, then, to Allah, the Lord of the heavens, the Lord of the earth and the Lord of the worlds.",
    "verse_37": "And for Him is the Greatness in the heavens and in the earth and He is the Honorable, Wise."
 },
    "count": 37
}
