{
    "name": "at-Tahrim",
    "index": "066",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "O the communicator of the Unseen (Prophet! why do you forbid for yourself what Allah has made lawful to you, seeking the pleasure of your wives? And Allah is Forgiving, Merciful.",
        "verse_2": "Undoubtedly, Allah has ordained for you absolution from your oaths; and Allah is your Protector, and Allah is Knowing, Wise.",
        "verse_3": "And when the Prophet told a secret matter to one of his wives, then when she disclosed it and Allah disclosed it to the Prophet, the Prophet made known to her some part, and overlooked some part thereof. And when the Prophet informed her of it she said, 'who has informed you of it. He said, The Knowing, the Aware has informed me.'",
        "verse_4": "If you two wives of the Prophet turn towards Allah for your hearts are necessarily deviated from the path, but if you two force him, then undoubtedly, Allah is his helper, and Gibrael, and the righteous believers and after that the angels are his helpers.",
        "verse_5": "It is possible that, if he divorce you, his Lord may give him in exchange better wives than you, obedient, believing, well mannered, penitent, devout in worship, fasting, married, and virgins.",
        "verse_6": "O believers!, 'save yourselves and your family members from the Fire whose fuel is men and stones, over which are appointed angels, stern and severe, who disobey not the Command of Allah and do what they are commanded.",
        "verse_7": "O you the infidels! Do not make excuses this day, You shall only be recompensed for what you used to do.",
        "verse_8": "O believers! Turn towards Allah in such a way that it may become an admonition for future. It may be that your Lord will remove your evils from you, and make you enter the Gardens beneath which flow streams, the day when Allah will not disgrace the Prophet and those who believe with him. Their light will be running in front of them and no their right hands. They will say, 'O our Lord! Complete our lights for us and forgive us. Undoubtedly, You have authority over everything.'",
        "verse_9": "O the Communicator of unseen (Prophet)! Strive hard against the infidels and hypocrites and be strict against them, and their destination is Hell. And what an evil end it is.",
        "verse_10": "Allah sets forth the example of the Infidels, the wife of Nuh and the wife of Lut. They were under marriage of Our two near ones bondmen, then they defrauded them. So they availed them nothing against Allah and it was said to them, enter you both into the Fire with those who enter.",
        "verse_11": "And Allah sets forth the example of Muslims, the wife of Firawn. When she said, 'O my Lord! build a house for me in the Paradise with you, and deliver me from Firawn and his work and deliver me from the people unjust.",
        "verse_12": "And Maryam the daughter of Imran who preserved her chastity, so We breathed into her of Our spirit and she confirmed the words of her Lord and His Books and became of obedients."
  },
    "count": 12
}
