{
    "name": "al-Hasyr",
    "index": "059",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "All that is in the heavens and all that is in the earth glorifies Allah; and He is the Esteemed, the Wise.",
        "verse_2": "It is He Who expelled the infidels of the Book from their homes for their first assemblage; you did not imagine that they would go forth and they thought that their fortresses would defend them against Allah. But the command of Allah came to them whence they reckoned not, and it cast terror into their hearts that they destroy their dwellings with their own hands and the hands of the Muslims. Therefore take heed, O you with eyes!",
        "verse_3": "And had it not been that Allah had decreed for them to be uprooted from their homes, He would have punished them in this world. And for them is a torment of Fire in the Hereafter.",
        "verse_4": "This because they resisted Allah and His Messenger and whose resists Allah and His Messenger - then undoubtedly, the torment of Allah is severe.",
        "verse_5": "Whatever trees you cut down or left standing upon their roots, that was all by the leave of Allah and that He might disgrace the disobedient.",
        "verse_6": "And whatever spoils Allah gave to His Messenger from them, you rushed neither horse nor camel upon it, yes, but Allah gives control to His Messengers over whomsoever He please. And Allah can do everything.",
        "verse_7": "Whatsoever spoil Allah gave to His Messenger from the people of the cities is for Allah and His Messenger and for the near relation, and orphans and the needy and the wayfarer, so that it be not the wealth of your rich. And whatsoever the Messenger gives you, take it, and whatsoever he forbids you, abstain from that. And fear Allah; undoubtedly, the torment of Allah is severe.",
        "verse_8": "For those poor refugees who were driven out from their homes and their possessions seeking grace of Allah and His pleasure, and helping Allah and His Messenger. They are the truthful.",
        "verse_9": "And those who had established their home is this city and in faith from before, love those who emigrated to them, and find not in their breasts, any need for what they have been given and prefer them above their souls, even though they be badly in need of, and whoso is guarded against the avarice of his own soul, those they are the successful.",
        "verse_10": "And those who came after them submit, O our Lord! Forgive us and our brothers who preceded us in the faith, and put not into our hearts any rancor towards those who believe. O our Lord! Undoubtedly you are the Beneficent the Merciful.",
        "verse_11": "Have you not seen the hypocrites? They say to their brothers, the infidels of the Book, 'if you are turned out, we will surely go with you, and will never obey anyone against you, and if you are fought against, we will surely help you. And Allah witnesses that they are liars.",
        "verse_12": "If they are turned out, they will not go forth with them, and if they are fought against, they will not help them. Even if they helped them, they would then run away turning their backs and then they shall not be helped.",
        "verse_13": "Undoubtedly, they have greater fear of you in their hearts than of Allah. This is because they are a people having no understanding.",
        "verse_14": "They shall not even fight against you altogether, but in fortified cities or from behind walls. Their velour is severe among themselves. You will think them as united gang, but their hearts as scattered. This is because they are a people having no sense.",
        "verse_15": "They are like those who were just a short time before them. They tasted the evil consequences of their doings, and for them is the painful torment.",
        "verse_16": "Like Satan (devil) when he said to man, 'disbelieve', and then when he disbelieved, he said, 'I am quit of you, I fear Allah the Lord of the entire world.'",
        "verse_17": "And the end of both was this that they both are in Fire, abiding therein. And such is the punishment of the unjust.",
        "verse_18": "O believers! Fear Allah and let every soul should see that what it sent forth for the morrow, and fear Allah. Undoubtedly Allah is Aware of your doings.",
        "verse_19": "And be not like those who have already forgotten Allah, and so He put them in distress that they may not remember their own souls, it is they that are disobedient.",
        "verse_20": "The inhabitants of the Fire and the inhabitants of the Paradise are not equal. The inhabitants of the Paradise they attained to their goal.",
        "verse_21": "If We had sent down this Quran upon any mountain, you would certainly have seen it humbled and split asunder for fear of Allah. And these examples, We propound for mankind that they may reflect.",
        "verse_22": "He is Allah, besides Whom there is none to be worshipped, the Knower of everything hidden and open. He is the Most Affectionate, the Merciful.",
        "verse_23": "He is Allah, besides Whom none is to be worshipped the Sovereign, the most Holy, the Bestower of peace, the Giver of Security, the Protector, the Esteemed one, the Exalted the Majestic. Glory is to Allah from what, they associate.",
        "verse_24": "He is Allah, the Maker, the Creater, the Bestower of form to everyone. His are all good names; all that is in the heavens and the earth glorifies Him; and He is the Esteemed One, the Wise."
    },
    "count": 24
}
