{
    "name": "al-Mulk",
    "index": "067",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Immensely blessed is He Whose control is the entire Kingdom, and He has authority over everything.",
        "verse_2": "He, Who has created death and life that He might test you, as to whose work is excellent among you. And He is the Esteemed One, the Forgiving.",
        "verse_3": "Who made seven heavens one upon the other. What difference do you see in the making of the Most Affectionate? Then look again carefully, do you see any crack?",
        "verse_4": "Then look again and again, the sight will return back to you defeated and fatigued.",
        "verse_5": "And undoubtedly, We adorned the lower heaven with lamps, and made them things to beat devils, and prepared for them the torment of blazing fire.",
        "verse_6": "And for those who disbelieved in their Lord, there is the torment of Hell. And what an evil end it is!",
        "verse_7": "When they shall be thrown in it, they will hear the braying as it boils up.",
        "verse_8": "It seems that it will almost burst with severe fury. Whenever any group shall be thrown in it, its keepers will ask them, did no warner come to you.",
        "verse_9": "They will say, 'why not, yes indeed, the warner came to us, but we belied him and said, \"Allah has sent down nothing; you are not, but in great error.\"",
        "verse_10": "And they will say, 'if we had heard or reflected, we would not have been among the fellows of the Hell.",
        "verse_11": "Now they confessed their sins, then Curse be the fellows of the Hell.",
        "verse_12": "Undoubtedly, those who fear their Lord unseen, for them is forgiveness and great reward.",
        "verse_13": "And whether you keep your discourse secret or disclose, He knows full well the thoughts of your breasts.",
        "verse_14": "Will not He Who has created know? And it is He Knowing every subtle, the Aware.",
        "verse_15": "It is He Who has made the earth submissive to you, therefore traverse through its tracks and eat of His provision. And to Him is the rising up.",
        "verse_16": "Have you become fearless of Him whose Kingdom is in the heaven, that He may bury you in the earth, henceforth it remains shaking?",
        "verse_17": "Or have you become fearless of Him Whose Kingdom is in the heaven that He may send against you stoning. Now you will know how was My warning?",
        "verse_18": "And undoubtedly, those before them belied, then how was My rejection.",
        "verse_19": "And have they not seen birds above them, spreading out their wings and closing them? None withholds them save the Most Affectionate Allah. Undoubtedly, He sees all things.",
        "verse_20": "Or which is your army that shall help you against the Most Affectionate Allah? The infidels are not but in delusion.",
        "verse_21": "Or who is he, who may provide you, if He withholds His provision? Nay, but they have become shameless in contumacy and disdain.",
        "verse_22": "Is he who walks prone on his face better guided than he who walks upright on a straight path?",
        "verse_23": "Say you, 'it is He Who produced you, and made for your ears and eyes and hearts.' How little you accept the truth?",
        "verse_24": "Say you, 'it is He Who has spread you in the earth, and towards Him you shall be raised.",
        "verse_25": "And they say, 'when this promise will come to pass. If you are truthful.'",
        "verse_26": "Say you, 'the Knowledge of it is with Allah, and I am only a clear warner.'",
        "verse_27": "Then when they will see it near at hand, the faces of the infidels will be vexed, and it will be said to them, 'this is what you used to ask for.'",
        "verse_28": "Say you, 'look to it, if Allah destroys me and those with me or has mercy on us, then who will protect the infidels from the painful torment?'",
        "verse_29": "Say you, 'He is the Most Affectionate, we believed in Him and relied upon Him, then now you will know, who is in manifest error.'",
        "verse_30": "Say you, 'look to it, if your water in the morning go deep in the earth, then who would bring you water running before your eyes?'"
      },
    "count": 30
}
