{
    "name": "Maryam",
    "index": "019",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Kaaf-Ha-Ya, Ain — Saad.",
    "verse_2": "This is the record of that mercy of your Lord which He showed to His bondman Zakaria.",
    "verse_3": "When he called his Lord secretly.",
    "verse_4": "He submitted, 'O My Lord, my bone is weakened and the flame of oldness appeared from the head, and O my Lord, I never remained unsuccessful after calling You.",
    "verse_5": "'And I fear my relations after me, and my wife is barren, then bestow me from yourself anyone who may take over my work.",
    "verse_6": "'He should be my heir and be the heir of the children of Yaqoob (Israel) and O my Lord! Make hijri acceptable.'",
    "verse_7": "O Zakaria! We give you glad tidings of a son whose name is Yahya. We have no made anyone of this name before him.",
    "verse_8": "Submitted he, 'O my Lord, from where I shall have a son when my wife is barren and I have reached the condition of being emaciated due to old age.'",
    "verse_9": "He said, 'so it is, your Lord said, \"That is easy to Me and indeed I made you before at a time when you were nothing.\"",
    "verse_10": "Submitted he, 'O my Lord, give me any sign', He said, 'Your sign is this that you speak not to people three days and nights being healthy.'",
    "verse_11": "Then he came out to his people from the mosque and he beckoned to them, continue glorifying morning and evening.",
    "verse_12": "O Yahya, (Jhon) hold fast the Book. And We bestowed him Prophet hood in his childhood.",
    "verse_13": "And kind-heartedness from Us and purity. And he was utmost God-fearing.",
    "verse_14": "And was well-behaved towards his parents and was not arrogant, disobedient.",
    "verse_15": "And peace is on him the day when he was born, and the day, when he will die, and the day, when he will be raised alive.",
    "verse_16": "And remember Maryam (Mary) in the Book; when she went a part from her family towards a place in the east.",
    "verse_17": "Then she put a screen away from them, then We sent Our spiritual towards her, he appeared before her in the shape of healthy man.",
    "verse_18": "She said, 'I beg refuge of the Most Affectionate from you if you are afraid of God.'",
    "verse_19": "He said, 'I am only a Messenger of your Lord, that I may give you a pure son.'",
    "verse_20": "She said, 'from where shall I have a son, no man has touched me, nor I am an unchaste?",
    "verse_21": "He said,' so it is, your Lord has said, this is easy to Me', and that We make it a sign for the people and a mercy form Us, and this matter is already decreed.",
    "verse_22": "Now Maryam conceived it, then she went away with him to a far-off place.",
    "verse_23": "Then the pain of the childbirth brought her to the trunk of a palm tree. She said, 'Oh, would that I had died before this and had become a thing forgotten, lost.'",
    "verse_24": "Then one called from underneath her, grieve not undoubtedly, your Lord has caused to flow a rivulet below you.",
    "verse_25": "And shake towards yourself holding the trunk of the palm tree; fresh and ripe dates will fall upon you.",
    "verse_26": "Then eat and drink and cool your eyes; then if you see any man, then say, 'I have vowed a fast to the most Affectionate, so I shall not speak to anyone today.",
    "verse_27": "Then she brought him to her people taking him in her lap. They said, 'O Mary, you have committed a very vile thing.",
    "verse_28": "'O sister of Haroon! your father was not a wicked man and nor was your mother an unchaste woman.'",
    "verse_29": "Then Maryam pointed towards the child. They said, 'How can we talk to him who is a baby in the cradle.'",
    "verse_30": "The baby said, 'I am a bondman of Allah, He gave me the Book and made me the Communicator of unseen news (the Prophet).",
    "verse_31": "'And he made me blessed wherever I may be and enjoined on me prayer and poor due (Zakat) so long as I live.",
    "verse_32": "'And dutiful to my mother and not made me vigorous, unfortunate.",
    "verse_33": "And the same peace on me the day I was born and the day I die and the day I am raised alive.'",
    "verse_34": "This is 'Issa (Christ), the son of Maryam, a word of truth in which they doubt.",
    "verse_35": "It is not befitting to Allah that He should take to Himself anyone as son, Holy is He. When He decrees anything, thus then He says to it, 'be', it becomes at once.",
    "verse_36": "And ' Isaa said, 'Undoubtedly Allah is my Lord and your Lord, then worship Him. This path is straight.'",
    "verse_37": "Then the parties differed among themselves; then misery is for the infidels from the presence of a Great Day.",
    "verse_38": "How much they will hear and how much they will see the day they will come to Us, but today the unjust are in open error.",
    "verse_39": "And warn them of the Day of regret when the matter would have been decreed and they are in negligence and they believe not.",
    "verse_40": "Undoubtedly, We shall inherit the earth and whatever is thereon and they shall return towards Us.",
    "verse_41": "And remember Ibrahim in the Book, no doubt, he was truthful (Prophet) Communicator of unseen news.",
    "verse_42": "When he said to his father, 'O my father, why do you worship that which neither hears nor sees and nor it is of any use to you.'",
    "verse_43": "'O my father! Undoubtedly, there has come to me that knowledge which has not come to you, then follow me, I shall guide you to straight path.",
    "verse_44": "'O my father! Serve not the devil (saitan) undoubtedly, the devil is disobedient against the Most Affectionate.",
    "verse_45": "'O my father! I fear that the torment of the Most Affectionate may reach you, then you become the companion of the devil (saitan).'",
    "verse_46": "He said, 'Do you turn your face from my gods ‘O Ibrahim? No doubt, if you would not desist, then I shall stone you; and be away from me for a good long time.'",
    "verse_47": "He said, 'Now enough, peace be to you; it is near that I will beg my Lord forgiveness for you, no doubt, He is Kind enough to me.",
    "verse_48": "And I shall be apart from you and from all those whom you worship besides Allah and I shall worship my Lord, it is near that by serving my Lord I may not be unfortunate.'",
    "verse_49": "Then when he a parted from them and from their deities besides Allah, We gave him Ishaque and Yaqoob, and made each of them the communicator of unseen news (Prophet).",
    "verse_50": "And We gave them Our mercy and put for them true lofty renown.",
    "verse_51": "And remember Musa in the Book, no doubt, he was chosen one and was a Messenger, Communicator of unseen news.",
    "verse_52": "And We called him from the right side of the mount Tur and drew him near for telling Our secrets.",
    "verse_53": "And gave him out of Our mercy his brother, the Communicator of unseen news (a Prophet).",
    "verse_54": "And remember Ismail in the Book, undoubtedly, he was true in promise and was a Messenger, Communicator of unseen news (Prophet).",
    "verse_55": "And he bade his family members to pray and to give poor due (Zakat) and was pleasing to his Lord.",
    "verse_56": "And remember Idrees in the Book, undoubtedly he was a man of truth, Communicator of unseen news.",
    "verse_57": "And We raised him up to a lofty building.",
    "verse_58": "These are they on whom Allah bestowed His blessings from amongst the Communicators of unseen news, of the offspring of Adam and of them whom We bore with Nuh and of the offspring of Ibrahim and Yaqoob and of them whom We guided and chose. Whenever the verses of the Most Affectionate are recited to them, they fell down prostrating and weeping.",
    "verse_59": "Then after them came those degenerate who wasted prayer and followed their lusts, then soon they will encounter a valley of the hell.",
    "verse_60": "But those who repented and believed and did good deeds, then these people will enter Heaven and they will not be wronged in the least.",
    "verse_61": "Gardens of dwelling which the Most Affectionate promised to His bondmen in the unseen. Undoubtedly His promise is to come.",
    "verse_62": "They will not hear therein any word vain, but only greetings of peace. And for them there is their provision morning and evening.",
    "verse_63": "This is the Garden which We shall cause to inherit to that of Our bondmen who is duty bound righteous.",
    "verse_64": "(And Gibril said to the beloved Prophet), 'We angels do not descend but by the command of your honor’s Lord. His is whatever is before us and whatsoever is behind us and whatsoever is in between, and your honor’s Lord is never forgetful.'",
    "verse_65": "Lord of the heavens and earth and what is in between, then worship Him and remain firm in His worship. Do you know any other of His name?",
    "verse_66": "And the man says, 'Shall when I die, then necessarily, soon be brought forth alive?'",
    "verse_67": "And does the man not remember that We made him before when he was nothing.",
    "verse_68": "So by your Lord, We shall gather them and the devils together, and shall bring them around the Hell falling on their knees.",
    "verse_69": "Then We shall pick out from every group those who will be most fearless against the Most Affectionate.",
    "verse_70": "Then We know very well those who are worthiest to be roasted in the Fire.",
    "verse_71": "There is not one of you who may not pass over the Hell, this is necessarily a decided thing for your Lord.",
    "verse_72": "Then We shall save the God fearing, and will leave the unjust in it falling on their knees.",
    "verse_73": "And when Our bright verses are recited to them, the infidels say to Muslims, 'Which of the group's house is good and better in assembly.'",
    "verse_74": "And how many generations We have destroyed before them, that they were better in goods and outward show than them.",
    "verse_75": "Say you, 'One who is in error, then the Most Affectionate let loose him well until when they see that they are promised with, either the torment or the Hour. Now then they will know whose position is worse and whose force is weak.'",
    "verse_76": "And those who got guidance, Allah will increase them in guidance. And the abiding good things are excellent with your Lord in respect of reward and in respect of return.",
    "verse_77": "Have you seen him who has disbelieved in Our Signs and says, 'I shall surely be given wealth and children?'",
    "verse_78": "Has he looked into the unseen, or has he taken any covenant with the Most Affectionate?",
    "verse_79": "Never, now We shall put in writing what he says and will prolong for him the torment.",
    "verse_80": "And for whatever he is speaking, We shall inherit and he will come to Us alone.",
    "verse_81": "And they have taken other gods besides Allah that they may give them strength.",
    "verse_82": "Never, soon they will deny their worship and will become their opponents.",
    "verse_83": "Did you not see that We sent devils upon infidels, that they impel them well (towards sins).",
    "verse_84": "Then be not you in haste against them. We are completing their counting.",
    "verse_85": "The day We shall carry the duty bound (pious), towards the Most Affectionate, as guests.",
    "verse_86": "And will drive the culprits towards the Hell thirsty.",
    "verse_87": "The people are not the owner of intercession but only those who have taken a covenant with the Most Affectionate.",
    "verse_88": "And the infidels said, The Most Affectionate has taken a son.'",
    "verse_89": "No doubt, you brought a thing of heavy limit, (most evil.)",
    "verse_90": "It is near that the heavens may burst by it and the earth may crack down and the mountains fell down collapsed.",
    "verse_91": "That because they ascribed a son to the Most Affectionate.",
    "verse_92": "And it behaves not the Most Affectionate that he should take a son.",
    "verse_93": "All who are in heavens and earth, they shall come to the Most Affectionate as bondmen.",
    "verse_94": "No doubt, He knows their counting and has numbered them one by one.",
    "verse_95": "And of them everyone will come to Him alone on the Day of Judgement.",
    "verse_96": "Undoubtedly, those who believed and did good deeds soon the Most Affectionate will make for them love.",
    "verse_97": "So We made this Quran quite easy in your tongue that you may give glad tidings to the Godfearer and you may warn thereby a contentious people.",
    "verse_98": "And how many generations We destroyed before them. Do you see anyone of them or you hear of them any whisper?"
  },
    "count": 98
}
