{
    "name": "Luqman",
    "index": "031",
    "verse": {
        "verse_0": "In the name of God, the Gracious, the Merciful.",
        "verse_1": "Alif Lam Mim.",
    "verse_2": "These are the verses of the Book of wisdom.",
    "verse_3": "These are a guidance and mercy for the righteous.",
    "verse_4": "Those who establish the prayer and pay the poor due (Zakat) and have firm faith in the Hereafter.",
    "verse_5": "They only are upon the guidance from their Lord and they are successful.",
    "verse_6": "And some people buy words for mere playing that they may mislead from the path of Allah without knowledge and to make fun of it. For them is the humiliating torment.",
    "verse_7": "And when Our signs are recited to him, he turns proudly away, as though he heard them not, as if there were heaviness in his ears. Therefore give him good tidings of painful torment.",
    "verse_8": "Undoubtedly, those who believe and do good works, for them there are gardens of bliss.",
    "verse_9": "They will abide therein. The promise of Allah is true. And He only is the Honorable, the Wise.",
    "verse_10": "He made the heavens without pillars that you can see and put in the earth anchors lest it shake with you, and He has scattered therein all kinds of animals, and We sent down water from the sky, then We caused to grow in the earth every fine pairs of plant.",
    "verse_11": "This is the creation of Allah, show me what others have created besides Him. Nay! The unjust are in clear error.",
    "verse_12": "And undoubtedly, We bestowed on Luqman wisdom saying, 'Be grateful to Allah'. And whoever is grateful, is grateful for the good of his own and whoever is ungrateful, then certainly Allah is Self-Sufficient, All praised.",
    "verse_13": "And remember when Luqman said to his son and he was admonishing him, 'O my son, associate not anyone with Allah'. 'Undoubtedly, the association with Allah is a tremendous wrong'.",
    "verse_14": "And We have stressed on man concerning his parents, his mother bore him undergoing weakness upon weakness and his weaning takes two years, that give thanks to Me and to your parents. Lastly the return is towards Me.",
    "verse_15": "And if they both strive to make you associate with Me a thing of which you have no knowledge then obey them not and accompany them in the world very well and follow him who turned to Me recently, then to Me is your return, then I shall inform you what you used to do.",
    "verse_16": "'O my son! the evil if it be even to the weight of a grain of mustard seed, then it be in a rock or in the heavens or in the earth, Allah will bring it forth. Undoubtedly Allah is Knower of every subtlety, Aware.",
    "verse_17": "'O my son, establish prayer and bid doing good and forbid evil and be patient over whatever distress may befall you. Undoubtedly, these are affairs of determination.",
    "verse_18": "And make not your cheek crooked while talking to anyone and walk not in the earth struttingly. Undoubtedly Allah loves not any arrogant boaster.",
    "verse_19": "And walk moderately and lower your voice to some extent. Undoubtedly in all voices, the most hideous voice is of an ass.",
    "verse_20": "Have you not seen that Allah has made subservient for you whatever is in the heavens and in the earth and had bestowed upon you in full His graces open and hidden? And among people there are some who contest about Allah without knowledge and with no wisdom and without a luminous Book.",
    "verse_21": "And when it is said to them, 'follow what Allah has sent down', then they say, 'on the contrary, we shall follow that on which we found our fathers.' What! Even though the devil may be calling them towards the torment of the Hell?",
    "verse_22": "Therefore whoso submits his face towards Allah and be a good doer, then undoubtedly, he has caught hold of a strong handle. And towards Allah is the end of all affairs.",
    "verse_23": "And whoso commits infidelity, let not his infidelity grieve you. To Us is their return, then We shall tell them what they used to do. Undoubtedly Allah knows what is inside the breasts.",
    "verse_24": "We shall allow them to carry on a little, then making them helpless We shall drive towards severe torment.",
    "verse_25": "And if you ask them who has created the heavens and the earth, they will surely say 'Allah', say you, 'All praises belong to Allah'. But most of them know not.",
    "verse_26": "To Allah belongs whatever is in the heavens and the earth. Undoubtedly Allah alone is Self- Sufficient AllPraiseworthy.",
    "verse_27": "And if all trees in the earth were pens and the seas were ink of it with seven more seas added after it, then the words of Allah would not be exhausted. Undoubtedly, Allah is Honorable, Wise.",
    "verse_28": "The creation of you all and raising on the Day of Resurrection is only like a single soul. Undoubtedly, Allah sees, hears.",
    "verse_29": "O Listener! Have you not seen that Allah brings night in the day and makes the day in the night and He made the sun and the moon to serve, each pursues its course till an appointed time and that Allah is Aware of your works?",
    "verse_30": "This is because Allah is the only Truth and that which they worship besides Him are all falsehood and because only Allah is High, Great.",
    "verse_31": "Have you not seen that the boat moves in the river by the grace of Allah, that He may show you some of His Signs? Undoubtedly in it are signs for every patient, grateful.",
    "verse_32": "And when any wave befalls them like mountains, then they call upon Allah having pure faith in Him. But when He brings them safe towards land, then some of them keep to the middle course. And none shall deny Our signs but every perfidious, ungrateful.",
    "verse_33": "O people! Fear your Lord and have apprehension of the day when no father will be of any avail to his son and not any serviceable son will be able to provide any benefit to his father. Undoubtedly the promise of Allah is true, therefore let never the life of this world deceive you and let never that big deceiver (Satan) deceive you concerning Allah.",
    "verse_34": "Undoubtedly, with Allah is the knowledge of the Hour, and He sends down rain and knows what is in the wombs of the mothers and no soul knows what it will earn tomorrow and no soul knows in what land it will die. Undoubtedly, Allah is the Knower, All- Aware."
    },
    "count": 34
}
